sparkfun/Arduino_Apollo3/cores/arduino/am_sdk_ap3/CMSIS/AmbiqMicro/Include/apollo3c.h
    struct {
      __IOM uint32_t PAD48PULL  : 1;            /*!< [0..0] Pad 48 pullup enable                                               */
      __IOM uint32_t PAD48INPEN : 1;            /*!< [1..1] Pad 48 input enable                                                */
      __IOM uint32_t PAD48STRNG : 1;            /*!< [2..2] Pad 48 drive strength                                              */
      __IOM uint32_t PAD48FNCSEL : 3;           /*!< [5..3] Pad 48 function select                                             */
      __IOM uint32_t PAD48RSEL  : 2;            /*!< [7..6] Pad 48 pullup resistor selection.                                  */
      __IOM uint32_t PAD49PULL  : 1;            /*!< [8..8] Pad 49 pullup enable                                               */
      __IOM uint32_t PAD49INPEN : 1;            /*!< [9..9] Pad 49 input enable                                                */
      __IOM uint32_t PAD49STRNG : 1;            /*!< [10..10] Pad 49 drive strength                                            */
      __IOM uint32_t PAD49FNCSEL : 3;           /*!< [13..11] Pad 49 function select                                           */
      __IOM uint32_t PAD49RSEL  : 2;            /*!< [15..14] Pad 49 pullup resistor selection.                                */
      __IOM uint32_t PAD50PULL  : 1;            /*!< [16..16] Pad 50 pullup enable                                             */
      __IOM uint32_t PAD50INPEN : 1;            /*!< [17..17] Pad 50 input enable                                              */
      __IOM uint32_t PAD50STRNG : 1;            /*!< [18..18] Pad 50 drive strength                                            */
      __IOM uint32_t PAD50FNCSEL : 3;           /*!< [21..19] Pad 50 function select                                           */
      __IM  uint32_t            : 2;
      __IOM uint32_t PAD51PULL  : 1;            /*!< [24..24] Pad 51 pullup enable                                             */
      __IOM uint32_t PAD51INPEN : 1;            /*!< [25..25] Pad 51 input enable                                              */
      __IOM uint32_t PAD51STRNG : 1;            /*!< [26..26] Pad 51 drive strength                                            */
      __IOM uint32_t PAD51FNCSEL : 3;           /*!< [29..27] Pad 51 function select                                           */
    } PADREGM_b;
  } ;

  union {
    __IOM uint32_t PADREGN;                     /*!< (@ 0x00000034) Pad Configuration Register N (Pads 52-55)                  */

    struct {
      __IOM uint32_t PAD52PULL  : 1;            /*!< [0..0] Pad 52 pullup enable                                               */
      __IOM uint32_t PAD52INPEN : 1;            /*!< [1..1] Pad 52 input enable                                                */
      __IOM uint32_t PAD52STRNG : 1;            /*!< [2..2] Pad 52 drive strength                                              */
      __IOM uint32_t PAD52FNCSEL : 3;           /*!< [5..3] Pad 52 function select                                             */
      __IM  uint32_t            : 2;
      __IOM uint32_t PAD53PULL  : 1;            /*!< [8..8] Pad 53 pullup enable                                               */
      __IOM uint32_t PAD53INPEN : 1;            /*!< [9..9] Pad 53 input enable                                                */
      __IOM uint32_t PAD53STRNG : 1;            /*!< [10..10] Pad 53 drive strength                                            */
      __IOM uint32_t PAD53FNCSEL : 3;           /*!< [13..11] Pad 53 function select                                           */
      __IM  uint32_t            : 2;
      __IOM uint32_t PAD54PULL  : 1;            /*!< [16..16] Pad 54 pullup enable                                             */
      __IOM uint32_t PAD54INPEN : 1;            /*!< [17..17] Pad 54 input enable                                              */
      __IOM uint32_t PAD54STRNG : 1;            /*!< [18..18] Pad 54 drive strength                                            */
      __IOM uint32_t PAD54FNCSEL : 3;           /*!< [21..19] Pad 54 function select                                           */
      __IM  uint32_t            : 2;
      __IOM uint32_t PAD55PULL  : 1;            /*!< [24..24] Pad 55 pullup enable                                             */
      __IOM uint32_t PAD55INPEN : 1;            /*!< [25..25] Pad 55 input enable                                              */
      __IOM uint32_t PAD55STRNG : 1;            /*!< [26..26] Pad 55 drive strength                                            */
      __IOM uint32_t PAD55FNCSEL : 3;           /*!< [29..27] Pad 55 function select                                           */
    } PADREGN_b;
  } ;

  union {
    __IOM uint32_t PADREGO;                     /*!< (@ 0x00000038) Pad Configuration Register O (Pads 56-59)                  */

    struct {
      __IOM uint32_t PAD56PULL  : 1;            /*!< [0..0] Pad 56 pullup enable                                               */
      __IOM uint32_t PAD56INPEN : 1;            /*!< [1..1] Pad 56 input enable                                                */
      __IOM uint32_t PAD56STRNG : 1;            /*!< [2..2] Pad 56 drive strength                                              */
      __IOM uint32_t PAD56FNCSEL : 3;           /*!< [5..3] Pad 56 function select                                             */
      __IM  uint32_t            : 2;
      __IOM uint32_t PAD57PULL  : 1;            /*!< [8..8] Pad 57 pullup enable                                               */
      __IOM uint32_t PAD57INPEN : 1;            /*!< [9..9] Pad 57 input enable                                                */
      __IOM uint32_t PAD57STRNG : 1;            /*!< [10..10] Pad 57 drive strength                                            */
      __IOM uint32_t PAD57FNCSEL : 3;           /*!< [13..11] Pad 57 function select                                           */
      __IM  uint32_t            : 2;
      __IOM uint32_t PAD58PULL  : 1;            /*!< [16..16] Pad 58 pullup enable                                             */
      __IOM uint32_t PAD58INPEN : 1;            /*!< [17..17] Pad 58 input enable                                              */
      __IOM uint32_t PAD58STRNG : 1;            /*!< [18..18] Pad 58 drive strength                                            */
      __IOM uint32_t PAD58FNCSEL : 3;           /*!< [21..19] Pad 58 function select                                           */
      __IM  uint32_t            : 2;
      __IOM uint32_t PAD59PULL  : 1;            /*!< [24..24] Pad 59 pullup enable                                             */
      __IOM uint32_t PAD59INPEN : 1;            /*!< [25..25] Pad 59 input enable                                              */
      __IOM uint32_t PAD59STRNG : 1;            /*!< [26..26] Pad 59 drive strength                                            */
      __IOM uint32_t PAD59FNCSEL : 3;           /*!< [29..27] Pad 59 function select                                           */
    } PADREGO_b;
  } ;

  union {
    __IOM uint32_t PADREGP;                     /*!< (@ 0x0000003C) Pad Configuration Register P (Pads 60-63)                  */

