sparkfun/Arduino_Apollo3/cores/arduino/am_sdk_ap3/CMSIS/AmbiqMicro/Include/apollo3c.h
    struct {
      __IOM uint32_t PAD60PULL  : 1;            /*!< [0..0] Pad 60 pullup enable                                               */
      __IOM uint32_t PAD60INPEN : 1;            /*!< [1..1] Pad 60 input enable                                                */
      __IOM uint32_t PAD60STRNG : 1;            /*!< [2..2] Pad 60 drive strength                                              */
      __IOM uint32_t PAD60FNCSEL : 3;           /*!< [5..3] Pad 60 function select                                             */
      __IM  uint32_t            : 2;
      __IOM uint32_t PAD61PULL  : 1;            /*!< [8..8] Pad 61 pullup enable                                               */
      __IOM uint32_t PAD61INPEN : 1;            /*!< [9..9] Pad 61 input enable                                                */
      __IOM uint32_t PAD61STRNG : 1;            /*!< [10..10] Pad 61 drive strength                                            */
      __IOM uint32_t PAD61FNCSEL : 3;           /*!< [13..11] Pad 61 function select                                           */
      __IM  uint32_t            : 2;
      __IOM uint32_t PAD62PULL  : 1;            /*!< [16..16] Pad 62 pullup enable                                             */
      __IOM uint32_t PAD62INPEN : 1;            /*!< [17..17] Pad 62 input enable                                              */
      __IOM uint32_t PAD62STRNG : 1;            /*!< [18..18] Pad 62 drive strength                                            */
      __IOM uint32_t PAD62FNCSEL : 3;           /*!< [21..19] Pad 62 function select                                           */
      __IM  uint32_t            : 2;
      __IOM uint32_t PAD63PULL  : 1;            /*!< [24..24] Pad 63 pullup enable                                             */
      __IOM uint32_t PAD63INPEN : 1;            /*!< [25..25] Pad 63 input enable                                              */
      __IOM uint32_t PAD63STRNG : 1;            /*!< [26..26] Pad 63 drive strength                                            */
      __IOM uint32_t PAD63FNCSEL : 3;           /*!< [29..27] Pad 63 function select                                           */
    } PADREGP_b;
  } ;

  union {
    __IOM uint32_t PADREGQ;                     /*!< (@ 0x00000040) Pad Configuration Register Q (Pads 64-67)                  */

    struct {
      __IOM uint32_t PAD64PULL  : 1;            /*!< [0..0] Pad 64 pullup enable                                               */
      __IOM uint32_t PAD64INPEN : 1;            /*!< [1..1] Pad 64 input enable                                                */
      __IOM uint32_t PAD64STRNG : 1;            /*!< [2..2] Pad 64 drive strength                                              */
      __IOM uint32_t PAD64FNCSEL : 3;           /*!< [5..3] Pad 64 function select                                             */
      __IM  uint32_t            : 2;
      __IOM uint32_t PAD65PULL  : 1;            /*!< [8..8] Pad 65 pullup enable                                               */
      __IOM uint32_t PAD65INPEN : 1;            /*!< [9..9] Pad 65 input enable                                                */
      __IOM uint32_t PAD65STRNG : 1;            /*!< [10..10] Pad 65 drive strength                                            */
      __IOM uint32_t PAD65FNCSEL : 3;           /*!< [13..11] Pad 65 function select                                           */
      __IM  uint32_t            : 2;
      __IOM uint32_t PAD66PULL  : 1;            /*!< [16..16] Pad 66 pullup enable                                             */
      __IOM uint32_t PAD66INPEN : 1;            /*!< [17..17] Pad 66 input enable                                              */
      __IOM uint32_t PAD66STRNG : 1;            /*!< [18..18] Pad 66 drive strength                                            */
      __IOM uint32_t PAD66FNCSEL : 3;           /*!< [21..19] Pad 66 function select                                           */
      __IM  uint32_t            : 2;
      __IOM uint32_t PAD67PULL  : 1;            /*!< [24..24] Pad 67 pullup enable                                             */
      __IOM uint32_t PAD67INPEN : 1;            /*!< [25..25] Pad 67 input enable                                              */
      __IOM uint32_t PAD67STRNG : 1;            /*!< [26..26] Pad 67 drive strength                                            */
      __IOM uint32_t PAD67FNCSEL : 3;           /*!< [29..27] Pad 67 function select                                           */
    } PADREGQ_b;
  } ;

  union {
    __IOM uint32_t PADREGR;                     /*!< (@ 0x00000044) Pad Configuration Register R (Pads 68-71)                  */

    struct {
      __IOM uint32_t PAD68PULL  : 1;            /*!< [0..0] Pad 68 pullup enable                                               */
      __IOM uint32_t PAD68INPEN : 1;            /*!< [1..1] Pad 68 input enable                                                */
      __IOM uint32_t PAD68STRNG : 1;            /*!< [2..2] Pad 68 drive strength                                              */
      __IOM uint32_t PAD68FNCSEL : 3;           /*!< [5..3] Pad 68 function select                                             */
      __IM  uint32_t            : 2;
      __IOM uint32_t PAD69PULL  : 1;            /*!< [8..8] Pad 69 pullup enable                                               */
      __IOM uint32_t PAD69INPEN : 1;            /*!< [9..9] Pad 69 input enable                                                */
      __IOM uint32_t PAD69STRNG : 1;            /*!< [10..10] Pad 69 drive strength                                            */
      __IOM uint32_t PAD69FNCSEL : 3;           /*!< [13..11] Pad 69 function select                                           */
      __IM  uint32_t            : 2;
      __IOM uint32_t PAD70PULL  : 1;            /*!< [16..16] Pad 70 pullup enable                                             */
      __IOM uint32_t PAD70INPEN : 1;            /*!< [17..17] Pad 70 input enable                                              */
      __IOM uint32_t PAD70STRNG : 1;            /*!< [18..18] Pad 70 drive strength                                            */
      __IOM uint32_t PAD70FNCSEL : 3;           /*!< [21..19] Pad 70 function select                                           */
      __IM  uint32_t            : 2;
      __IOM uint32_t PAD71PULL  : 1;            /*!< [24..24] Pad 71 pullup enable                                             */
      __IOM uint32_t PAD71INPEN : 1;            /*!< [25..25] Pad 71 input enable                                              */
      __IOM uint32_t PAD71STRNG : 1;            /*!< [26..26] Pad 71 drive strength                                            */
      __IOM uint32_t PAD71FNCSEL : 3;           /*!< [29..27] Pad 71 function select                                           */
    } PADREGR_b;
  } ;

  union {
    __IOM uint32_t PADREGS;                     /*!< (@ 0x00000048) Pad Configuration Register S (Pads 72-75)                  */

