sparkfun/Arduino_Apollo3/cores/arduino/am_sdk_ap3/CMSIS/AmbiqMicro/Include/apollo3c.h
    struct {
      __IOM uint32_t GPIO64INCFG : 1;           /*!< [0..0] GPIO64 input enable.                                               */
      __IOM uint32_t GPIO64OUTCFG : 2;          /*!< [2..1] GPIO64 output configuration.                                       */
      __IOM uint32_t GPIO64INTD : 1;            /*!< [3..3] GPIO64 interrupt direction, nCE polarity.                          */
      __IOM uint32_t GPIO65INCFG : 1;           /*!< [4..4] GPIO65 input enable.                                               */
      __IOM uint32_t GPIO65OUTCFG : 2;          /*!< [6..5] GPIO65 output configuration.                                       */
      __IOM uint32_t GPIO65INTD : 1;            /*!< [7..7] GPIO65 interrupt direction, nCE polarity.                          */
      __IOM uint32_t GPIO66INCFG : 1;           /*!< [8..8] GPIO66 input enable.                                               */
      __IOM uint32_t GPIO66OUTCFG : 2;          /*!< [10..9] GPIO66 output configuration.                                      */
      __IOM uint32_t GPIO66INTD : 1;            /*!< [11..11] GPIO66 interrupt direction, nCE polarity.                        */
      __IOM uint32_t GPIO67INCFG : 1;           /*!< [12..12] GPIO67 input enable.                                             */
      __IOM uint32_t GPIO67OUTCFG : 2;          /*!< [14..13] GPIO67 output configuration.                                     */
      __IOM uint32_t GPIO67INTD : 1;            /*!< [15..15] GPIO67 interrupt direction, nCE polarity.                        */
      __IOM uint32_t GPIO68INCFG : 1;           /*!< [16..16] GPIO68 input enable.                                             */
      __IOM uint32_t GPIO68OUTCFG : 2;          /*!< [18..17] GPIO68 output configuration.                                     */
      __IOM uint32_t GPIO68INTD : 1;            /*!< [19..19] GPIO68 interrupt direction, nCE polarity.                        */
      __IOM uint32_t GPIO69INCFG : 1;           /*!< [20..20] GPIO69 input enable.                                             */
      __IOM uint32_t GPIO69OUTCFG : 2;          /*!< [22..21] GPIO69 output configuration.                                     */
      __IOM uint32_t GPIO69INTD : 1;            /*!< [23..23] GPIO69 interrupt direction, nCE polarity.                        */
      __IOM uint32_t GPIO70INCFG : 1;           /*!< [24..24] GPIO70 input enable.                                             */
      __IOM uint32_t GPIO70OUTCFG : 2;          /*!< [26..25] GPIO70 output configuration.                                     */
      __IOM uint32_t GPIO70INTD : 1;            /*!< [27..27] GPIO70 interrupt direction, nCE polarity.                        */
      __IOM uint32_t GPIO71INCFG : 1;           /*!< [28..28] GPIO71 input enable.                                             */
      __IOM uint32_t GPIO71OUTCFG : 2;          /*!< [30..29] GPIO71 output configuration.                                     */
      __IOM uint32_t GPIO71INTD : 1;            /*!< [31..31] GPIO71 interrupt direction, nCE polarity.                        */
    } CFGI_b;
  } ;

  union {
    __IOM uint32_t CFGJ;                        /*!< (@ 0x00000070) GPIO Configuration Register J (Pads 79-72)                 */

    struct {
      __IOM uint32_t GPIO72INCFG : 1;           /*!< [0..0] GPIO72 input enable.                                               */
      __IOM uint32_t GPIO72OUTCFG : 2;          /*!< [2..1] GPIO72 output configuration.                                       */
      __IOM uint32_t GPIO72INTD : 1;            /*!< [3..3] GPIO72 interrupt direction, nCE polarity.                          */
      __IOM uint32_t GPIO73INCFG : 1;           /*!< [4..4] GPIO73 input enable.                                               */
      __IOM uint32_t GPIO73OUTCFG : 2;          /*!< [6..5] GPIO73 output configuration.                                       */
      __IOM uint32_t GPIO73INTD : 1;            /*!< [7..7] GPIO73 interrupt direction, nCE polarity.                          */
    } CFGJ_b;
  } ;

  union {
    __IOM uint32_t PADKEY;                      /*!< (@ 0x00000074) Key Register for all pad configuration registers           */

    struct {
      __IOM uint32_t PADKEY     : 32;           /*!< [31..0] Key register value.                                               */
    } PADKEY_b;
  } ;
  __IM  uint32_t  RESERVED[2];

  union {
    __IOM uint32_t RDA;                         /*!< (@ 0x00000080) GPIO Input Register A                                      */

    struct {
      __IOM uint32_t RDA        : 32;           /*!< [31..0] GPIO31-0 read data.                                               */
    } RDA_b;
  } ;

  union {
    __IOM uint32_t RDB;                         /*!< (@ 0x00000084) GPIO Input Register B                                      */

    struct {
      __IOM uint32_t RDB        : 32;           /*!< [31..0] GPIO63-32 read data.                                              */
    } RDB_b;
  } ;

  union {
    __IOM uint32_t RDC;                         /*!< (@ 0x00000088) GPIO Input Register C                                      */

    struct {
      __IOM uint32_t RDC        : 10;           /*!< [9..0] GPIO73-64 read data.                                               */
    } RDC_b;
  } ;

  union {
    __IOM uint32_t WTA;                         /*!< (@ 0x0000008C) GPIO Output Register A                                     */

    struct {
      __IOM uint32_t WTA        : 32;           /*!< [31..0] GPIO31-0 write data.                                              */
    } WTA_b;
  } ;

  union {
    __IOM uint32_t WTB;                         /*!< (@ 0x00000090) GPIO Output Register B                                     */

    struct {
      __IOM uint32_t WTB        : 32;           /*!< [31..0] GPIO63-32 write data.                                             */
    } WTB_b;
  } ;

  union {
    __IOM uint32_t WTC;                         /*!< (@ 0x00000094) GPIO Output Register C                                     */

