sparkfun/Arduino_Apollo3/cores/arduino/am_sdk_ap3/CMSIS/AmbiqMicro/Include/apollo3c.h
    struct {
      __IOM uint32_t PAD44_DS1  : 1;            /*!< [0..0] Pad 44 high order drive strength selection. Used in conjunction
                                                     with PAD44STRNG field to set the pad drive strength.                      */
      __IM  uint32_t            : 3;
      __IOM uint32_t PAD44_SR   : 1;            /*!< [4..4] Pad 47 slew rate selection.                                        */
      __IM  uint32_t            : 3;
      __IOM uint32_t PAD45_DS1  : 1;            /*!< [8..8] Pad 45 high order drive strength selection. Used in conjunction
                                                     with PAD45STRNG field to set the pad drive strength.                      */
      __IM  uint32_t            : 3;
      __IOM uint32_t PAD45_SR   : 1;            /*!< [12..12] Pad 47 slew rate selection.                                      */
      __IM  uint32_t            : 3;
      __IOM uint32_t PAD46_DS1  : 1;            /*!< [16..16] Pad 46 high order drive strength selection. Used in
                                                     conjunction with PAD46STRNG field to set the pad drive
                                                     strength.                                                                 */
      __IM  uint32_t            : 3;
      __IOM uint32_t PAD46_SR   : 1;            /*!< [20..20] Pad 47 slew rate selection.                                      */
      __IM  uint32_t            : 3;
      __IOM uint32_t PAD47_DS1  : 1;            /*!< [24..24] Pad 47 high order drive strength selection. Used in
                                                     conjunction with PAD47STRNG field to set the pad drive
                                                     strength.                                                                 */
      __IM  uint32_t            : 3;
      __IOM uint32_t PAD47_SR   : 1;            /*!< [28..28] Pad 47 slew rate selection.                                      */
    } ALTPADCFGL_b;
  } ;

  union {
    __IOM uint32_t ALTPADCFGM;                  /*!< (@ 0x00000128) Alternate Pad Configuration reg0 (Pads 51-48)              */

    struct {
      __IOM uint32_t PAD48_DS1  : 1;            /*!< [0..0] Pad 48 high order drive strength selection. Used in conjunction
                                                     with PAD48STRNG field to set the pad drive strength.                      */
      __IM  uint32_t            : 3;
      __IOM uint32_t PAD48_SR   : 1;            /*!< [4..4] Pad 51 slew rate selection.                                        */
      __IM  uint32_t            : 3;
      __IOM uint32_t PAD49_DS1  : 1;            /*!< [8..8] Pad 49 high order drive strength selection. Used in conjunction
                                                     with PAD49STRNG field to set the pad drive strength.                      */
      __IM  uint32_t            : 3;
      __IOM uint32_t PAD49_SR   : 1;            /*!< [12..12] Pad 51 slew rate selection.                                      */
      __IM  uint32_t            : 3;
      __IOM uint32_t PAD50_DS1  : 1;            /*!< [16..16] Pad 50 high order drive strength selection. Used in
                                                     conjunction with PAD50STRNG field to set the pad drive
                                                     strength.                                                                 */
      __IM  uint32_t            : 3;
      __IOM uint32_t PAD50_SR   : 1;            /*!< [20..20] Pad 51 slew rate selection.                                      */
      __IM  uint32_t            : 3;
      __IOM uint32_t PAD51_DS1  : 1;            /*!< [24..24] Pad 51 high order drive strength selection. Used in
                                                     conjunction with PAD51STRNG field to set the pad drive
                                                     strength.                                                                 */
      __IM  uint32_t            : 3;
      __IOM uint32_t PAD51_SR   : 1;            /*!< [28..28] Pad 51 slew rate selection.                                      */
    } ALTPADCFGM_b;
  } ;

  union {
    __IOM uint32_t ALTPADCFGN;                  /*!< (@ 0x0000012C) Alternate Pad Configuration reg0 (Pads 55-52)              */

    struct {
      __IOM uint32_t PAD52_DS1  : 1;            /*!< [0..0] Pad 52 high order drive strength selection. Used in conjunction
                                                     with PAD52STRNG field to set the pad drive strength.                      */
      __IM  uint32_t            : 3;
      __IOM uint32_t PAD52_SR   : 1;            /*!< [4..4] Pad 55 slew rate selection.                                        */
      __IM  uint32_t            : 3;
      __IOM uint32_t PAD53_DS1  : 1;            /*!< [8..8] Pad 53 high order drive strength selection. Used in conjunction
                                                     with PAD53STRNG field to set the pad drive strength.                      */
      __IM  uint32_t            : 3;
      __IOM uint32_t PAD53_SR   : 1;            /*!< [12..12] Pad 55 slew rate selection.                                      */
      __IM  uint32_t            : 3;
      __IOM uint32_t PAD54_DS1  : 1;            /*!< [16..16] Pad 54 high order drive strength selection. Used in
                                                     conjunction with PAD54STRNG field to set the pad drive
                                                     strength.                                                                 */
      __IM  uint32_t            : 3;
      __IOM uint32_t PAD54_SR   : 1;            /*!< [20..20] Pad 55 slew rate selection.                                      */
      __IM  uint32_t            : 3;
      __IOM uint32_t PAD55_DS1  : 1;            /*!< [24..24] Pad 55 high order drive strength selection. Used in
                                                     conjunction with PAD55STRNG field to set the pad drive
                                                     strength.                                                                 */
      __IM  uint32_t            : 3;
      __IOM uint32_t PAD55_SR   : 1;            /*!< [28..28] Pad 55 slew rate selection.                                      */
    } ALTPADCFGN_b;
  } ;

  union {
    __IOM uint32_t ALTPADCFGO;                  /*!< (@ 0x00000130) Alternate Pad Configuration reg0 (Pads 59-56)              */

