sparkfun/Arduino_Apollo3/cores/arduino/am_sdk_ap3/CMSIS/AmbiqMicro/Include/apollo3c.h
    struct {
      __IOM uint32_t PAD56_DS1  : 1;            /*!< [0..0] Pad 56 high order drive strength selection. Used in conjunction
                                                     with PAD56STRNG field to set the pad drive strength.                      */
      __IM  uint32_t            : 3;
      __IOM uint32_t PAD56_SR   : 1;            /*!< [4..4] Pad 59 slew rate selection.                                        */
      __IM  uint32_t            : 3;
      __IOM uint32_t PAD57_DS1  : 1;            /*!< [8..8] Pad 57 high order drive strength selection. Used in conjunction
                                                     with PAD57STRNG field to set the pad drive strength.                      */
      __IM  uint32_t            : 3;
      __IOM uint32_t PAD57_SR   : 1;            /*!< [12..12] Pad 59 slew rate selection.                                      */
      __IM  uint32_t            : 3;
      __IOM uint32_t PAD58_DS1  : 1;            /*!< [16..16] Pad 58 high order drive strength selection. Used in
                                                     conjunction with PAD58STRNG field to set the pad drive
                                                     strength.                                                                 */
      __IM  uint32_t            : 3;
      __IOM uint32_t PAD58_SR   : 1;            /*!< [20..20] Pad 59 slew rate selection.                                      */
      __IM  uint32_t            : 3;
      __IOM uint32_t PAD59_DS1  : 1;            /*!< [24..24] Pad 59 high order drive strength selection. Used in
                                                     conjunction with PAD59STRNG field to set the pad drive
                                                     strength.                                                                 */
      __IM  uint32_t            : 3;
      __IOM uint32_t PAD59_SR   : 1;            /*!< [28..28] Pad 59 slew rate selection.                                      */
    } ALTPADCFGO_b;
  } ;

  union {
    __IOM uint32_t ALTPADCFGP;                  /*!< (@ 0x00000134) Alternate Pad Configuration reg0 (Pads 63-60)              */

    struct {
      __IOM uint32_t PAD60_DS1  : 1;            /*!< [0..0] Pad 60 high order drive strength selection. Used in conjunction
                                                     with PAD60STRNG field to set the pad drive strength.                      */
      __IM  uint32_t            : 3;
      __IOM uint32_t PAD60_SR   : 1;            /*!< [4..4] Pad 63 slew rate selection.                                        */
      __IM  uint32_t            : 3;
      __IOM uint32_t PAD61_DS1  : 1;            /*!< [8..8] Pad 61 high order drive strength selection. Used in conjunction
                                                     with PAD61STRNG field to set the pad drive strength.                      */
      __IM  uint32_t            : 3;
      __IOM uint32_t PAD61_SR   : 1;            /*!< [12..12] Pad 63 slew rate selection.                                      */
      __IM  uint32_t            : 3;
      __IOM uint32_t PAD62_DS1  : 1;            /*!< [16..16] Pad 62 high order drive strength selection. Used in
                                                     conjunction with PAD62STRNG field to set the pad drive
                                                     strength.                                                                 */
      __IM  uint32_t            : 3;
      __IOM uint32_t PAD62_SR   : 1;            /*!< [20..20] Pad 63 slew rate selection.                                      */
      __IM  uint32_t            : 3;
      __IOM uint32_t PAD63_DS1  : 1;            /*!< [24..24] Pad 63 high order drive strength selection. Used in
                                                     conjunction with PAD63STRNG field to set the pad drive
                                                     strength.                                                                 */
      __IM  uint32_t            : 3;
      __IOM uint32_t PAD63_SR   : 1;            /*!< [28..28] Pad 63 slew rate selection.                                      */
    } ALTPADCFGP_b;
  } ;

  union {
    __IOM uint32_t ALTPADCFGQ;                  /*!< (@ 0x00000138) Alternate Pad Configuration reg0 (Pads 67-64)              */

    struct {
      __IOM uint32_t PAD64_DS1  : 1;            /*!< [0..0] Pad 64 high order drive strength selection. Used in conjunction
                                                     with PAD64STRNG field to set the pad drive strength.                      */
      __IM  uint32_t            : 3;
      __IOM uint32_t PAD64_SR   : 1;            /*!< [4..4] Pad 67 slew rate selection.                                        */
      __IM  uint32_t            : 3;
      __IOM uint32_t PAD65_DS1  : 1;            /*!< [8..8] Pad 65 high order drive strength selection. Used in conjunction
                                                     with PAD65STRNG field to set the pad drive strength.                      */
      __IM  uint32_t            : 3;
      __IOM uint32_t PAD65_SR   : 1;            /*!< [12..12] Pad 67 slew rate selection.                                      */
      __IM  uint32_t            : 3;
      __IOM uint32_t PAD66_DS1  : 1;            /*!< [16..16] Pad 66 high order drive strength selection. Used in
                                                     conjunction with PAD66STRNG field to set the pad drive
                                                     strength.                                                                 */
      __IM  uint32_t            : 3;
      __IOM uint32_t PAD66_SR   : 1;            /*!< [20..20] Pad 67 slew rate selection.                                      */
      __IM  uint32_t            : 3;
      __IOM uint32_t PAD67_DS1  : 1;            /*!< [24..24] Pad 67 high order drive strength selection. Used in
                                                     conjunction with PAD67STRNG field to set the pad drive
                                                     strength.                                                                 */
      __IM  uint32_t            : 3;
      __IOM uint32_t PAD67_SR   : 1;            /*!< [28..28] Pad 67 slew rate selection.                                      */
    } ALTPADCFGQ_b;
  } ;

  union {
    __IOM uint32_t ALTPADCFGR;                  /*!< (@ 0x0000013C) Alternate Pad Configuration reg0 (Pads 71-68)              */

