sparkfun/Arduino_Apollo3/cores/arduino/am_sdk_ap3/CMSIS/AmbiqMicro/Include/apollo3c.h
    struct {
      __IOM uint32_t GPIO32     : 1;            /*!< [0..0] GPIO32 interrupt.                                                  */
      __IOM uint32_t GPIO33     : 1;            /*!< [1..1] GPIO33 interrupt.                                                  */
      __IOM uint32_t GPIO34     : 1;            /*!< [2..2] GPIO34 interrupt.                                                  */
      __IOM uint32_t GPIO35     : 1;            /*!< [3..3] GPIO35 interrupt.                                                  */
      __IOM uint32_t GPIO36     : 1;            /*!< [4..4] GPIO36 interrupt.                                                  */
      __IOM uint32_t GPIO37     : 1;            /*!< [5..5] GPIO37 interrupt.                                                  */
      __IOM uint32_t GPIO38     : 1;            /*!< [6..6] GPIO38 interrupt.                                                  */
      __IOM uint32_t GPIO39     : 1;            /*!< [7..7] GPIO39 interrupt.                                                  */
      __IOM uint32_t GPIO40     : 1;            /*!< [8..8] GPIO40 interrupt.                                                  */
      __IOM uint32_t GPIO41     : 1;            /*!< [9..9] GPIO41 interrupt.                                                  */
      __IOM uint32_t GPIO42     : 1;            /*!< [10..10] GPIO42 interrupt.                                                */
      __IOM uint32_t GPIO43     : 1;            /*!< [11..11] GPIO43 interrupt.                                                */
      __IOM uint32_t GPIO44     : 1;            /*!< [12..12] GPIO44 interrupt.                                                */
      __IOM uint32_t GPIO45     : 1;            /*!< [13..13] GPIO45 interrupt.                                                */
      __IOM uint32_t GPIO46     : 1;            /*!< [14..14] GPIO46 interrupt.                                                */
      __IOM uint32_t GPIO47     : 1;            /*!< [15..15] GPIO47 interrupt.                                                */
      __IOM uint32_t GPIO48     : 1;            /*!< [16..16] GPIO48 interrupt.                                                */
      __IOM uint32_t GPIO49     : 1;            /*!< [17..17] GPIO49 interrupt.                                                */
      __IOM uint32_t GPIO50     : 1;            /*!< [18..18] GPIO50 interrupt.                                                */
      __IOM uint32_t GPIO51     : 1;            /*!< [19..19] GPIO51 interrupt.                                                */
      __IOM uint32_t GPIO52     : 1;            /*!< [20..20] GPIO52 interrupt.                                                */
      __IOM uint32_t GPIO53     : 1;            /*!< [21..21] GPIO53 interrupt.                                                */
      __IOM uint32_t GPIO54     : 1;            /*!< [22..22] GPIO54 interrupt.                                                */
      __IOM uint32_t GPIO55     : 1;            /*!< [23..23] GPIO55 interrupt.                                                */
      __IOM uint32_t GPIO56     : 1;            /*!< [24..24] GPIO56 interrupt.                                                */
      __IOM uint32_t GPIO57     : 1;            /*!< [25..25] GPIO57 interrupt.                                                */
      __IOM uint32_t GPIO58     : 1;            /*!< [26..26] GPIO58 interrupt.                                                */
      __IOM uint32_t GPIO59     : 1;            /*!< [27..27] GPIO59 interrupt.                                                */
      __IOM uint32_t GPIO60     : 1;            /*!< [28..28] GPIO60 interrupt.                                                */
      __IOM uint32_t GPIO61     : 1;            /*!< [29..29] GPIO61 interrupt.                                                */
      __IOM uint32_t GPIO62     : 1;            /*!< [30..30] GPIO62 interrupt.                                                */
      __IOM uint32_t GPIO63     : 1;            /*!< [31..31] GPIO63 interrupt.                                                */
    } INT1EN_b;
  } ;

  union {
    __IOM uint32_t INT1STAT;                    /*!< (@ 0x00000224) GPIO Interrupt Registers 63-32: Status                     */

    struct {
      __IOM uint32_t GPIO32     : 1;            /*!< [0..0] GPIO32 interrupt.                                                  */
      __IOM uint32_t GPIO33     : 1;            /*!< [1..1] GPIO33 interrupt.                                                  */
      __IOM uint32_t GPIO34     : 1;            /*!< [2..2] GPIO34 interrupt.                                                  */
      __IOM uint32_t GPIO35     : 1;            /*!< [3..3] GPIO35 interrupt.                                                  */
      __IOM uint32_t GPIO36     : 1;            /*!< [4..4] GPIO36 interrupt.                                                  */
      __IOM uint32_t GPIO37     : 1;            /*!< [5..5] GPIO37 interrupt.                                                  */
      __IOM uint32_t GPIO38     : 1;            /*!< [6..6] GPIO38 interrupt.                                                  */
      __IOM uint32_t GPIO39     : 1;            /*!< [7..7] GPIO39 interrupt.                                                  */
      __IOM uint32_t GPIO40     : 1;            /*!< [8..8] GPIO40 interrupt.                                                  */
      __IOM uint32_t GPIO41     : 1;            /*!< [9..9] GPIO41 interrupt.                                                  */
      __IOM uint32_t GPIO42     : 1;            /*!< [10..10] GPIO42 interrupt.                                                */
      __IOM uint32_t GPIO43     : 1;            /*!< [11..11] GPIO43 interrupt.                                                */
      __IOM uint32_t GPIO44     : 1;            /*!< [12..12] GPIO44 interrupt.                                                */
      __IOM uint32_t GPIO45     : 1;            /*!< [13..13] GPIO45 interrupt.                                                */
      __IOM uint32_t GPIO46     : 1;            /*!< [14..14] GPIO46 interrupt.                                                */
      __IOM uint32_t GPIO47     : 1;            /*!< [15..15] GPIO47 interrupt.                                                */
      __IOM uint32_t GPIO48     : 1;            /*!< [16..16] GPIO48 interrupt.                                                */
      __IOM uint32_t GPIO49     : 1;            /*!< [17..17] GPIO49 interrupt.                                                */
      __IOM uint32_t GPIO50     : 1;            /*!< [18..18] GPIO50 interrupt.                                                */
      __IOM uint32_t GPIO51     : 1;            /*!< [19..19] GPIO51 interrupt.                                                */
      __IOM uint32_t GPIO52     : 1;            /*!< [20..20] GPIO52 interrupt.                                                */
      __IOM uint32_t GPIO53     : 1;            /*!< [21..21] GPIO53 interrupt.                                                */
      __IOM uint32_t GPIO54     : 1;            /*!< [22..22] GPIO54 interrupt.                                                */
      __IOM uint32_t GPIO55     : 1;            /*!< [23..23] GPIO55 interrupt.                                                */
      __IOM uint32_t GPIO56     : 1;            /*!< [24..24] GPIO56 interrupt.                                                */
      __IOM uint32_t GPIO57     : 1;            /*!< [25..25] GPIO57 interrupt.                                                */
      __IOM uint32_t GPIO58     : 1;            /*!< [26..26] GPIO58 interrupt.                                                */
      __IOM uint32_t GPIO59     : 1;            /*!< [27..27] GPIO59 interrupt.                                                */
      __IOM uint32_t GPIO60     : 1;            /*!< [28..28] GPIO60 interrupt.                                                */
      __IOM uint32_t GPIO61     : 1;            /*!< [29..29] GPIO61 interrupt.                                                */
      __IOM uint32_t GPIO62     : 1;            /*!< [30..30] GPIO62 interrupt.                                                */
      __IOM uint32_t GPIO63     : 1;            /*!< [31..31] GPIO63 interrupt.                                                */
    } INT1STAT_b;
  } ;

  union {
    __IOM uint32_t INT1CLR;                     /*!< (@ 0x00000228) GPIO Interrupt Registers 63-32: Clear                      */

