sparkfun/Arduino_Apollo3/cores/arduino/am_sdk_ap3/CMSIS/AmbiqMicro/Include/apollo3c.h
    struct {
      __IOM uint32_t FNE        : 1;            /*!< [0..0] RX FIFO not empty.                                                 */
      __IOM uint32_t TBERBF     : 1;            /*!< [1..1] FIFO empty (transmit) or full (receive).                           */
      __IOM uint32_t FER        : 1;            /*!< [2..2] Framing error.                                                     */
      __IOM uint32_t OVR        : 1;            /*!< [3..3] RX FIFO overflow.                                                  */
      __IOM uint32_t PE         : 1;            /*!< [4..4] Parity Error.                                                      */
      __IOM uint32_t FT2REND    : 1;            /*!< [5..5] TX to RX finished.                                                 */
      __IOM uint32_t FHF        : 1;            /*!< [6..6] FIFO Half Full.                                                    */
    } SR_b;
  } ;

  union {
    __IOM uint32_t IER;                         /*!< (@ 0x00000004) ISO7816 interrupt enable                                   */

    struct {
      __IOM uint32_t FNEEN      : 1;            /*!< [0..0] RX FIFO not empty interrupt enable.                                */
      __IOM uint32_t TBERBFEN   : 1;            /*!< [1..1] FIFO empty (transmit) or full (receive) interrupt enable.          */
      __IOM uint32_t FEREN      : 1;            /*!< [2..2] Framing error interrupt enable.                                    */
      __IOM uint32_t OVREN      : 1;            /*!< [3..3] RX FIFOI overflow interrupt enable.                                */
      __IOM uint32_t PEEN       : 1;            /*!< [4..4] Parity Error interrupt enable.                                     */
      __IOM uint32_t FT2RENDEN  : 1;            /*!< [5..5] TX to RX finished interrupt enable.                                */
      __IOM uint32_t FHFEN      : 1;            /*!< [6..6] FIFO Half Full interrupt enable.                                   */
    } IER_b;
  } ;

  union {
    __IOM uint32_t TCR;                         /*!< (@ 0x00000008) ISO7816 transmit control                                   */

    struct {
      __IOM uint32_t CONV       : 1;            /*!< [0..0] Conversion inversion control.                                      */
      __IOM uint32_t SS         : 1;            /*!< [1..1] Use first byte to configure conversion.                            */
      __IOM uint32_t LCT        : 1;            /*!< [2..2] Fast TX to RX.                                                     */
      __IOM uint32_t TR         : 1;            /*!< [3..3] Transmit/receive mode.                                             */
      __IOM uint32_t PROT       : 1;            /*!< [4..4] PROT control.                                                      */
      __IOM uint32_t AUTOCONV   : 1;            /*!< [5..5] Automatic conversion.                                              */
      __IOM uint32_t FIP        : 1;            /*!< [6..6] Parity select.                                                     */
      __IOM uint32_t DMAMD      : 1;            /*!< [7..7] DMA direction.                                                     */
    } TCR_b;
  } ;

  union {
    __IOM uint32_t UCR;                         /*!< (@ 0x0000000C) ISO7816 user control                                       */

    struct {
      __IOM uint32_t CST        : 1;            /*!< [0..0] Clock control.                                                     */
      __IOM uint32_t RIU        : 1;            /*!< [1..1] ISO7816 reset. This bit is write-only.                             */
      __IOM uint32_t RSTIN      : 1;            /*!< [2..2] Reset polarity.                                                    */
      __IOM uint32_t RETXEN     : 1;            /*!< [3..3] Enable TX/RX time configuration.                                   */
    } UCR_b;
  } ;

  union {
    __IOM uint32_t DR;                          /*!< (@ 0x00000010) ISO7816 data                                               */

    struct {
      __IOM uint32_t DR         : 8;            /*!< [7..0] Data register.                                                     */
    } DR_b;
  } ;

  union {
    __IOM uint32_t BPRL;                        /*!< (@ 0x00000014) ISO7816 baud rate low                                      */

    struct {
      __IOM uint32_t BPRL       : 8;            /*!< [7..0] Baud rate low                                                      */
    } BPRL_b;
  } ;

  union {
    __IOM uint32_t BPRH;                        /*!< (@ 0x00000018) ISO7816 baud rate high                                     */

    struct {
      __IOM uint32_t BPRH       : 4;            /*!< [3..0] Baud rate high                                                     */
    } BPRH_b;
  } ;

  union {
    __IOM uint32_t UCR1;                        /*!< (@ 0x0000001C) ISO7816 user control 1                                     */

    struct {
      __IOM uint32_t PR         : 1;            /*!< [0..0] Query Card Detect.                                                 */
      __IM  uint32_t            : 1;
      __IOM uint32_t STSP       : 1;            /*!< [2..2] ETU counter control. This bit is write-only.                       */
      __IOM uint32_t T1PAREN    : 1;            /*!< [3..3] Parity check control.                                              */
      __IOM uint32_t CLKIOV     : 1;            /*!< [4..4] Output clock level.                                                */
      __IOM uint32_t ENLASTB    : 1;            /*!< [5..5] Enable last byte function.                                         */
    } UCR1_b;
  } ;

  union {
    __IOM uint32_t SR1;                         /*!< (@ 0x00000020) ISO7816 interrupt status 1                                 */

    struct {
      __IOM uint32_t ECNTOVER   : 1;            /*!< [0..0] ETU counter overflow.                                              */
      __IOM uint32_t PRL        : 1;            /*!< [1..1] Card insert/remove.                                                */
      __IOM uint32_t SYNCEND    : 1;            /*!< [2..2] Write complete synchronization.                                    */
      __IOM uint32_t IDLE       : 1;            /*!< [3..3] ISO7816 idle.                                                      */
    } SR1_b;
  } ;

  union {
    __IOM uint32_t IER1;                        /*!< (@ 0x00000024) ISO7816 interrupt enable 1                                 */

