sparkfun/Arduino_Apollo3/cores/arduino/am_sdk_ap3/CMSIS/AmbiqMicro/Include/apollo3c.h
/* =========================================================================================================================== */
/* ================                                         CACHECTRL                                         ================ */
/* =========================================================================================================================== */

/* =======================================================  CACHECFG  ======================================================== */
#define CACHECTRL_CACHECFG_ENABLE_MONITOR_Pos (24UL)                /*!< CACHECTRL CACHECFG: ENABLE_MONITOR (Bit 24)           */
#define CACHECTRL_CACHECFG_ENABLE_MONITOR_Msk (0x1000000UL)         /*!< CACHECTRL CACHECFG: ENABLE_MONITOR (Bitfield-Mask: 0x01) */
#define CACHECTRL_CACHECFG_DATA_CLKGATE_Pos (20UL)                  /*!< CACHECTRL CACHECFG: DATA_CLKGATE (Bit 20)             */
#define CACHECTRL_CACHECFG_DATA_CLKGATE_Msk (0x100000UL)            /*!< CACHECTRL CACHECFG: DATA_CLKGATE (Bitfield-Mask: 0x01) */
#define CACHECTRL_CACHECFG_CACHE_LS_Pos   (11UL)                    /*!< CACHECTRL CACHECFG: CACHE_LS (Bit 11)                 */
#define CACHECTRL_CACHECFG_CACHE_LS_Msk   (0x800UL)                 /*!< CACHECTRL CACHECFG: CACHE_LS (Bitfield-Mask: 0x01)    */
#define CACHECTRL_CACHECFG_CACHE_CLKGATE_Pos (10UL)                 /*!< CACHECTRL CACHECFG: CACHE_CLKGATE (Bit 10)            */
#define CACHECTRL_CACHECFG_CACHE_CLKGATE_Msk (0x400UL)              /*!< CACHECTRL CACHECFG: CACHE_CLKGATE (Bitfield-Mask: 0x01) */
#define CACHECTRL_CACHECFG_DCACHE_ENABLE_Pos (9UL)                  /*!< CACHECTRL CACHECFG: DCACHE_ENABLE (Bit 9)             */
#define CACHECTRL_CACHECFG_DCACHE_ENABLE_Msk (0x200UL)              /*!< CACHECTRL CACHECFG: DCACHE_ENABLE (Bitfield-Mask: 0x01) */
#define CACHECTRL_CACHECFG_ICACHE_ENABLE_Pos (8UL)                  /*!< CACHECTRL CACHECFG: ICACHE_ENABLE (Bit 8)             */
#define CACHECTRL_CACHECFG_ICACHE_ENABLE_Msk (0x100UL)              /*!< CACHECTRL CACHECFG: ICACHE_ENABLE (Bitfield-Mask: 0x01) */
#define CACHECTRL_CACHECFG_CONFIG_Pos     (4UL)                     /*!< CACHECTRL CACHECFG: CONFIG (Bit 4)                    */
#define CACHECTRL_CACHECFG_CONFIG_Msk     (0xf0UL)                  /*!< CACHECTRL CACHECFG: CONFIG (Bitfield-Mask: 0x0f)      */
#define CACHECTRL_CACHECFG_ENABLE_NC1_Pos (3UL)                     /*!< CACHECTRL CACHECFG: ENABLE_NC1 (Bit 3)                */
#define CACHECTRL_CACHECFG_ENABLE_NC1_Msk (0x8UL)                   /*!< CACHECTRL CACHECFG: ENABLE_NC1 (Bitfield-Mask: 0x01)  */
#define CACHECTRL_CACHECFG_ENABLE_NC0_Pos (2UL)                     /*!< CACHECTRL CACHECFG: ENABLE_NC0 (Bit 2)                */
#define CACHECTRL_CACHECFG_ENABLE_NC0_Msk (0x4UL)                   /*!< CACHECTRL CACHECFG: ENABLE_NC0 (Bitfield-Mask: 0x01)  */
#define CACHECTRL_CACHECFG_LRU_Pos        (1UL)                     /*!< CACHECTRL CACHECFG: LRU (Bit 1)                       */
#define CACHECTRL_CACHECFG_LRU_Msk        (0x2UL)                   /*!< CACHECTRL CACHECFG: LRU (Bitfield-Mask: 0x01)         */
#define CACHECTRL_CACHECFG_ENABLE_Pos     (0UL)                     /*!< CACHECTRL CACHECFG: ENABLE (Bit 0)                    */
#define CACHECTRL_CACHECFG_ENABLE_Msk     (0x1UL)                   /*!< CACHECTRL CACHECFG: ENABLE (Bitfield-Mask: 0x01)      */
/* =========================================================  CTRL  ========================================================== */
#define CACHECTRL_CTRL_FLASH3_SLM_ENABLE_Pos (18UL)                 /*!< CACHECTRL CTRL: FLASH3_SLM_ENABLE (Bit 18)            */
#define CACHECTRL_CTRL_FLASH3_SLM_ENABLE_Msk (0x40000UL)            /*!< CACHECTRL CTRL: FLASH3_SLM_ENABLE (Bitfield-Mask: 0x01) */
#define CACHECTRL_CTRL_FLASH3_SLM_DISABLE_Pos (17UL)                /*!< CACHECTRL CTRL: FLASH3_SLM_DISABLE (Bit 17)           */
#define CACHECTRL_CTRL_FLASH3_SLM_DISABLE_Msk (0x20000UL)           /*!< CACHECTRL CTRL: FLASH3_SLM_DISABLE (Bitfield-Mask: 0x01) */
#define CACHECTRL_CTRL_FLASH3_SLM_STATUS_Pos (16UL)                 /*!< CACHECTRL CTRL: FLASH3_SLM_STATUS (Bit 16)            */
#define CACHECTRL_CTRL_FLASH3_SLM_STATUS_Msk (0x10000UL)            /*!< CACHECTRL CTRL: FLASH3_SLM_STATUS (Bitfield-Mask: 0x01) */
#define CACHECTRL_CTRL_FLASH2_SLM_ENABLE_Pos (14UL)                 /*!< CACHECTRL CTRL: FLASH2_SLM_ENABLE (Bit 14)            */
#define CACHECTRL_CTRL_FLASH2_SLM_ENABLE_Msk (0x4000UL)             /*!< CACHECTRL CTRL: FLASH2_SLM_ENABLE (Bitfield-Mask: 0x01) */
#define CACHECTRL_CTRL_FLASH2_SLM_DISABLE_Pos (13UL)                /*!< CACHECTRL CTRL: FLASH2_SLM_DISABLE (Bit 13)           */
#define CACHECTRL_CTRL_FLASH2_SLM_DISABLE_Msk (0x2000UL)            /*!< CACHECTRL CTRL: FLASH2_SLM_DISABLE (Bitfield-Mask: 0x01) */
#define CACHECTRL_CTRL_FLASH2_SLM_STATUS_Pos (12UL)                 /*!< CACHECTRL CTRL: FLASH2_SLM_STATUS (Bit 12)            */
#define CACHECTRL_CTRL_FLASH2_SLM_STATUS_Msk (0x1000UL)             /*!< CACHECTRL CTRL: FLASH2_SLM_STATUS (Bitfield-Mask: 0x01) */
#define CACHECTRL_CTRL_FLASH1_SLM_ENABLE_Pos (10UL)                 /*!< CACHECTRL CTRL: FLASH1_SLM_ENABLE (Bit 10)            */
#define CACHECTRL_CTRL_FLASH1_SLM_ENABLE_Msk (0x400UL)              /*!< CACHECTRL CTRL: FLASH1_SLM_ENABLE (Bitfield-Mask: 0x01) */
#define CACHECTRL_CTRL_FLASH1_SLM_DISABLE_Pos (9UL)                 /*!< CACHECTRL CTRL: FLASH1_SLM_DISABLE (Bit 9)            */
#define CACHECTRL_CTRL_FLASH1_SLM_DISABLE_Msk (0x200UL)             /*!< CACHECTRL CTRL: FLASH1_SLM_DISABLE (Bitfield-Mask: 0x01) */
#define CACHECTRL_CTRL_FLASH1_SLM_STATUS_Pos (8UL)                  /*!< CACHECTRL CTRL: FLASH1_SLM_STATUS (Bit 8)             */
#define CACHECTRL_CTRL_FLASH1_SLM_STATUS_Msk (0x100UL)              /*!< CACHECTRL CTRL: FLASH1_SLM_STATUS (Bitfield-Mask: 0x01) */
#define CACHECTRL_CTRL_FLASH0_SLM_ENABLE_Pos (6UL)                  /*!< CACHECTRL CTRL: FLASH0_SLM_ENABLE (Bit 6)             */
#define CACHECTRL_CTRL_FLASH0_SLM_ENABLE_Msk (0x40UL)               /*!< CACHECTRL CTRL: FLASH0_SLM_ENABLE (Bitfield-Mask: 0x01) */
#define CACHECTRL_CTRL_FLASH0_SLM_DISABLE_Pos (5UL)                 /*!< CACHECTRL CTRL: FLASH0_SLM_DISABLE (Bit 5)            */
#define CACHECTRL_CTRL_FLASH0_SLM_DISABLE_Msk (0x20UL)              /*!< CACHECTRL CTRL: FLASH0_SLM_DISABLE (Bitfield-Mask: 0x01) */
#define CACHECTRL_CTRL_FLASH0_SLM_STATUS_Pos (4UL)                  /*!< CACHECTRL CTRL: FLASH0_SLM_STATUS (Bit 4)             */
#define CACHECTRL_CTRL_FLASH0_SLM_STATUS_Msk (0x10UL)               /*!< CACHECTRL CTRL: FLASH0_SLM_STATUS (Bitfield-Mask: 0x01) */
#define CACHECTRL_CTRL_CACHE_READY_Pos    (2UL)                     /*!< CACHECTRL CTRL: CACHE_READY (Bit 2)                   */
#define CACHECTRL_CTRL_CACHE_READY_Msk    (0x4UL)                   /*!< CACHECTRL CTRL: CACHE_READY (Bitfield-Mask: 0x01)     */
#define CACHECTRL_CTRL_RESET_STAT_Pos     (1UL)                     /*!< CACHECTRL CTRL: RESET_STAT (Bit 1)                    */
#define CACHECTRL_CTRL_RESET_STAT_Msk     (0x2UL)                   /*!< CACHECTRL CTRL: RESET_STAT (Bitfield-Mask: 0x01)      */
#define CACHECTRL_CTRL_INVALIDATE_Pos     (0UL)                     /*!< CACHECTRL CTRL: INVALIDATE (Bit 0)                    */
#define CACHECTRL_CTRL_INVALIDATE_Msk     (0x1UL)                   /*!< CACHECTRL CTRL: INVALIDATE (Bitfield-Mask: 0x01)      */
/* =======================================================  NCR0START  ======================================================= */
#define CACHECTRL_NCR0START_ADDR_Pos      (4UL)                     /*!< CACHECTRL NCR0START: ADDR (Bit 4)                     */
#define CACHECTRL_NCR0START_ADDR_Msk      (0x7fffff0UL)             /*!< CACHECTRL NCR0START: ADDR (Bitfield-Mask: 0x7fffff)   */
/* ========================================================  NCR0END  ======================================================== */
#define CACHECTRL_NCR0END_ADDR_Pos        (4UL)                     /*!< CACHECTRL NCR0END: ADDR (Bit 4)                       */
#define CACHECTRL_NCR0END_ADDR_Msk        (0x7fffff0UL)             /*!< CACHECTRL NCR0END: ADDR (Bitfield-Mask: 0x7fffff)     */
/* =======================================================  NCR1START  ======================================================= */
#define CACHECTRL_NCR1START_ADDR_Pos      (4UL)                     /*!< CACHECTRL NCR1START: ADDR (Bit 4)                     */
#define CACHECTRL_NCR1START_ADDR_Msk      (0x7fffff0UL)             /*!< CACHECTRL NCR1START: ADDR (Bitfield-Mask: 0x7fffff)   */
/* ========================================================  NCR1END  ======================================================== */
#define CACHECTRL_NCR1END_ADDR_Pos        (4UL)                     /*!< CACHECTRL NCR1END: ADDR (Bit 4)                       */
#define CACHECTRL_NCR1END_ADDR_Msk        (0x7fffff0UL)             /*!< CACHECTRL NCR1END: ADDR (Bitfield-Mask: 0x7fffff)     */
/* =========================================================  DMON0  ========================================================= */
#define CACHECTRL_DMON0_DACCESS_COUNT_Pos (0UL)                     /*!< CACHECTRL DMON0: DACCESS_COUNT (Bit 0)                */
#define CACHECTRL_DMON0_DACCESS_COUNT_Msk (0xffffffffUL)            /*!< CACHECTRL DMON0: DACCESS_COUNT (Bitfield-Mask: 0xffffffff) */
/* =========================================================  DMON1  ========================================================= */
#define CACHECTRL_DMON1_DLOOKUP_COUNT_Pos (0UL)                     /*!< CACHECTRL DMON1: DLOOKUP_COUNT (Bit 0)                */
#define CACHECTRL_DMON1_DLOOKUP_COUNT_Msk (0xffffffffUL)            /*!< CACHECTRL DMON1: DLOOKUP_COUNT (Bitfield-Mask: 0xffffffff) */
/* =========================================================  DMON2  ========================================================= */
#define CACHECTRL_DMON2_DHIT_COUNT_Pos    (0UL)                     /*!< CACHECTRL DMON2: DHIT_COUNT (Bit 0)                   */
#define CACHECTRL_DMON2_DHIT_COUNT_Msk    (0xffffffffUL)            /*!< CACHECTRL DMON2: DHIT_COUNT (Bitfield-Mask: 0xffffffff) */
/* =========================================================  DMON3  ========================================================= */
#define CACHECTRL_DMON3_DLINE_COUNT_Pos   (0UL)                     /*!< CACHECTRL DMON3: DLINE_COUNT (Bit 0)                  */
#define CACHECTRL_DMON3_DLINE_COUNT_Msk   (0xffffffffUL)            /*!< CACHECTRL DMON3: DLINE_COUNT (Bitfield-Mask: 0xffffffff) */
/* =========================================================  IMON0  ========================================================= */
#define CACHECTRL_IMON0_IACCESS_COUNT_Pos (0UL)                     /*!< CACHECTRL IMON0: IACCESS_COUNT (Bit 0)                */
#define CACHECTRL_IMON0_IACCESS_COUNT_Msk (0xffffffffUL)            /*!< CACHECTRL IMON0: IACCESS_COUNT (Bitfield-Mask: 0xffffffff) */
/* =========================================================  IMON1  ========================================================= */
#define CACHECTRL_IMON1_ILOOKUP_COUNT_Pos (0UL)                     /*!< CACHECTRL IMON1: ILOOKUP_COUNT (Bit 0)                */
#define CACHECTRL_IMON1_ILOOKUP_COUNT_Msk (0xffffffffUL)            /*!< CACHECTRL IMON1: ILOOKUP_COUNT (Bitfield-Mask: 0xffffffff) */
/* =========================================================  IMON2  ========================================================= */
#define CACHECTRL_IMON2_IHIT_COUNT_Pos    (0UL)                     /*!< CACHECTRL IMON2: IHIT_COUNT (Bit 0)                   */
#define CACHECTRL_IMON2_IHIT_COUNT_Msk    (0xffffffffUL)            /*!< CACHECTRL IMON2: IHIT_COUNT (Bitfield-Mask: 0xffffffff) */
/* =========================================================  IMON3  ========================================================= */
#define CACHECTRL_IMON3_ILINE_COUNT_Pos   (0UL)                     /*!< CACHECTRL IMON3: ILINE_COUNT (Bit 0)                  */
#define CACHECTRL_IMON3_ILINE_COUNT_Msk   (0xffffffffUL)            /*!< CACHECTRL IMON3: ILINE_COUNT (Bitfield-Mask: 0xffffffff) */
/* =======================================================  FLASH0CFG  ======================================================= */
#define CACHECTRL_FLASH0CFG_LPMMODE0_Pos  (12UL)                    /*!< CACHECTRL FLASH0CFG: LPMMODE0 (Bit 12)                */
#define CACHECTRL_FLASH0CFG_LPMMODE0_Msk  (0x3000UL)                /*!< CACHECTRL FLASH0CFG: LPMMODE0 (Bitfield-Mask: 0x03)   */
#define CACHECTRL_FLASH0CFG_LPMRDWAIT0_Pos (8UL)                    /*!< CACHECTRL FLASH0CFG: LPMRDWAIT0 (Bit 8)               */
#define CACHECTRL_FLASH0CFG_LPMRDWAIT0_Msk (0xf00UL)                /*!< CACHECTRL FLASH0CFG: LPMRDWAIT0 (Bitfield-Mask: 0x0f) */
#define CACHECTRL_FLASH0CFG_SEDELAY0_Pos  (4UL)                     /*!< CACHECTRL FLASH0CFG: SEDELAY0 (Bit 4)                 */
#define CACHECTRL_FLASH0CFG_SEDELAY0_Msk  (0x70UL)                  /*!< CACHECTRL FLASH0CFG: SEDELAY0 (Bitfield-Mask: 0x07)   */
#define CACHECTRL_FLASH0CFG_RDWAIT0_Pos   (0UL)                     /*!< CACHECTRL FLASH0CFG: RDWAIT0 (Bit 0)                  */
#define CACHECTRL_FLASH0CFG_RDWAIT0_Msk   (0xfUL)                   /*!< CACHECTRL FLASH0CFG: RDWAIT0 (Bitfield-Mask: 0x0f)    */
/* =======================================================  FLASH1CFG  ======================================================= */
#define CACHECTRL_FLASH1CFG_LPMMODE1_Pos  (12UL)                    /*!< CACHECTRL FLASH1CFG: LPMMODE1 (Bit 12)                */
#define CACHECTRL_FLASH1CFG_LPMMODE1_Msk  (0x3000UL)                /*!< CACHECTRL FLASH1CFG: LPMMODE1 (Bitfield-Mask: 0x03)   */
#define CACHECTRL_FLASH1CFG_LPMRDWAIT1_Pos (8UL)                    /*!< CACHECTRL FLASH1CFG: LPMRDWAIT1 (Bit 8)               */
#define CACHECTRL_FLASH1CFG_LPMRDWAIT1_Msk (0xf00UL)                /*!< CACHECTRL FLASH1CFG: LPMRDWAIT1 (Bitfield-Mask: 0x0f) */
#define CACHECTRL_FLASH1CFG_SEDELAY1_Pos  (4UL)                     /*!< CACHECTRL FLASH1CFG: SEDELAY1 (Bit 4)                 */
#define CACHECTRL_FLASH1CFG_SEDELAY1_Msk  (0x70UL)                  /*!< CACHECTRL FLASH1CFG: SEDELAY1 (Bitfield-Mask: 0x07)   */
#define CACHECTRL_FLASH1CFG_RDWAIT1_Pos   (0UL)                     /*!< CACHECTRL FLASH1CFG: RDWAIT1 (Bit 0)                  */
#define CACHECTRL_FLASH1CFG_RDWAIT1_Msk   (0xfUL)                   /*!< CACHECTRL FLASH1CFG: RDWAIT1 (Bitfield-Mask: 0x0f)    */
/* =======================================================  FLASH2CFG  ======================================================= */
#define CACHECTRL_FLASH2CFG_LPMMODE2_Pos  (12UL)                    /*!< CACHECTRL FLASH2CFG: LPMMODE2 (Bit 12)                */
#define CACHECTRL_FLASH2CFG_LPMMODE2_Msk  (0x3000UL)                /*!< CACHECTRL FLASH2CFG: LPMMODE2 (Bitfield-Mask: 0x03)   */
#define CACHECTRL_FLASH2CFG_LPMRDWAIT2_Pos (8UL)                    /*!< CACHECTRL FLASH2CFG: LPMRDWAIT2 (Bit 8)               */
#define CACHECTRL_FLASH2CFG_LPMRDWAIT2_Msk (0xf00UL)                /*!< CACHECTRL FLASH2CFG: LPMRDWAIT2 (Bitfield-Mask: 0x0f) */
#define CACHECTRL_FLASH2CFG_SEDELAY2_Pos  (4UL)                     /*!< CACHECTRL FLASH2CFG: SEDELAY2 (Bit 4)                 */
#define CACHECTRL_FLASH2CFG_SEDELAY2_Msk  (0x70UL)                  /*!< CACHECTRL FLASH2CFG: SEDELAY2 (Bitfield-Mask: 0x07)   */
#define CACHECTRL_FLASH2CFG_RDWAIT2_Pos   (0UL)                     /*!< CACHECTRL FLASH2CFG: RDWAIT2 (Bit 0)                  */
#define CACHECTRL_FLASH2CFG_RDWAIT2_Msk   (0xfUL)                   /*!< CACHECTRL FLASH2CFG: RDWAIT2 (Bitfield-Mask: 0x0f)    */
/* =======================================================  FLASH3CFG  ======================================================= */
#define CACHECTRL_FLASH3CFG_LPMMODE3_Pos  (12UL)                    /*!< CACHECTRL FLASH3CFG: LPMMODE3 (Bit 12)                */
#define CACHECTRL_FLASH3CFG_LPMMODE3_Msk  (0x3000UL)                /*!< CACHECTRL FLASH3CFG: LPMMODE3 (Bitfield-Mask: 0x03)   */
#define CACHECTRL_FLASH3CFG_LPMRDWAIT3_Pos (8UL)                    /*!< CACHECTRL FLASH3CFG: LPMRDWAIT3 (Bit 8)               */
#define CACHECTRL_FLASH3CFG_LPMRDWAIT3_Msk (0xf00UL)                /*!< CACHECTRL FLASH3CFG: LPMRDWAIT3 (Bitfield-Mask: 0x0f) */
#define CACHECTRL_FLASH3CFG_SEDELAY3_Pos  (4UL)                     /*!< CACHECTRL FLASH3CFG: SEDELAY3 (Bit 4)                 */
#define CACHECTRL_FLASH3CFG_SEDELAY3_Msk  (0x70UL)                  /*!< CACHECTRL FLASH3CFG: SEDELAY3 (Bitfield-Mask: 0x07)   */
#define CACHECTRL_FLASH3CFG_RDWAIT3_Pos   (0UL)                     /*!< CACHECTRL FLASH3CFG: RDWAIT3 (Bit 0)                  */
#define CACHECTRL_FLASH3CFG_RDWAIT3_Msk   (0xfUL)                   /*!< CACHECTRL FLASH3CFG: RDWAIT3 (Bitfield-Mask: 0x0f)    */


/* =========================================================================================================================== */
/* ================                                          CLKGEN                                           ================ */
/* =========================================================================================================================== */

