sparkfun/Arduino_Apollo3/cores/arduino/am_sdk_ap3/CMSIS/AmbiqMicro/Include/apollo3c.h
/* =========================================================  CALXT  ========================================================= */
#define CLKGEN_CALXT_CALXT_Pos            (0UL)                     /*!< CLKGEN CALXT: CALXT (Bit 0)                           */
#define CLKGEN_CALXT_CALXT_Msk            (0x7ffUL)                 /*!< CLKGEN CALXT: CALXT (Bitfield-Mask: 0x7ff)            */
/* =========================================================  CALRC  ========================================================= */
#define CLKGEN_CALRC_CALRC_Pos            (0UL)                     /*!< CLKGEN CALRC: CALRC (Bit 0)                           */
#define CLKGEN_CALRC_CALRC_Msk            (0x3ffffUL)               /*!< CLKGEN CALRC: CALRC (Bitfield-Mask: 0x3ffff)          */
/* ========================================================  ACALCTR  ======================================================== */
#define CLKGEN_ACALCTR_ACALCTR_Pos        (0UL)                     /*!< CLKGEN ACALCTR: ACALCTR (Bit 0)                       */
#define CLKGEN_ACALCTR_ACALCTR_Msk        (0xffffffUL)              /*!< CLKGEN ACALCTR: ACALCTR (Bitfield-Mask: 0xffffff)     */
/* =========================================================  OCTRL  ========================================================= */
#define CLKGEN_OCTRL_ACAL_Pos             (8UL)                     /*!< CLKGEN OCTRL: ACAL (Bit 8)                            */
#define CLKGEN_OCTRL_ACAL_Msk             (0x700UL)                 /*!< CLKGEN OCTRL: ACAL (Bitfield-Mask: 0x07)              */
#define CLKGEN_OCTRL_OSEL_Pos             (7UL)                     /*!< CLKGEN OCTRL: OSEL (Bit 7)                            */
#define CLKGEN_OCTRL_OSEL_Msk             (0x80UL)                  /*!< CLKGEN OCTRL: OSEL (Bitfield-Mask: 0x01)              */
#define CLKGEN_OCTRL_FOS_Pos              (6UL)                     /*!< CLKGEN OCTRL: FOS (Bit 6)                             */
#define CLKGEN_OCTRL_FOS_Msk              (0x40UL)                  /*!< CLKGEN OCTRL: FOS (Bitfield-Mask: 0x01)               */
#define CLKGEN_OCTRL_STOPRC_Pos           (1UL)                     /*!< CLKGEN OCTRL: STOPRC (Bit 1)                          */
#define CLKGEN_OCTRL_STOPRC_Msk           (0x2UL)                   /*!< CLKGEN OCTRL: STOPRC (Bitfield-Mask: 0x01)            */
#define CLKGEN_OCTRL_STOPXT_Pos           (0UL)                     /*!< CLKGEN OCTRL: STOPXT (Bit 0)                          */
#define CLKGEN_OCTRL_STOPXT_Msk           (0x1UL)                   /*!< CLKGEN OCTRL: STOPXT (Bitfield-Mask: 0x01)            */
/* ========================================================  CLKOUT  ========================================================= */
#define CLKGEN_CLKOUT_CKEN_Pos            (7UL)                     /*!< CLKGEN CLKOUT: CKEN (Bit 7)                           */
#define CLKGEN_CLKOUT_CKEN_Msk            (0x80UL)                  /*!< CLKGEN CLKOUT: CKEN (Bitfield-Mask: 0x01)             */
#define CLKGEN_CLKOUT_CKSEL_Pos           (0UL)                     /*!< CLKGEN CLKOUT: CKSEL (Bit 0)                          */
#define CLKGEN_CLKOUT_CKSEL_Msk           (0x3fUL)                  /*!< CLKGEN CLKOUT: CKSEL (Bitfield-Mask: 0x3f)            */
/* ========================================================  CLKKEY  ========================================================= */
#define CLKGEN_CLKKEY_CLKKEY_Pos          (0UL)                     /*!< CLKGEN CLKKEY: CLKKEY (Bit 0)                         */
#define CLKGEN_CLKKEY_CLKKEY_Msk          (0xffffffffUL)            /*!< CLKGEN CLKKEY: CLKKEY (Bitfield-Mask: 0xffffffff)     */
/* =========================================================  CCTRL  ========================================================= */
#define CLKGEN_CCTRL_CORESEL_Pos          (0UL)                     /*!< CLKGEN CCTRL: CORESEL (Bit 0)                         */
#define CLKGEN_CCTRL_CORESEL_Msk          (0x1UL)                   /*!< CLKGEN CCTRL: CORESEL (Bitfield-Mask: 0x01)           */
/* ========================================================  STATUS  ========================================================= */
#define CLKGEN_STATUS_OSCF_Pos            (1UL)                     /*!< CLKGEN STATUS: OSCF (Bit 1)                           */
#define CLKGEN_STATUS_OSCF_Msk            (0x2UL)                   /*!< CLKGEN STATUS: OSCF (Bitfield-Mask: 0x01)             */
#define CLKGEN_STATUS_OMODE_Pos           (0UL)                     /*!< CLKGEN STATUS: OMODE (Bit 0)                          */
#define CLKGEN_STATUS_OMODE_Msk           (0x1UL)                   /*!< CLKGEN STATUS: OMODE (Bitfield-Mask: 0x01)            */
/* =========================================================  HFADJ  ========================================================= */
#define CLKGEN_HFADJ_HFADJGAIN_Pos        (21UL)                    /*!< CLKGEN HFADJ: HFADJGAIN (Bit 21)                      */
#define CLKGEN_HFADJ_HFADJGAIN_Msk        (0xe00000UL)              /*!< CLKGEN HFADJ: HFADJGAIN (Bitfield-Mask: 0x07)         */
#define CLKGEN_HFADJ_HFWARMUP_Pos         (20UL)                    /*!< CLKGEN HFADJ: HFWARMUP (Bit 20)                       */
#define CLKGEN_HFADJ_HFWARMUP_Msk         (0x100000UL)              /*!< CLKGEN HFADJ: HFWARMUP (Bitfield-Mask: 0x01)          */
#define CLKGEN_HFADJ_HFXTADJ_Pos          (8UL)                     /*!< CLKGEN HFADJ: HFXTADJ (Bit 8)                         */
#define CLKGEN_HFADJ_HFXTADJ_Msk          (0xfff00UL)               /*!< CLKGEN HFADJ: HFXTADJ (Bitfield-Mask: 0xfff)          */
#define CLKGEN_HFADJ_HFADJCK_Pos          (1UL)                     /*!< CLKGEN HFADJ: HFADJCK (Bit 1)                         */
#define CLKGEN_HFADJ_HFADJCK_Msk          (0xeUL)                   /*!< CLKGEN HFADJ: HFADJCK (Bitfield-Mask: 0x07)           */
#define CLKGEN_HFADJ_HFADJEN_Pos          (0UL)                     /*!< CLKGEN HFADJ: HFADJEN (Bit 0)                         */
#define CLKGEN_HFADJ_HFADJEN_Msk          (0x1UL)                   /*!< CLKGEN HFADJ: HFADJEN (Bitfield-Mask: 0x01)           */
/* ======================================================  CLOCKENSTAT  ====================================================== */
#define CLKGEN_CLOCKENSTAT_CLOCKENSTAT_Pos (0UL)                    /*!< CLKGEN CLOCKENSTAT: CLOCKENSTAT (Bit 0)               */
#define CLKGEN_CLOCKENSTAT_CLOCKENSTAT_Msk (0xffffffffUL)           /*!< CLKGEN CLOCKENSTAT: CLOCKENSTAT (Bitfield-Mask: 0xffffffff) */
/* =====================================================  CLOCKEN2STAT  ====================================================== */
#define CLKGEN_CLOCKEN2STAT_CLOCKEN2STAT_Pos (0UL)                  /*!< CLKGEN CLOCKEN2STAT: CLOCKEN2STAT (Bit 0)             */
#define CLKGEN_CLOCKEN2STAT_CLOCKEN2STAT_Msk (0xffffffffUL)         /*!< CLKGEN CLOCKEN2STAT: CLOCKEN2STAT (Bitfield-Mask: 0xffffffff) */
/* =====================================================  CLOCKEN3STAT  ====================================================== */
#define CLKGEN_CLOCKEN3STAT_CLOCKEN3STAT_Pos (0UL)                  /*!< CLKGEN CLOCKEN3STAT: CLOCKEN3STAT (Bit 0)             */
#define CLKGEN_CLOCKEN3STAT_CLOCKEN3STAT_Msk (0xffffffffUL)         /*!< CLKGEN CLOCKEN3STAT: CLOCKEN3STAT (Bitfield-Mask: 0xffffffff) */
/* =======================================================  FREQCTRL  ======================================================== */
#define CLKGEN_FREQCTRL_BURSTSTATUS_Pos   (2UL)                     /*!< CLKGEN FREQCTRL: BURSTSTATUS (Bit 2)                  */
#define CLKGEN_FREQCTRL_BURSTSTATUS_Msk   (0x4UL)                   /*!< CLKGEN FREQCTRL: BURSTSTATUS (Bitfield-Mask: 0x01)    */
#define CLKGEN_FREQCTRL_BURSTACK_Pos      (1UL)                     /*!< CLKGEN FREQCTRL: BURSTACK (Bit 1)                     */
#define CLKGEN_FREQCTRL_BURSTACK_Msk      (0x2UL)                   /*!< CLKGEN FREQCTRL: BURSTACK (Bitfield-Mask: 0x01)       */
#define CLKGEN_FREQCTRL_BURSTREQ_Pos      (0UL)                     /*!< CLKGEN FREQCTRL: BURSTREQ (Bit 0)                     */
#define CLKGEN_FREQCTRL_BURSTREQ_Msk      (0x1UL)                   /*!< CLKGEN FREQCTRL: BURSTREQ (Bitfield-Mask: 0x01)       */
/* =====================================================  BLEBUCKTONADJ  ===================================================== */
#define CLKGEN_BLEBUCKTONADJ_ZEROLENDETECTEN_Pos (27UL)             /*!< CLKGEN BLEBUCKTONADJ: ZEROLENDETECTEN (Bit 27)        */
#define CLKGEN_BLEBUCKTONADJ_ZEROLENDETECTEN_Msk (0x8000000UL)      /*!< CLKGEN BLEBUCKTONADJ: ZEROLENDETECTEN (Bitfield-Mask: 0x01) */
#define CLKGEN_BLEBUCKTONADJ_ZEROLENDETECTTRIM_Pos (23UL)           /*!< CLKGEN BLEBUCKTONADJ: ZEROLENDETECTTRIM (Bit 23)      */
#define CLKGEN_BLEBUCKTONADJ_ZEROLENDETECTTRIM_Msk (0x7800000UL)    /*!< CLKGEN BLEBUCKTONADJ: ZEROLENDETECTTRIM (Bitfield-Mask: 0x0f) */
#define CLKGEN_BLEBUCKTONADJ_TONADJUSTEN_Pos (22UL)                 /*!< CLKGEN BLEBUCKTONADJ: TONADJUSTEN (Bit 22)            */
#define CLKGEN_BLEBUCKTONADJ_TONADJUSTEN_Msk (0x400000UL)           /*!< CLKGEN BLEBUCKTONADJ: TONADJUSTEN (Bitfield-Mask: 0x01) */
#define CLKGEN_BLEBUCKTONADJ_TONADJUSTPERIOD_Pos (20UL)             /*!< CLKGEN BLEBUCKTONADJ: TONADJUSTPERIOD (Bit 20)        */
#define CLKGEN_BLEBUCKTONADJ_TONADJUSTPERIOD_Msk (0x300000UL)       /*!< CLKGEN BLEBUCKTONADJ: TONADJUSTPERIOD (Bitfield-Mask: 0x03) */
#define CLKGEN_BLEBUCKTONADJ_TONHIGHTHRESHOLD_Pos (10UL)            /*!< CLKGEN BLEBUCKTONADJ: TONHIGHTHRESHOLD (Bit 10)       */
#define CLKGEN_BLEBUCKTONADJ_TONHIGHTHRESHOLD_Msk (0xffc00UL)       /*!< CLKGEN BLEBUCKTONADJ: TONHIGHTHRESHOLD (Bitfield-Mask: 0x3ff) */
#define CLKGEN_BLEBUCKTONADJ_TONLOWTHRESHOLD_Pos (0UL)              /*!< CLKGEN BLEBUCKTONADJ: TONLOWTHRESHOLD (Bit 0)         */
#define CLKGEN_BLEBUCKTONADJ_TONLOWTHRESHOLD_Msk (0x3ffUL)          /*!< CLKGEN BLEBUCKTONADJ: TONLOWTHRESHOLD (Bitfield-Mask: 0x3ff) */
/* =======================================================  INTRPTEN  ======================================================== */
#define CLKGEN_INTRPTEN_OF_Pos            (2UL)                     /*!< CLKGEN INTRPTEN: OF (Bit 2)                           */
#define CLKGEN_INTRPTEN_OF_Msk            (0x4UL)                   /*!< CLKGEN INTRPTEN: OF (Bitfield-Mask: 0x01)             */
#define CLKGEN_INTRPTEN_ACC_Pos           (1UL)                     /*!< CLKGEN INTRPTEN: ACC (Bit 1)                          */
#define CLKGEN_INTRPTEN_ACC_Msk           (0x2UL)                   /*!< CLKGEN INTRPTEN: ACC (Bitfield-Mask: 0x01)            */
#define CLKGEN_INTRPTEN_ACF_Pos           (0UL)                     /*!< CLKGEN INTRPTEN: ACF (Bit 0)                          */
#define CLKGEN_INTRPTEN_ACF_Msk           (0x1UL)                   /*!< CLKGEN INTRPTEN: ACF (Bitfield-Mask: 0x01)            */
/* ======================================================  INTRPTSTAT  ======================================================= */
#define CLKGEN_INTRPTSTAT_OF_Pos          (2UL)                     /*!< CLKGEN INTRPTSTAT: OF (Bit 2)                         */
#define CLKGEN_INTRPTSTAT_OF_Msk          (0x4UL)                   /*!< CLKGEN INTRPTSTAT: OF (Bitfield-Mask: 0x01)           */
#define CLKGEN_INTRPTSTAT_ACC_Pos         (1UL)                     /*!< CLKGEN INTRPTSTAT: ACC (Bit 1)                        */
#define CLKGEN_INTRPTSTAT_ACC_Msk         (0x2UL)                   /*!< CLKGEN INTRPTSTAT: ACC (Bitfield-Mask: 0x01)          */
#define CLKGEN_INTRPTSTAT_ACF_Pos         (0UL)                     /*!< CLKGEN INTRPTSTAT: ACF (Bit 0)                        */
#define CLKGEN_INTRPTSTAT_ACF_Msk         (0x1UL)                   /*!< CLKGEN INTRPTSTAT: ACF (Bitfield-Mask: 0x01)          */
/* =======================================================  INTRPTCLR  ======================================================= */
#define CLKGEN_INTRPTCLR_OF_Pos           (2UL)                     /*!< CLKGEN INTRPTCLR: OF (Bit 2)                          */
#define CLKGEN_INTRPTCLR_OF_Msk           (0x4UL)                   /*!< CLKGEN INTRPTCLR: OF (Bitfield-Mask: 0x01)            */
#define CLKGEN_INTRPTCLR_ACC_Pos          (1UL)                     /*!< CLKGEN INTRPTCLR: ACC (Bit 1)                         */
#define CLKGEN_INTRPTCLR_ACC_Msk          (0x2UL)                   /*!< CLKGEN INTRPTCLR: ACC (Bitfield-Mask: 0x01)           */
#define CLKGEN_INTRPTCLR_ACF_Pos          (0UL)                     /*!< CLKGEN INTRPTCLR: ACF (Bit 0)                         */
#define CLKGEN_INTRPTCLR_ACF_Msk          (0x1UL)                   /*!< CLKGEN INTRPTCLR: ACF (Bitfield-Mask: 0x01)           */
/* =======================================================  INTRPTSET  ======================================================= */
#define CLKGEN_INTRPTSET_OF_Pos           (2UL)                     /*!< CLKGEN INTRPTSET: OF (Bit 2)                          */
#define CLKGEN_INTRPTSET_OF_Msk           (0x4UL)                   /*!< CLKGEN INTRPTSET: OF (Bitfield-Mask: 0x01)            */
#define CLKGEN_INTRPTSET_ACC_Pos          (1UL)                     /*!< CLKGEN INTRPTSET: ACC (Bit 1)                         */
#define CLKGEN_INTRPTSET_ACC_Msk          (0x2UL)                   /*!< CLKGEN INTRPTSET: ACC (Bitfield-Mask: 0x01)           */
#define CLKGEN_INTRPTSET_ACF_Pos          (0UL)                     /*!< CLKGEN INTRPTSET: ACF (Bit 0)                         */
#define CLKGEN_INTRPTSET_ACF_Msk          (0x1UL)                   /*!< CLKGEN INTRPTSET: ACF (Bitfield-Mask: 0x01)           */


/* =========================================================================================================================== */
/* ================                                          CTIMER                                           ================ */
/* =========================================================================================================================== */

