sparkfun/Arduino_Apollo3/cores/arduino/am_sdk_ap3/CMSIS/AmbiqMicro/Include/apollo3c.h
/* =========================================================  TMR0  ========================================================== */
#define CTIMER_TMR0_CTTMRB0_Pos           (16UL)                    /*!< CTIMER TMR0: CTTMRB0 (Bit 16)                         */
#define CTIMER_TMR0_CTTMRB0_Msk           (0xffff0000UL)            /*!< CTIMER TMR0: CTTMRB0 (Bitfield-Mask: 0xffff)          */
#define CTIMER_TMR0_CTTMRA0_Pos           (0UL)                     /*!< CTIMER TMR0: CTTMRA0 (Bit 0)                          */
#define CTIMER_TMR0_CTTMRA0_Msk           (0xffffUL)                /*!< CTIMER TMR0: CTTMRA0 (Bitfield-Mask: 0xffff)          */
/* ========================================================  CMPRA0  ========================================================= */
#define CTIMER_CMPRA0_CMPR1A0_Pos         (16UL)                    /*!< CTIMER CMPRA0: CMPR1A0 (Bit 16)                       */
#define CTIMER_CMPRA0_CMPR1A0_Msk         (0xffff0000UL)            /*!< CTIMER CMPRA0: CMPR1A0 (Bitfield-Mask: 0xffff)        */
#define CTIMER_CMPRA0_CMPR0A0_Pos         (0UL)                     /*!< CTIMER CMPRA0: CMPR0A0 (Bit 0)                        */
#define CTIMER_CMPRA0_CMPR0A0_Msk         (0xffffUL)                /*!< CTIMER CMPRA0: CMPR0A0 (Bitfield-Mask: 0xffff)        */
/* ========================================================  CMPRB0  ========================================================= */
#define CTIMER_CMPRB0_CMPR1B0_Pos         (16UL)                    /*!< CTIMER CMPRB0: CMPR1B0 (Bit 16)                       */
#define CTIMER_CMPRB0_CMPR1B0_Msk         (0xffff0000UL)            /*!< CTIMER CMPRB0: CMPR1B0 (Bitfield-Mask: 0xffff)        */
#define CTIMER_CMPRB0_CMPR0B0_Pos         (0UL)                     /*!< CTIMER CMPRB0: CMPR0B0 (Bit 0)                        */
#define CTIMER_CMPRB0_CMPR0B0_Msk         (0xffffUL)                /*!< CTIMER CMPRB0: CMPR0B0 (Bitfield-Mask: 0xffff)        */
/* =========================================================  CTRL0  ========================================================= */
#define CTIMER_CTRL0_CTLINK0_Pos          (31UL)                    /*!< CTIMER CTRL0: CTLINK0 (Bit 31)                        */
#define CTIMER_CTRL0_CTLINK0_Msk          (0x80000000UL)            /*!< CTIMER CTRL0: CTLINK0 (Bitfield-Mask: 0x01)           */
#define CTIMER_CTRL0_TMRB0POL_Pos         (28UL)                    /*!< CTIMER CTRL0: TMRB0POL (Bit 28)                       */
#define CTIMER_CTRL0_TMRB0POL_Msk         (0x10000000UL)            /*!< CTIMER CTRL0: TMRB0POL (Bitfield-Mask: 0x01)          */
#define CTIMER_CTRL0_TMRB0CLR_Pos         (27UL)                    /*!< CTIMER CTRL0: TMRB0CLR (Bit 27)                       */
#define CTIMER_CTRL0_TMRB0CLR_Msk         (0x8000000UL)             /*!< CTIMER CTRL0: TMRB0CLR (Bitfield-Mask: 0x01)          */
#define CTIMER_CTRL0_TMRB0IE1_Pos         (26UL)                    /*!< CTIMER CTRL0: TMRB0IE1 (Bit 26)                       */
#define CTIMER_CTRL0_TMRB0IE1_Msk         (0x4000000UL)             /*!< CTIMER CTRL0: TMRB0IE1 (Bitfield-Mask: 0x01)          */
#define CTIMER_CTRL0_TMRB0IE0_Pos         (25UL)                    /*!< CTIMER CTRL0: TMRB0IE0 (Bit 25)                       */
#define CTIMER_CTRL0_TMRB0IE0_Msk         (0x2000000UL)             /*!< CTIMER CTRL0: TMRB0IE0 (Bitfield-Mask: 0x01)          */
#define CTIMER_CTRL0_TMRB0FN_Pos          (22UL)                    /*!< CTIMER CTRL0: TMRB0FN (Bit 22)                        */
#define CTIMER_CTRL0_TMRB0FN_Msk          (0x1c00000UL)             /*!< CTIMER CTRL0: TMRB0FN (Bitfield-Mask: 0x07)           */
#define CTIMER_CTRL0_TMRB0CLK_Pos         (17UL)                    /*!< CTIMER CTRL0: TMRB0CLK (Bit 17)                       */
#define CTIMER_CTRL0_TMRB0CLK_Msk         (0x3e0000UL)              /*!< CTIMER CTRL0: TMRB0CLK (Bitfield-Mask: 0x1f)          */
#define CTIMER_CTRL0_TMRB0EN_Pos          (16UL)                    /*!< CTIMER CTRL0: TMRB0EN (Bit 16)                        */
#define CTIMER_CTRL0_TMRB0EN_Msk          (0x10000UL)               /*!< CTIMER CTRL0: TMRB0EN (Bitfield-Mask: 0x01)           */
#define CTIMER_CTRL0_TMRA0POL_Pos         (12UL)                    /*!< CTIMER CTRL0: TMRA0POL (Bit 12)                       */
#define CTIMER_CTRL0_TMRA0POL_Msk         (0x1000UL)                /*!< CTIMER CTRL0: TMRA0POL (Bitfield-Mask: 0x01)          */
#define CTIMER_CTRL0_TMRA0CLR_Pos         (11UL)                    /*!< CTIMER CTRL0: TMRA0CLR (Bit 11)                       */
#define CTIMER_CTRL0_TMRA0CLR_Msk         (0x800UL)                 /*!< CTIMER CTRL0: TMRA0CLR (Bitfield-Mask: 0x01)          */
#define CTIMER_CTRL0_TMRA0IE1_Pos         (10UL)                    /*!< CTIMER CTRL0: TMRA0IE1 (Bit 10)                       */
#define CTIMER_CTRL0_TMRA0IE1_Msk         (0x400UL)                 /*!< CTIMER CTRL0: TMRA0IE1 (Bitfield-Mask: 0x01)          */
#define CTIMER_CTRL0_TMRA0IE0_Pos         (9UL)                     /*!< CTIMER CTRL0: TMRA0IE0 (Bit 9)                        */
#define CTIMER_CTRL0_TMRA0IE0_Msk         (0x200UL)                 /*!< CTIMER CTRL0: TMRA0IE0 (Bitfield-Mask: 0x01)          */
#define CTIMER_CTRL0_TMRA0FN_Pos          (6UL)                     /*!< CTIMER CTRL0: TMRA0FN (Bit 6)                         */
#define CTIMER_CTRL0_TMRA0FN_Msk          (0x1c0UL)                 /*!< CTIMER CTRL0: TMRA0FN (Bitfield-Mask: 0x07)           */
#define CTIMER_CTRL0_TMRA0CLK_Pos         (1UL)                     /*!< CTIMER CTRL0: TMRA0CLK (Bit 1)                        */
#define CTIMER_CTRL0_TMRA0CLK_Msk         (0x3eUL)                  /*!< CTIMER CTRL0: TMRA0CLK (Bitfield-Mask: 0x1f)          */
#define CTIMER_CTRL0_TMRA0EN_Pos          (0UL)                     /*!< CTIMER CTRL0: TMRA0EN (Bit 0)                         */
#define CTIMER_CTRL0_TMRA0EN_Msk          (0x1UL)                   /*!< CTIMER CTRL0: TMRA0EN (Bitfield-Mask: 0x01)           */
/* =======================================================  CMPRAUXA0  ======================================================= */
#define CTIMER_CMPRAUXA0_CMPR3A0_Pos      (16UL)                    /*!< CTIMER CMPRAUXA0: CMPR3A0 (Bit 16)                    */
#define CTIMER_CMPRAUXA0_CMPR3A0_Msk      (0xffff0000UL)            /*!< CTIMER CMPRAUXA0: CMPR3A0 (Bitfield-Mask: 0xffff)     */
#define CTIMER_CMPRAUXA0_CMPR2A0_Pos      (0UL)                     /*!< CTIMER CMPRAUXA0: CMPR2A0 (Bit 0)                     */
#define CTIMER_CMPRAUXA0_CMPR2A0_Msk      (0xffffUL)                /*!< CTIMER CMPRAUXA0: CMPR2A0 (Bitfield-Mask: 0xffff)     */
/* =======================================================  CMPRAUXB0  ======================================================= */
#define CTIMER_CMPRAUXB0_CMPR3B0_Pos      (16UL)                    /*!< CTIMER CMPRAUXB0: CMPR3B0 (Bit 16)                    */
#define CTIMER_CMPRAUXB0_CMPR3B0_Msk      (0xffff0000UL)            /*!< CTIMER CMPRAUXB0: CMPR3B0 (Bitfield-Mask: 0xffff)     */
#define CTIMER_CMPRAUXB0_CMPR2B0_Pos      (0UL)                     /*!< CTIMER CMPRAUXB0: CMPR2B0 (Bit 0)                     */
#define CTIMER_CMPRAUXB0_CMPR2B0_Msk      (0xffffUL)                /*!< CTIMER CMPRAUXB0: CMPR2B0 (Bitfield-Mask: 0xffff)     */
/* =========================================================  AUX0  ========================================================== */
#define CTIMER_AUX0_TMRB0EN23_Pos         (30UL)                    /*!< CTIMER AUX0: TMRB0EN23 (Bit 30)                       */
#define CTIMER_AUX0_TMRB0EN23_Msk         (0x40000000UL)            /*!< CTIMER AUX0: TMRB0EN23 (Bitfield-Mask: 0x01)          */
#define CTIMER_AUX0_TMRB0POL23_Pos        (29UL)                    /*!< CTIMER AUX0: TMRB0POL23 (Bit 29)                      */
#define CTIMER_AUX0_TMRB0POL23_Msk        (0x20000000UL)            /*!< CTIMER AUX0: TMRB0POL23 (Bitfield-Mask: 0x01)         */
#define CTIMER_AUX0_TMRB0TINV_Pos         (28UL)                    /*!< CTIMER AUX0: TMRB0TINV (Bit 28)                       */
#define CTIMER_AUX0_TMRB0TINV_Msk         (0x10000000UL)            /*!< CTIMER AUX0: TMRB0TINV (Bitfield-Mask: 0x01)          */
#define CTIMER_AUX0_TMRB0NOSYNC_Pos       (27UL)                    /*!< CTIMER AUX0: TMRB0NOSYNC (Bit 27)                     */
#define CTIMER_AUX0_TMRB0NOSYNC_Msk       (0x8000000UL)             /*!< CTIMER AUX0: TMRB0NOSYNC (Bitfield-Mask: 0x01)        */
#define CTIMER_AUX0_TMRB0TRIG_Pos         (23UL)                    /*!< CTIMER AUX0: TMRB0TRIG (Bit 23)                       */
#define CTIMER_AUX0_TMRB0TRIG_Msk         (0x7800000UL)             /*!< CTIMER AUX0: TMRB0TRIG (Bitfield-Mask: 0x0f)          */
#define CTIMER_AUX0_TMRB0LMT_Pos          (16UL)                    /*!< CTIMER AUX0: TMRB0LMT (Bit 16)                        */
#define CTIMER_AUX0_TMRB0LMT_Msk          (0x3f0000UL)              /*!< CTIMER AUX0: TMRB0LMT (Bitfield-Mask: 0x3f)           */
#define CTIMER_AUX0_TMRA0EN23_Pos         (14UL)                    /*!< CTIMER AUX0: TMRA0EN23 (Bit 14)                       */
#define CTIMER_AUX0_TMRA0EN23_Msk         (0x4000UL)                /*!< CTIMER AUX0: TMRA0EN23 (Bitfield-Mask: 0x01)          */
#define CTIMER_AUX0_TMRA0POL23_Pos        (13UL)                    /*!< CTIMER AUX0: TMRA0POL23 (Bit 13)                      */
#define CTIMER_AUX0_TMRA0POL23_Msk        (0x2000UL)                /*!< CTIMER AUX0: TMRA0POL23 (Bitfield-Mask: 0x01)         */
#define CTIMER_AUX0_TMRA0TINV_Pos         (12UL)                    /*!< CTIMER AUX0: TMRA0TINV (Bit 12)                       */
#define CTIMER_AUX0_TMRA0TINV_Msk         (0x1000UL)                /*!< CTIMER AUX0: TMRA0TINV (Bitfield-Mask: 0x01)          */
#define CTIMER_AUX0_TMRA0NOSYNC_Pos       (11UL)                    /*!< CTIMER AUX0: TMRA0NOSYNC (Bit 11)                     */
#define CTIMER_AUX0_TMRA0NOSYNC_Msk       (0x800UL)                 /*!< CTIMER AUX0: TMRA0NOSYNC (Bitfield-Mask: 0x01)        */
#define CTIMER_AUX0_TMRA0TRIG_Pos         (7UL)                     /*!< CTIMER AUX0: TMRA0TRIG (Bit 7)                        */
#define CTIMER_AUX0_TMRA0TRIG_Msk         (0x780UL)                 /*!< CTIMER AUX0: TMRA0TRIG (Bitfield-Mask: 0x0f)          */
#define CTIMER_AUX0_TMRA0LMT_Pos          (0UL)                     /*!< CTIMER AUX0: TMRA0LMT (Bit 0)                         */
#define CTIMER_AUX0_TMRA0LMT_Msk          (0x7fUL)                  /*!< CTIMER AUX0: TMRA0LMT (Bitfield-Mask: 0x7f)           */
/* =========================================================  TMR1  ========================================================== */
#define CTIMER_TMR1_CTTMRB1_Pos           (16UL)                    /*!< CTIMER TMR1: CTTMRB1 (Bit 16)                         */
#define CTIMER_TMR1_CTTMRB1_Msk           (0xffff0000UL)            /*!< CTIMER TMR1: CTTMRB1 (Bitfield-Mask: 0xffff)          */
#define CTIMER_TMR1_CTTMRA1_Pos           (0UL)                     /*!< CTIMER TMR1: CTTMRA1 (Bit 0)                          */
#define CTIMER_TMR1_CTTMRA1_Msk           (0xffffUL)                /*!< CTIMER TMR1: CTTMRA1 (Bitfield-Mask: 0xffff)          */
/* ========================================================  CMPRA1  ========================================================= */
#define CTIMER_CMPRA1_CMPR1A1_Pos         (16UL)                    /*!< CTIMER CMPRA1: CMPR1A1 (Bit 16)                       */
#define CTIMER_CMPRA1_CMPR1A1_Msk         (0xffff0000UL)            /*!< CTIMER CMPRA1: CMPR1A1 (Bitfield-Mask: 0xffff)        */
#define CTIMER_CMPRA1_CMPR0A1_Pos         (0UL)                     /*!< CTIMER CMPRA1: CMPR0A1 (Bit 0)                        */
#define CTIMER_CMPRA1_CMPR0A1_Msk         (0xffffUL)                /*!< CTIMER CMPRA1: CMPR0A1 (Bitfield-Mask: 0xffff)        */
/* ========================================================  CMPRB1  ========================================================= */
#define CTIMER_CMPRB1_CMPR1B1_Pos         (16UL)                    /*!< CTIMER CMPRB1: CMPR1B1 (Bit 16)                       */
#define CTIMER_CMPRB1_CMPR1B1_Msk         (0xffff0000UL)            /*!< CTIMER CMPRB1: CMPR1B1 (Bitfield-Mask: 0xffff)        */
#define CTIMER_CMPRB1_CMPR0B1_Pos         (0UL)                     /*!< CTIMER CMPRB1: CMPR0B1 (Bit 0)                        */
#define CTIMER_CMPRB1_CMPR0B1_Msk         (0xffffUL)                /*!< CTIMER CMPRB1: CMPR0B1 (Bitfield-Mask: 0xffff)        */
/* =========================================================  CTRL1  ========================================================= */
#define CTIMER_CTRL1_CTLINK1_Pos          (31UL)                    /*!< CTIMER CTRL1: CTLINK1 (Bit 31)                        */
#define CTIMER_CTRL1_CTLINK1_Msk          (0x80000000UL)            /*!< CTIMER CTRL1: CTLINK1 (Bitfield-Mask: 0x01)           */
#define CTIMER_CTRL1_TMRB1POL_Pos         (28UL)                    /*!< CTIMER CTRL1: TMRB1POL (Bit 28)                       */
#define CTIMER_CTRL1_TMRB1POL_Msk         (0x10000000UL)            /*!< CTIMER CTRL1: TMRB1POL (Bitfield-Mask: 0x01)          */
#define CTIMER_CTRL1_TMRB1CLR_Pos         (27UL)                    /*!< CTIMER CTRL1: TMRB1CLR (Bit 27)                       */
#define CTIMER_CTRL1_TMRB1CLR_Msk         (0x8000000UL)             /*!< CTIMER CTRL1: TMRB1CLR (Bitfield-Mask: 0x01)          */
#define CTIMER_CTRL1_TMRB1IE1_Pos         (26UL)                    /*!< CTIMER CTRL1: TMRB1IE1 (Bit 26)                       */
#define CTIMER_CTRL1_TMRB1IE1_Msk         (0x4000000UL)             /*!< CTIMER CTRL1: TMRB1IE1 (Bitfield-Mask: 0x01)          */
#define CTIMER_CTRL1_TMRB1IE0_Pos         (25UL)                    /*!< CTIMER CTRL1: TMRB1IE0 (Bit 25)                       */
#define CTIMER_CTRL1_TMRB1IE0_Msk         (0x2000000UL)             /*!< CTIMER CTRL1: TMRB1IE0 (Bitfield-Mask: 0x01)          */
#define CTIMER_CTRL1_TMRB1FN_Pos          (22UL)                    /*!< CTIMER CTRL1: TMRB1FN (Bit 22)                        */
#define CTIMER_CTRL1_TMRB1FN_Msk          (0x1c00000UL)             /*!< CTIMER CTRL1: TMRB1FN (Bitfield-Mask: 0x07)           */
#define CTIMER_CTRL1_TMRB1CLK_Pos         (17UL)                    /*!< CTIMER CTRL1: TMRB1CLK (Bit 17)                       */
#define CTIMER_CTRL1_TMRB1CLK_Msk         (0x3e0000UL)              /*!< CTIMER CTRL1: TMRB1CLK (Bitfield-Mask: 0x1f)          */
#define CTIMER_CTRL1_TMRB1EN_Pos          (16UL)                    /*!< CTIMER CTRL1: TMRB1EN (Bit 16)                        */
#define CTIMER_CTRL1_TMRB1EN_Msk          (0x10000UL)               /*!< CTIMER CTRL1: TMRB1EN (Bitfield-Mask: 0x01)           */
#define CTIMER_CTRL1_TMRA1POL_Pos         (12UL)                    /*!< CTIMER CTRL1: TMRA1POL (Bit 12)                       */
#define CTIMER_CTRL1_TMRA1POL_Msk         (0x1000UL)                /*!< CTIMER CTRL1: TMRA1POL (Bitfield-Mask: 0x01)          */
#define CTIMER_CTRL1_TMRA1CLR_Pos         (11UL)                    /*!< CTIMER CTRL1: TMRA1CLR (Bit 11)                       */
#define CTIMER_CTRL1_TMRA1CLR_Msk         (0x800UL)                 /*!< CTIMER CTRL1: TMRA1CLR (Bitfield-Mask: 0x01)          */
#define CTIMER_CTRL1_TMRA1IE1_Pos         (10UL)                    /*!< CTIMER CTRL1: TMRA1IE1 (Bit 10)                       */
#define CTIMER_CTRL1_TMRA1IE1_Msk         (0x400UL)                 /*!< CTIMER CTRL1: TMRA1IE1 (Bitfield-Mask: 0x01)          */
#define CTIMER_CTRL1_TMRA1IE0_Pos         (9UL)                     /*!< CTIMER CTRL1: TMRA1IE0 (Bit 9)                        */
#define CTIMER_CTRL1_TMRA1IE0_Msk         (0x200UL)                 /*!< CTIMER CTRL1: TMRA1IE0 (Bitfield-Mask: 0x01)          */
#define CTIMER_CTRL1_TMRA1FN_Pos          (6UL)                     /*!< CTIMER CTRL1: TMRA1FN (Bit 6)                         */
#define CTIMER_CTRL1_TMRA1FN_Msk          (0x1c0UL)                 /*!< CTIMER CTRL1: TMRA1FN (Bitfield-Mask: 0x07)           */
#define CTIMER_CTRL1_TMRA1CLK_Pos         (1UL)                     /*!< CTIMER CTRL1: TMRA1CLK (Bit 1)                        */
#define CTIMER_CTRL1_TMRA1CLK_Msk         (0x3eUL)                  /*!< CTIMER CTRL1: TMRA1CLK (Bitfield-Mask: 0x1f)          */
#define CTIMER_CTRL1_TMRA1EN_Pos          (0UL)                     /*!< CTIMER CTRL1: TMRA1EN (Bit 0)                         */
#define CTIMER_CTRL1_TMRA1EN_Msk          (0x1UL)                   /*!< CTIMER CTRL1: TMRA1EN (Bitfield-Mask: 0x01)           */
/* =======================================================  CMPRAUXA1  ======================================================= */
#define CTIMER_CMPRAUXA1_CMPR3A1_Pos      (16UL)                    /*!< CTIMER CMPRAUXA1: CMPR3A1 (Bit 16)                    */
#define CTIMER_CMPRAUXA1_CMPR3A1_Msk      (0xffff0000UL)            /*!< CTIMER CMPRAUXA1: CMPR3A1 (Bitfield-Mask: 0xffff)     */
#define CTIMER_CMPRAUXA1_CMPR2A1_Pos      (0UL)                     /*!< CTIMER CMPRAUXA1: CMPR2A1 (Bit 0)                     */
#define CTIMER_CMPRAUXA1_CMPR2A1_Msk      (0xffffUL)                /*!< CTIMER CMPRAUXA1: CMPR2A1 (Bitfield-Mask: 0xffff)     */
/* =======================================================  CMPRAUXB1  ======================================================= */
#define CTIMER_CMPRAUXB1_CMPR3B1_Pos      (16UL)                    /*!< CTIMER CMPRAUXB1: CMPR3B1 (Bit 16)                    */
#define CTIMER_CMPRAUXB1_CMPR3B1_Msk      (0xffff0000UL)            /*!< CTIMER CMPRAUXB1: CMPR3B1 (Bitfield-Mask: 0xffff)     */
#define CTIMER_CMPRAUXB1_CMPR2B1_Pos      (0UL)                     /*!< CTIMER CMPRAUXB1: CMPR2B1 (Bit 0)                     */
#define CTIMER_CMPRAUXB1_CMPR2B1_Msk      (0xffffUL)                /*!< CTIMER CMPRAUXB1: CMPR2B1 (Bitfield-Mask: 0xffff)     */
/* =========================================================  AUX1  ========================================================== */
#define CTIMER_AUX1_TMRB1EN23_Pos         (30UL)                    /*!< CTIMER AUX1: TMRB1EN23 (Bit 30)                       */
#define CTIMER_AUX1_TMRB1EN23_Msk         (0x40000000UL)            /*!< CTIMER AUX1: TMRB1EN23 (Bitfield-Mask: 0x01)          */
#define CTIMER_AUX1_TMRB1POL23_Pos        (29UL)                    /*!< CTIMER AUX1: TMRB1POL23 (Bit 29)                      */
#define CTIMER_AUX1_TMRB1POL23_Msk        (0x20000000UL)            /*!< CTIMER AUX1: TMRB1POL23 (Bitfield-Mask: 0x01)         */
#define CTIMER_AUX1_TMRB1TINV_Pos         (28UL)                    /*!< CTIMER AUX1: TMRB1TINV (Bit 28)                       */
#define CTIMER_AUX1_TMRB1TINV_Msk         (0x10000000UL)            /*!< CTIMER AUX1: TMRB1TINV (Bitfield-Mask: 0x01)          */
#define CTIMER_AUX1_TMRB1NOSYNC_Pos       (27UL)                    /*!< CTIMER AUX1: TMRB1NOSYNC (Bit 27)                     */
#define CTIMER_AUX1_TMRB1NOSYNC_Msk       (0x8000000UL)             /*!< CTIMER AUX1: TMRB1NOSYNC (Bitfield-Mask: 0x01)        */
#define CTIMER_AUX1_TMRB1TRIG_Pos         (23UL)                    /*!< CTIMER AUX1: TMRB1TRIG (Bit 23)                       */
#define CTIMER_AUX1_TMRB1TRIG_Msk         (0x7800000UL)             /*!< CTIMER AUX1: TMRB1TRIG (Bitfield-Mask: 0x0f)          */
#define CTIMER_AUX1_TMRB1LMT_Pos          (16UL)                    /*!< CTIMER AUX1: TMRB1LMT (Bit 16)                        */
#define CTIMER_AUX1_TMRB1LMT_Msk          (0x3f0000UL)              /*!< CTIMER AUX1: TMRB1LMT (Bitfield-Mask: 0x3f)           */
#define CTIMER_AUX1_TMRA1EN23_Pos         (14UL)                    /*!< CTIMER AUX1: TMRA1EN23 (Bit 14)                       */
#define CTIMER_AUX1_TMRA1EN23_Msk         (0x4000UL)                /*!< CTIMER AUX1: TMRA1EN23 (Bitfield-Mask: 0x01)          */
#define CTIMER_AUX1_TMRA1POL23_Pos        (13UL)                    /*!< CTIMER AUX1: TMRA1POL23 (Bit 13)                      */
#define CTIMER_AUX1_TMRA1POL23_Msk        (0x2000UL)                /*!< CTIMER AUX1: TMRA1POL23 (Bitfield-Mask: 0x01)         */
#define CTIMER_AUX1_TMRA1TINV_Pos         (12UL)                    /*!< CTIMER AUX1: TMRA1TINV (Bit 12)                       */
#define CTIMER_AUX1_TMRA1TINV_Msk         (0x1000UL)                /*!< CTIMER AUX1: TMRA1TINV (Bitfield-Mask: 0x01)          */
#define CTIMER_AUX1_TMRA1NOSYNC_Pos       (11UL)                    /*!< CTIMER AUX1: TMRA1NOSYNC (Bit 11)                     */
#define CTIMER_AUX1_TMRA1NOSYNC_Msk       (0x800UL)                 /*!< CTIMER AUX1: TMRA1NOSYNC (Bitfield-Mask: 0x01)        */
#define CTIMER_AUX1_TMRA1TRIG_Pos         (7UL)                     /*!< CTIMER AUX1: TMRA1TRIG (Bit 7)                        */
#define CTIMER_AUX1_TMRA1TRIG_Msk         (0x780UL)                 /*!< CTIMER AUX1: TMRA1TRIG (Bitfield-Mask: 0x0f)          */
#define CTIMER_AUX1_TMRA1LMT_Pos          (0UL)                     /*!< CTIMER AUX1: TMRA1LMT (Bit 0)                         */
#define CTIMER_AUX1_TMRA1LMT_Msk          (0x7fUL)                  /*!< CTIMER AUX1: TMRA1LMT (Bitfield-Mask: 0x7f)           */
/* =========================================================  TMR2  ========================================================== */
#define CTIMER_TMR2_CTTMRB2_Pos           (16UL)                    /*!< CTIMER TMR2: CTTMRB2 (Bit 16)                         */
#define CTIMER_TMR2_CTTMRB2_Msk           (0xffff0000UL)            /*!< CTIMER TMR2: CTTMRB2 (Bitfield-Mask: 0xffff)          */
#define CTIMER_TMR2_CTTMRA2_Pos           (0UL)                     /*!< CTIMER TMR2: CTTMRA2 (Bit 0)                          */
#define CTIMER_TMR2_CTTMRA2_Msk           (0xffffUL)                /*!< CTIMER TMR2: CTTMRA2 (Bitfield-Mask: 0xffff)          */
/* ========================================================  CMPRA2  ========================================================= */
#define CTIMER_CMPRA2_CMPR1A2_Pos         (16UL)                    /*!< CTIMER CMPRA2: CMPR1A2 (Bit 16)                       */
#define CTIMER_CMPRA2_CMPR1A2_Msk         (0xffff0000UL)            /*!< CTIMER CMPRA2: CMPR1A2 (Bitfield-Mask: 0xffff)        */
#define CTIMER_CMPRA2_CMPR0A2_Pos         (0UL)                     /*!< CTIMER CMPRA2: CMPR0A2 (Bit 0)                        */
#define CTIMER_CMPRA2_CMPR0A2_Msk         (0xffffUL)                /*!< CTIMER CMPRA2: CMPR0A2 (Bitfield-Mask: 0xffff)        */
/* ========================================================  CMPRB2  ========================================================= */
#define CTIMER_CMPRB2_CMPR1B2_Pos         (16UL)                    /*!< CTIMER CMPRB2: CMPR1B2 (Bit 16)                       */
#define CTIMER_CMPRB2_CMPR1B2_Msk         (0xffff0000UL)            /*!< CTIMER CMPRB2: CMPR1B2 (Bitfield-Mask: 0xffff)        */
#define CTIMER_CMPRB2_CMPR0B2_Pos         (0UL)                     /*!< CTIMER CMPRB2: CMPR0B2 (Bit 0)                        */
#define CTIMER_CMPRB2_CMPR0B2_Msk         (0xffffUL)                /*!< CTIMER CMPRB2: CMPR0B2 (Bitfield-Mask: 0xffff)        */
/* =========================================================  CTRL2  ========================================================= */
#define CTIMER_CTRL2_CTLINK2_Pos          (31UL)                    /*!< CTIMER CTRL2: CTLINK2 (Bit 31)                        */
#define CTIMER_CTRL2_CTLINK2_Msk          (0x80000000UL)            /*!< CTIMER CTRL2: CTLINK2 (Bitfield-Mask: 0x01)           */
#define CTIMER_CTRL2_TMRB2POL_Pos         (28UL)                    /*!< CTIMER CTRL2: TMRB2POL (Bit 28)                       */
#define CTIMER_CTRL2_TMRB2POL_Msk         (0x10000000UL)            /*!< CTIMER CTRL2: TMRB2POL (Bitfield-Mask: 0x01)          */
#define CTIMER_CTRL2_TMRB2CLR_Pos         (27UL)                    /*!< CTIMER CTRL2: TMRB2CLR (Bit 27)                       */
#define CTIMER_CTRL2_TMRB2CLR_Msk         (0x8000000UL)             /*!< CTIMER CTRL2: TMRB2CLR (Bitfield-Mask: 0x01)          */
