sparkfun/Arduino_Apollo3/cores/arduino/am_sdk_ap3/CMSIS/AmbiqMicro/Include/apollo3c.h
#define CTIMER_CTRL2_TMRB2IE1_Pos         (26UL)                    /*!< CTIMER CTRL2: TMRB2IE1 (Bit 26)                       */
#define CTIMER_CTRL2_TMRB2IE1_Msk         (0x4000000UL)             /*!< CTIMER CTRL2: TMRB2IE1 (Bitfield-Mask: 0x01)          */
#define CTIMER_CTRL2_TMRB2IE0_Pos         (25UL)                    /*!< CTIMER CTRL2: TMRB2IE0 (Bit 25)                       */
#define CTIMER_CTRL2_TMRB2IE0_Msk         (0x2000000UL)             /*!< CTIMER CTRL2: TMRB2IE0 (Bitfield-Mask: 0x01)          */
#define CTIMER_CTRL2_TMRB2FN_Pos          (22UL)                    /*!< CTIMER CTRL2: TMRB2FN (Bit 22)                        */
#define CTIMER_CTRL2_TMRB2FN_Msk          (0x1c00000UL)             /*!< CTIMER CTRL2: TMRB2FN (Bitfield-Mask: 0x07)           */
#define CTIMER_CTRL2_TMRB2CLK_Pos         (17UL)                    /*!< CTIMER CTRL2: TMRB2CLK (Bit 17)                       */
#define CTIMER_CTRL2_TMRB2CLK_Msk         (0x3e0000UL)              /*!< CTIMER CTRL2: TMRB2CLK (Bitfield-Mask: 0x1f)          */
#define CTIMER_CTRL2_TMRB2EN_Pos          (16UL)                    /*!< CTIMER CTRL2: TMRB2EN (Bit 16)                        */
#define CTIMER_CTRL2_TMRB2EN_Msk          (0x10000UL)               /*!< CTIMER CTRL2: TMRB2EN (Bitfield-Mask: 0x01)           */
#define CTIMER_CTRL2_TMRA2POL_Pos         (12UL)                    /*!< CTIMER CTRL2: TMRA2POL (Bit 12)                       */
#define CTIMER_CTRL2_TMRA2POL_Msk         (0x1000UL)                /*!< CTIMER CTRL2: TMRA2POL (Bitfield-Mask: 0x01)          */
#define CTIMER_CTRL2_TMRA2CLR_Pos         (11UL)                    /*!< CTIMER CTRL2: TMRA2CLR (Bit 11)                       */
#define CTIMER_CTRL2_TMRA2CLR_Msk         (0x800UL)                 /*!< CTIMER CTRL2: TMRA2CLR (Bitfield-Mask: 0x01)          */
#define CTIMER_CTRL2_TMRA2IE1_Pos         (10UL)                    /*!< CTIMER CTRL2: TMRA2IE1 (Bit 10)                       */
#define CTIMER_CTRL2_TMRA2IE1_Msk         (0x400UL)                 /*!< CTIMER CTRL2: TMRA2IE1 (Bitfield-Mask: 0x01)          */
#define CTIMER_CTRL2_TMRA2IE0_Pos         (9UL)                     /*!< CTIMER CTRL2: TMRA2IE0 (Bit 9)                        */
#define CTIMER_CTRL2_TMRA2IE0_Msk         (0x200UL)                 /*!< CTIMER CTRL2: TMRA2IE0 (Bitfield-Mask: 0x01)          */
#define CTIMER_CTRL2_TMRA2FN_Pos          (6UL)                     /*!< CTIMER CTRL2: TMRA2FN (Bit 6)                         */
#define CTIMER_CTRL2_TMRA2FN_Msk          (0x1c0UL)                 /*!< CTIMER CTRL2: TMRA2FN (Bitfield-Mask: 0x07)           */
#define CTIMER_CTRL2_TMRA2CLK_Pos         (1UL)                     /*!< CTIMER CTRL2: TMRA2CLK (Bit 1)                        */
#define CTIMER_CTRL2_TMRA2CLK_Msk         (0x3eUL)                  /*!< CTIMER CTRL2: TMRA2CLK (Bitfield-Mask: 0x1f)          */
#define CTIMER_CTRL2_TMRA2EN_Pos          (0UL)                     /*!< CTIMER CTRL2: TMRA2EN (Bit 0)                         */
#define CTIMER_CTRL2_TMRA2EN_Msk          (0x1UL)                   /*!< CTIMER CTRL2: TMRA2EN (Bitfield-Mask: 0x01)           */
/* =======================================================  CMPRAUXA2  ======================================================= */
#define CTIMER_CMPRAUXA2_CMPR3A2_Pos      (16UL)                    /*!< CTIMER CMPRAUXA2: CMPR3A2 (Bit 16)                    */
#define CTIMER_CMPRAUXA2_CMPR3A2_Msk      (0xffff0000UL)            /*!< CTIMER CMPRAUXA2: CMPR3A2 (Bitfield-Mask: 0xffff)     */
#define CTIMER_CMPRAUXA2_CMPR2A2_Pos      (0UL)                     /*!< CTIMER CMPRAUXA2: CMPR2A2 (Bit 0)                     */
#define CTIMER_CMPRAUXA2_CMPR2A2_Msk      (0xffffUL)                /*!< CTIMER CMPRAUXA2: CMPR2A2 (Bitfield-Mask: 0xffff)     */
/* =======================================================  CMPRAUXB2  ======================================================= */
#define CTIMER_CMPRAUXB2_CMPR3B2_Pos      (16UL)                    /*!< CTIMER CMPRAUXB2: CMPR3B2 (Bit 16)                    */
#define CTIMER_CMPRAUXB2_CMPR3B2_Msk      (0xffff0000UL)            /*!< CTIMER CMPRAUXB2: CMPR3B2 (Bitfield-Mask: 0xffff)     */
#define CTIMER_CMPRAUXB2_CMPR2B2_Pos      (0UL)                     /*!< CTIMER CMPRAUXB2: CMPR2B2 (Bit 0)                     */
#define CTIMER_CMPRAUXB2_CMPR2B2_Msk      (0xffffUL)                /*!< CTIMER CMPRAUXB2: CMPR2B2 (Bitfield-Mask: 0xffff)     */
/* =========================================================  AUX2  ========================================================== */
#define CTIMER_AUX2_TMRB2EN23_Pos         (30UL)                    /*!< CTIMER AUX2: TMRB2EN23 (Bit 30)                       */
#define CTIMER_AUX2_TMRB2EN23_Msk         (0x40000000UL)            /*!< CTIMER AUX2: TMRB2EN23 (Bitfield-Mask: 0x01)          */
#define CTIMER_AUX2_TMRB2POL23_Pos        (29UL)                    /*!< CTIMER AUX2: TMRB2POL23 (Bit 29)                      */
#define CTIMER_AUX2_TMRB2POL23_Msk        (0x20000000UL)            /*!< CTIMER AUX2: TMRB2POL23 (Bitfield-Mask: 0x01)         */
#define CTIMER_AUX2_TMRB2TINV_Pos         (28UL)                    /*!< CTIMER AUX2: TMRB2TINV (Bit 28)                       */
#define CTIMER_AUX2_TMRB2TINV_Msk         (0x10000000UL)            /*!< CTIMER AUX2: TMRB2TINV (Bitfield-Mask: 0x01)          */
#define CTIMER_AUX2_TMRB2NOSYNC_Pos       (27UL)                    /*!< CTIMER AUX2: TMRB2NOSYNC (Bit 27)                     */
#define CTIMER_AUX2_TMRB2NOSYNC_Msk       (0x8000000UL)             /*!< CTIMER AUX2: TMRB2NOSYNC (Bitfield-Mask: 0x01)        */
#define CTIMER_AUX2_TMRB2TRIG_Pos         (23UL)                    /*!< CTIMER AUX2: TMRB2TRIG (Bit 23)                       */
#define CTIMER_AUX2_TMRB2TRIG_Msk         (0x7800000UL)             /*!< CTIMER AUX2: TMRB2TRIG (Bitfield-Mask: 0x0f)          */
#define CTIMER_AUX2_TMRB2LMT_Pos          (16UL)                    /*!< CTIMER AUX2: TMRB2LMT (Bit 16)                        */
#define CTIMER_AUX2_TMRB2LMT_Msk          (0x3f0000UL)              /*!< CTIMER AUX2: TMRB2LMT (Bitfield-Mask: 0x3f)           */
#define CTIMER_AUX2_TMRA2EN23_Pos         (14UL)                    /*!< CTIMER AUX2: TMRA2EN23 (Bit 14)                       */
#define CTIMER_AUX2_TMRA2EN23_Msk         (0x4000UL)                /*!< CTIMER AUX2: TMRA2EN23 (Bitfield-Mask: 0x01)          */
#define CTIMER_AUX2_TMRA2POL23_Pos        (13UL)                    /*!< CTIMER AUX2: TMRA2POL23 (Bit 13)                      */
#define CTIMER_AUX2_TMRA2POL23_Msk        (0x2000UL)                /*!< CTIMER AUX2: TMRA2POL23 (Bitfield-Mask: 0x01)         */
#define CTIMER_AUX2_TMRA2TINV_Pos         (12UL)                    /*!< CTIMER AUX2: TMRA2TINV (Bit 12)                       */
#define CTIMER_AUX2_TMRA2TINV_Msk         (0x1000UL)                /*!< CTIMER AUX2: TMRA2TINV (Bitfield-Mask: 0x01)          */
#define CTIMER_AUX2_TMRA2NOSYNC_Pos       (11UL)                    /*!< CTIMER AUX2: TMRA2NOSYNC (Bit 11)                     */
#define CTIMER_AUX2_TMRA2NOSYNC_Msk       (0x800UL)                 /*!< CTIMER AUX2: TMRA2NOSYNC (Bitfield-Mask: 0x01)        */
#define CTIMER_AUX2_TMRA2TRIG_Pos         (7UL)                     /*!< CTIMER AUX2: TMRA2TRIG (Bit 7)                        */
#define CTIMER_AUX2_TMRA2TRIG_Msk         (0x780UL)                 /*!< CTIMER AUX2: TMRA2TRIG (Bitfield-Mask: 0x0f)          */
#define CTIMER_AUX2_TMRA2LMT_Pos          (0UL)                     /*!< CTIMER AUX2: TMRA2LMT (Bit 0)                         */
#define CTIMER_AUX2_TMRA2LMT_Msk          (0x7fUL)                  /*!< CTIMER AUX2: TMRA2LMT (Bitfield-Mask: 0x7f)           */
/* =========================================================  TMR3  ========================================================== */
#define CTIMER_TMR3_CTTMRB3_Pos           (16UL)                    /*!< CTIMER TMR3: CTTMRB3 (Bit 16)                         */
#define CTIMER_TMR3_CTTMRB3_Msk           (0xffff0000UL)            /*!< CTIMER TMR3: CTTMRB3 (Bitfield-Mask: 0xffff)          */
#define CTIMER_TMR3_CTTMRA3_Pos           (0UL)                     /*!< CTIMER TMR3: CTTMRA3 (Bit 0)                          */
#define CTIMER_TMR3_CTTMRA3_Msk           (0xffffUL)                /*!< CTIMER TMR3: CTTMRA3 (Bitfield-Mask: 0xffff)          */
/* ========================================================  CMPRA3  ========================================================= */
#define CTIMER_CMPRA3_CMPR1A3_Pos         (16UL)                    /*!< CTIMER CMPRA3: CMPR1A3 (Bit 16)                       */
#define CTIMER_CMPRA3_CMPR1A3_Msk         (0xffff0000UL)            /*!< CTIMER CMPRA3: CMPR1A3 (Bitfield-Mask: 0xffff)        */
#define CTIMER_CMPRA3_CMPR0A3_Pos         (0UL)                     /*!< CTIMER CMPRA3: CMPR0A3 (Bit 0)                        */
#define CTIMER_CMPRA3_CMPR0A3_Msk         (0xffffUL)                /*!< CTIMER CMPRA3: CMPR0A3 (Bitfield-Mask: 0xffff)        */
/* ========================================================  CMPRB3  ========================================================= */
#define CTIMER_CMPRB3_CMPR1B3_Pos         (16UL)                    /*!< CTIMER CMPRB3: CMPR1B3 (Bit 16)                       */
#define CTIMER_CMPRB3_CMPR1B3_Msk         (0xffff0000UL)            /*!< CTIMER CMPRB3: CMPR1B3 (Bitfield-Mask: 0xffff)        */
#define CTIMER_CMPRB3_CMPR0B3_Pos         (0UL)                     /*!< CTIMER CMPRB3: CMPR0B3 (Bit 0)                        */
#define CTIMER_CMPRB3_CMPR0B3_Msk         (0xffffUL)                /*!< CTIMER CMPRB3: CMPR0B3 (Bitfield-Mask: 0xffff)        */
/* =========================================================  CTRL3  ========================================================= */
#define CTIMER_CTRL3_CTLINK3_Pos          (31UL)                    /*!< CTIMER CTRL3: CTLINK3 (Bit 31)                        */
#define CTIMER_CTRL3_CTLINK3_Msk          (0x80000000UL)            /*!< CTIMER CTRL3: CTLINK3 (Bitfield-Mask: 0x01)           */
#define CTIMER_CTRL3_TMRB3POL_Pos         (28UL)                    /*!< CTIMER CTRL3: TMRB3POL (Bit 28)                       */
#define CTIMER_CTRL3_TMRB3POL_Msk         (0x10000000UL)            /*!< CTIMER CTRL3: TMRB3POL (Bitfield-Mask: 0x01)          */
#define CTIMER_CTRL3_TMRB3CLR_Pos         (27UL)                    /*!< CTIMER CTRL3: TMRB3CLR (Bit 27)                       */
#define CTIMER_CTRL3_TMRB3CLR_Msk         (0x8000000UL)             /*!< CTIMER CTRL3: TMRB3CLR (Bitfield-Mask: 0x01)          */
#define CTIMER_CTRL3_TMRB3IE1_Pos         (26UL)                    /*!< CTIMER CTRL3: TMRB3IE1 (Bit 26)                       */
#define CTIMER_CTRL3_TMRB3IE1_Msk         (0x4000000UL)             /*!< CTIMER CTRL3: TMRB3IE1 (Bitfield-Mask: 0x01)          */
#define CTIMER_CTRL3_TMRB3IE0_Pos         (25UL)                    /*!< CTIMER CTRL3: TMRB3IE0 (Bit 25)                       */
#define CTIMER_CTRL3_TMRB3IE0_Msk         (0x2000000UL)             /*!< CTIMER CTRL3: TMRB3IE0 (Bitfield-Mask: 0x01)          */
#define CTIMER_CTRL3_TMRB3FN_Pos          (22UL)                    /*!< CTIMER CTRL3: TMRB3FN (Bit 22)                        */
#define CTIMER_CTRL3_TMRB3FN_Msk          (0x1c00000UL)             /*!< CTIMER CTRL3: TMRB3FN (Bitfield-Mask: 0x07)           */
#define CTIMER_CTRL3_TMRB3CLK_Pos         (17UL)                    /*!< CTIMER CTRL3: TMRB3CLK (Bit 17)                       */
#define CTIMER_CTRL3_TMRB3CLK_Msk         (0x3e0000UL)              /*!< CTIMER CTRL3: TMRB3CLK (Bitfield-Mask: 0x1f)          */
#define CTIMER_CTRL3_TMRB3EN_Pos          (16UL)                    /*!< CTIMER CTRL3: TMRB3EN (Bit 16)                        */
#define CTIMER_CTRL3_TMRB3EN_Msk          (0x10000UL)               /*!< CTIMER CTRL3: TMRB3EN (Bitfield-Mask: 0x01)           */
#define CTIMER_CTRL3_ADCEN_Pos            (15UL)                    /*!< CTIMER CTRL3: ADCEN (Bit 15)                          */
#define CTIMER_CTRL3_ADCEN_Msk            (0x8000UL)                /*!< CTIMER CTRL3: ADCEN (Bitfield-Mask: 0x01)             */
#define CTIMER_CTRL3_TMRA3POL_Pos         (12UL)                    /*!< CTIMER CTRL3: TMRA3POL (Bit 12)                       */
#define CTIMER_CTRL3_TMRA3POL_Msk         (0x1000UL)                /*!< CTIMER CTRL3: TMRA3POL (Bitfield-Mask: 0x01)          */
#define CTIMER_CTRL3_TMRA3CLR_Pos         (11UL)                    /*!< CTIMER CTRL3: TMRA3CLR (Bit 11)                       */
#define CTIMER_CTRL3_TMRA3CLR_Msk         (0x800UL)                 /*!< CTIMER CTRL3: TMRA3CLR (Bitfield-Mask: 0x01)          */
#define CTIMER_CTRL3_TMRA3IE1_Pos         (10UL)                    /*!< CTIMER CTRL3: TMRA3IE1 (Bit 10)                       */
#define CTIMER_CTRL3_TMRA3IE1_Msk         (0x400UL)                 /*!< CTIMER CTRL3: TMRA3IE1 (Bitfield-Mask: 0x01)          */
#define CTIMER_CTRL3_TMRA3IE0_Pos         (9UL)                     /*!< CTIMER CTRL3: TMRA3IE0 (Bit 9)                        */
#define CTIMER_CTRL3_TMRA3IE0_Msk         (0x200UL)                 /*!< CTIMER CTRL3: TMRA3IE0 (Bitfield-Mask: 0x01)          */
#define CTIMER_CTRL3_TMRA3FN_Pos          (6UL)                     /*!< CTIMER CTRL3: TMRA3FN (Bit 6)                         */
#define CTIMER_CTRL3_TMRA3FN_Msk          (0x1c0UL)                 /*!< CTIMER CTRL3: TMRA3FN (Bitfield-Mask: 0x07)           */
#define CTIMER_CTRL3_TMRA3CLK_Pos         (1UL)                     /*!< CTIMER CTRL3: TMRA3CLK (Bit 1)                        */
#define CTIMER_CTRL3_TMRA3CLK_Msk         (0x3eUL)                  /*!< CTIMER CTRL3: TMRA3CLK (Bitfield-Mask: 0x1f)          */
#define CTIMER_CTRL3_TMRA3EN_Pos          (0UL)                     /*!< CTIMER CTRL3: TMRA3EN (Bit 0)                         */
#define CTIMER_CTRL3_TMRA3EN_Msk          (0x1UL)                   /*!< CTIMER CTRL3: TMRA3EN (Bitfield-Mask: 0x01)           */
/* =======================================================  CMPRAUXA3  ======================================================= */
#define CTIMER_CMPRAUXA3_CMPR3A3_Pos      (16UL)                    /*!< CTIMER CMPRAUXA3: CMPR3A3 (Bit 16)                    */
#define CTIMER_CMPRAUXA3_CMPR3A3_Msk      (0xffff0000UL)            /*!< CTIMER CMPRAUXA3: CMPR3A3 (Bitfield-Mask: 0xffff)     */
#define CTIMER_CMPRAUXA3_CMPR2A3_Pos      (0UL)                     /*!< CTIMER CMPRAUXA3: CMPR2A3 (Bit 0)                     */
#define CTIMER_CMPRAUXA3_CMPR2A3_Msk      (0xffffUL)                /*!< CTIMER CMPRAUXA3: CMPR2A3 (Bitfield-Mask: 0xffff)     */
/* =======================================================  CMPRAUXB3  ======================================================= */
#define CTIMER_CMPRAUXB3_CMPR3B3_Pos      (16UL)                    /*!< CTIMER CMPRAUXB3: CMPR3B3 (Bit 16)                    */
#define CTIMER_CMPRAUXB3_CMPR3B3_Msk      (0xffff0000UL)            /*!< CTIMER CMPRAUXB3: CMPR3B3 (Bitfield-Mask: 0xffff)     */
#define CTIMER_CMPRAUXB3_CMPR2B3_Pos      (0UL)                     /*!< CTIMER CMPRAUXB3: CMPR2B3 (Bit 0)                     */
#define CTIMER_CMPRAUXB3_CMPR2B3_Msk      (0xffffUL)                /*!< CTIMER CMPRAUXB3: CMPR2B3 (Bitfield-Mask: 0xffff)     */
/* =========================================================  AUX3  ========================================================== */
#define CTIMER_AUX3_TMRB3EN23_Pos         (30UL)                    /*!< CTIMER AUX3: TMRB3EN23 (Bit 30)                       */
#define CTIMER_AUX3_TMRB3EN23_Msk         (0x40000000UL)            /*!< CTIMER AUX3: TMRB3EN23 (Bitfield-Mask: 0x01)          */
#define CTIMER_AUX3_TMRB3POL23_Pos        (29UL)                    /*!< CTIMER AUX3: TMRB3POL23 (Bit 29)                      */
#define CTIMER_AUX3_TMRB3POL23_Msk        (0x20000000UL)            /*!< CTIMER AUX3: TMRB3POL23 (Bitfield-Mask: 0x01)         */
#define CTIMER_AUX3_TMRB3TINV_Pos         (28UL)                    /*!< CTIMER AUX3: TMRB3TINV (Bit 28)                       */
#define CTIMER_AUX3_TMRB3TINV_Msk         (0x10000000UL)            /*!< CTIMER AUX3: TMRB3TINV (Bitfield-Mask: 0x01)          */
#define CTIMER_AUX3_TMRB3NOSYNC_Pos       (27UL)                    /*!< CTIMER AUX3: TMRB3NOSYNC (Bit 27)                     */
#define CTIMER_AUX3_TMRB3NOSYNC_Msk       (0x8000000UL)             /*!< CTIMER AUX3: TMRB3NOSYNC (Bitfield-Mask: 0x01)        */
#define CTIMER_AUX3_TMRB3TRIG_Pos         (23UL)                    /*!< CTIMER AUX3: TMRB3TRIG (Bit 23)                       */
#define CTIMER_AUX3_TMRB3TRIG_Msk         (0x7800000UL)             /*!< CTIMER AUX3: TMRB3TRIG (Bitfield-Mask: 0x0f)          */
#define CTIMER_AUX3_TMRB3LMT_Pos          (16UL)                    /*!< CTIMER AUX3: TMRB3LMT (Bit 16)                        */
#define CTIMER_AUX3_TMRB3LMT_Msk          (0x3f0000UL)              /*!< CTIMER AUX3: TMRB3LMT (Bitfield-Mask: 0x3f)           */
#define CTIMER_AUX3_TMRA3EN23_Pos         (14UL)                    /*!< CTIMER AUX3: TMRA3EN23 (Bit 14)                       */
#define CTIMER_AUX3_TMRA3EN23_Msk         (0x4000UL)                /*!< CTIMER AUX3: TMRA3EN23 (Bitfield-Mask: 0x01)          */
#define CTIMER_AUX3_TMRA3POL23_Pos        (13UL)                    /*!< CTIMER AUX3: TMRA3POL23 (Bit 13)                      */
#define CTIMER_AUX3_TMRA3POL23_Msk        (0x2000UL)                /*!< CTIMER AUX3: TMRA3POL23 (Bitfield-Mask: 0x01)         */
#define CTIMER_AUX3_TMRA3TINV_Pos         (12UL)                    /*!< CTIMER AUX3: TMRA3TINV (Bit 12)                       */
#define CTIMER_AUX3_TMRA3TINV_Msk         (0x1000UL)                /*!< CTIMER AUX3: TMRA3TINV (Bitfield-Mask: 0x01)          */
#define CTIMER_AUX3_TMRA3NOSYNC_Pos       (11UL)                    /*!< CTIMER AUX3: TMRA3NOSYNC (Bit 11)                     */
#define CTIMER_AUX3_TMRA3NOSYNC_Msk       (0x800UL)                 /*!< CTIMER AUX3: TMRA3NOSYNC (Bitfield-Mask: 0x01)        */
#define CTIMER_AUX3_TMRA3TRIG_Pos         (7UL)                     /*!< CTIMER AUX3: TMRA3TRIG (Bit 7)                        */
#define CTIMER_AUX3_TMRA3TRIG_Msk         (0x780UL)                 /*!< CTIMER AUX3: TMRA3TRIG (Bitfield-Mask: 0x0f)          */
#define CTIMER_AUX3_TMRA3LMT_Pos          (0UL)                     /*!< CTIMER AUX3: TMRA3LMT (Bit 0)                         */
#define CTIMER_AUX3_TMRA3LMT_Msk          (0x7fUL)                  /*!< CTIMER AUX3: TMRA3LMT (Bitfield-Mask: 0x7f)           */
/* =========================================================  TMR4  ========================================================== */
#define CTIMER_TMR4_CTTMRB4_Pos           (16UL)                    /*!< CTIMER TMR4: CTTMRB4 (Bit 16)                         */
#define CTIMER_TMR4_CTTMRB4_Msk           (0xffff0000UL)            /*!< CTIMER TMR4: CTTMRB4 (Bitfield-Mask: 0xffff)          */
#define CTIMER_TMR4_CTTMRA4_Pos           (0UL)                     /*!< CTIMER TMR4: CTTMRA4 (Bit 0)                          */
#define CTIMER_TMR4_CTTMRA4_Msk           (0xffffUL)                /*!< CTIMER TMR4: CTTMRA4 (Bitfield-Mask: 0xffff)          */
/* ========================================================  CMPRA4  ========================================================= */
#define CTIMER_CMPRA4_CMPR1A4_Pos         (16UL)                    /*!< CTIMER CMPRA4: CMPR1A4 (Bit 16)                       */
#define CTIMER_CMPRA4_CMPR1A4_Msk         (0xffff0000UL)            /*!< CTIMER CMPRA4: CMPR1A4 (Bitfield-Mask: 0xffff)        */
#define CTIMER_CMPRA4_CMPR0A4_Pos         (0UL)                     /*!< CTIMER CMPRA4: CMPR0A4 (Bit 0)                        */
#define CTIMER_CMPRA4_CMPR0A4_Msk         (0xffffUL)                /*!< CTIMER CMPRA4: CMPR0A4 (Bitfield-Mask: 0xffff)        */
/* ========================================================  CMPRB4  ========================================================= */
#define CTIMER_CMPRB4_CMPR1B4_Pos         (16UL)                    /*!< CTIMER CMPRB4: CMPR1B4 (Bit 16)                       */
#define CTIMER_CMPRB4_CMPR1B4_Msk         (0xffff0000UL)            /*!< CTIMER CMPRB4: CMPR1B4 (Bitfield-Mask: 0xffff)        */
#define CTIMER_CMPRB4_CMPR0B4_Pos         (0UL)                     /*!< CTIMER CMPRB4: CMPR0B4 (Bit 0)                        */
#define CTIMER_CMPRB4_CMPR0B4_Msk         (0xffffUL)                /*!< CTIMER CMPRB4: CMPR0B4 (Bitfield-Mask: 0xffff)        */
/* =========================================================  CTRL4  ========================================================= */
#define CTIMER_CTRL4_CTLINK4_Pos          (31UL)                    /*!< CTIMER CTRL4: CTLINK4 (Bit 31)                        */
#define CTIMER_CTRL4_CTLINK4_Msk          (0x80000000UL)            /*!< CTIMER CTRL4: CTLINK4 (Bitfield-Mask: 0x01)           */
#define CTIMER_CTRL4_TMRB4POL_Pos         (28UL)                    /*!< CTIMER CTRL4: TMRB4POL (Bit 28)                       */
#define CTIMER_CTRL4_TMRB4POL_Msk         (0x10000000UL)            /*!< CTIMER CTRL4: TMRB4POL (Bitfield-Mask: 0x01)          */
#define CTIMER_CTRL4_TMRB4CLR_Pos         (27UL)                    /*!< CTIMER CTRL4: TMRB4CLR (Bit 27)                       */
#define CTIMER_CTRL4_TMRB4CLR_Msk         (0x8000000UL)             /*!< CTIMER CTRL4: TMRB4CLR (Bitfield-Mask: 0x01)          */
#define CTIMER_CTRL4_TMRB4IE1_Pos         (26UL)                    /*!< CTIMER CTRL4: TMRB4IE1 (Bit 26)                       */
#define CTIMER_CTRL4_TMRB4IE1_Msk         (0x4000000UL)             /*!< CTIMER CTRL4: TMRB4IE1 (Bitfield-Mask: 0x01)          */
#define CTIMER_CTRL4_TMRB4IE0_Pos         (25UL)                    /*!< CTIMER CTRL4: TMRB4IE0 (Bit 25)                       */
#define CTIMER_CTRL4_TMRB4IE0_Msk         (0x2000000UL)             /*!< CTIMER CTRL4: TMRB4IE0 (Bitfield-Mask: 0x01)          */
#define CTIMER_CTRL4_TMRB4FN_Pos          (22UL)                    /*!< CTIMER CTRL4: TMRB4FN (Bit 22)                        */
#define CTIMER_CTRL4_TMRB4FN_Msk          (0x1c00000UL)             /*!< CTIMER CTRL4: TMRB4FN (Bitfield-Mask: 0x07)           */
#define CTIMER_CTRL4_TMRB4CLK_Pos         (17UL)                    /*!< CTIMER CTRL4: TMRB4CLK (Bit 17)                       */
#define CTIMER_CTRL4_TMRB4CLK_Msk         (0x3e0000UL)              /*!< CTIMER CTRL4: TMRB4CLK (Bitfield-Mask: 0x1f)          */
#define CTIMER_CTRL4_TMRB4EN_Pos          (16UL)                    /*!< CTIMER CTRL4: TMRB4EN (Bit 16)                        */
#define CTIMER_CTRL4_TMRB4EN_Msk          (0x10000UL)               /*!< CTIMER CTRL4: TMRB4EN (Bitfield-Mask: 0x01)           */
#define CTIMER_CTRL4_TMRA4POL_Pos         (12UL)                    /*!< CTIMER CTRL4: TMRA4POL (Bit 12)                       */
#define CTIMER_CTRL4_TMRA4POL_Msk         (0x1000UL)                /*!< CTIMER CTRL4: TMRA4POL (Bitfield-Mask: 0x01)          */
#define CTIMER_CTRL4_TMRA4CLR_Pos         (11UL)                    /*!< CTIMER CTRL4: TMRA4CLR (Bit 11)                       */
#define CTIMER_CTRL4_TMRA4CLR_Msk         (0x800UL)                 /*!< CTIMER CTRL4: TMRA4CLR (Bitfield-Mask: 0x01)          */
#define CTIMER_CTRL4_TMRA4IE1_Pos         (10UL)                    /*!< CTIMER CTRL4: TMRA4IE1 (Bit 10)                       */
#define CTIMER_CTRL4_TMRA4IE1_Msk         (0x400UL)                 /*!< CTIMER CTRL4: TMRA4IE1 (Bitfield-Mask: 0x01)          */
#define CTIMER_CTRL4_TMRA4IE0_Pos         (9UL)                     /*!< CTIMER CTRL4: TMRA4IE0 (Bit 9)                        */
#define CTIMER_CTRL4_TMRA4IE0_Msk         (0x200UL)                 /*!< CTIMER CTRL4: TMRA4IE0 (Bitfield-Mask: 0x01)          */
#define CTIMER_CTRL4_TMRA4FN_Pos          (6UL)                     /*!< CTIMER CTRL4: TMRA4FN (Bit 6)                         */
#define CTIMER_CTRL4_TMRA4FN_Msk          (0x1c0UL)                 /*!< CTIMER CTRL4: TMRA4FN (Bitfield-Mask: 0x07)           */
