sparkfun/Arduino_Apollo3/cores/arduino/am_sdk_ap3/CMSIS/AmbiqMicro/Include/apollo3c.h
#define GPIO_PADREGK_PAD42STRNG_Msk       (0x40000UL)               /*!< GPIO PADREGK: PAD42STRNG (Bitfield-Mask: 0x01)        */
#define GPIO_PADREGK_PAD42INPEN_Pos       (17UL)                    /*!< GPIO PADREGK: PAD42INPEN (Bit 17)                     */
#define GPIO_PADREGK_PAD42INPEN_Msk       (0x20000UL)               /*!< GPIO PADREGK: PAD42INPEN (Bitfield-Mask: 0x01)        */
#define GPIO_PADREGK_PAD42PULL_Pos        (16UL)                    /*!< GPIO PADREGK: PAD42PULL (Bit 16)                      */
#define GPIO_PADREGK_PAD42PULL_Msk        (0x10000UL)               /*!< GPIO PADREGK: PAD42PULL (Bitfield-Mask: 0x01)         */
#define GPIO_PADREGK_PAD41PWRDN_Pos       (15UL)                    /*!< GPIO PADREGK: PAD41PWRDN (Bit 15)                     */
#define GPIO_PADREGK_PAD41PWRDN_Msk       (0x8000UL)                /*!< GPIO PADREGK: PAD41PWRDN (Bitfield-Mask: 0x01)        */
#define GPIO_PADREGK_PAD41FNCSEL_Pos      (11UL)                    /*!< GPIO PADREGK: PAD41FNCSEL (Bit 11)                    */
#define GPIO_PADREGK_PAD41FNCSEL_Msk      (0x3800UL)                /*!< GPIO PADREGK: PAD41FNCSEL (Bitfield-Mask: 0x07)       */
#define GPIO_PADREGK_PAD41STRNG_Pos       (10UL)                    /*!< GPIO PADREGK: PAD41STRNG (Bit 10)                     */
#define GPIO_PADREGK_PAD41STRNG_Msk       (0x400UL)                 /*!< GPIO PADREGK: PAD41STRNG (Bitfield-Mask: 0x01)        */
#define GPIO_PADREGK_PAD41INPEN_Pos       (9UL)                     /*!< GPIO PADREGK: PAD41INPEN (Bit 9)                      */
#define GPIO_PADREGK_PAD41INPEN_Msk       (0x200UL)                 /*!< GPIO PADREGK: PAD41INPEN (Bitfield-Mask: 0x01)        */
#define GPIO_PADREGK_PAD41PULL_Pos        (8UL)                     /*!< GPIO PADREGK: PAD41PULL (Bit 8)                       */
#define GPIO_PADREGK_PAD41PULL_Msk        (0x100UL)                 /*!< GPIO PADREGK: PAD41PULL (Bitfield-Mask: 0x01)         */
#define GPIO_PADREGK_PAD40RSEL_Pos        (6UL)                     /*!< GPIO PADREGK: PAD40RSEL (Bit 6)                       */
#define GPIO_PADREGK_PAD40RSEL_Msk        (0xc0UL)                  /*!< GPIO PADREGK: PAD40RSEL (Bitfield-Mask: 0x03)         */
#define GPIO_PADREGK_PAD40FNCSEL_Pos      (3UL)                     /*!< GPIO PADREGK: PAD40FNCSEL (Bit 3)                     */
#define GPIO_PADREGK_PAD40FNCSEL_Msk      (0x38UL)                  /*!< GPIO PADREGK: PAD40FNCSEL (Bitfield-Mask: 0x07)       */
#define GPIO_PADREGK_PAD40STRNG_Pos       (2UL)                     /*!< GPIO PADREGK: PAD40STRNG (Bit 2)                      */
#define GPIO_PADREGK_PAD40STRNG_Msk       (0x4UL)                   /*!< GPIO PADREGK: PAD40STRNG (Bitfield-Mask: 0x01)        */
#define GPIO_PADREGK_PAD40INPEN_Pos       (1UL)                     /*!< GPIO PADREGK: PAD40INPEN (Bit 1)                      */
#define GPIO_PADREGK_PAD40INPEN_Msk       (0x2UL)                   /*!< GPIO PADREGK: PAD40INPEN (Bitfield-Mask: 0x01)        */
#define GPIO_PADREGK_PAD40PULL_Pos        (0UL)                     /*!< GPIO PADREGK: PAD40PULL (Bit 0)                       */
#define GPIO_PADREGK_PAD40PULL_Msk        (0x1UL)                   /*!< GPIO PADREGK: PAD40PULL (Bitfield-Mask: 0x01)         */
/* ========================================================  PADREGL  ======================================================== */
#define GPIO_PADREGL_PAD47FNCSEL_Pos      (27UL)                    /*!< GPIO PADREGL: PAD47FNCSEL (Bit 27)                    */
#define GPIO_PADREGL_PAD47FNCSEL_Msk      (0x38000000UL)            /*!< GPIO PADREGL: PAD47FNCSEL (Bitfield-Mask: 0x07)       */
#define GPIO_PADREGL_PAD47STRNG_Pos       (26UL)                    /*!< GPIO PADREGL: PAD47STRNG (Bit 26)                     */
#define GPIO_PADREGL_PAD47STRNG_Msk       (0x4000000UL)             /*!< GPIO PADREGL: PAD47STRNG (Bitfield-Mask: 0x01)        */
#define GPIO_PADREGL_PAD47INPEN_Pos       (25UL)                    /*!< GPIO PADREGL: PAD47INPEN (Bit 25)                     */
#define GPIO_PADREGL_PAD47INPEN_Msk       (0x2000000UL)             /*!< GPIO PADREGL: PAD47INPEN (Bitfield-Mask: 0x01)        */
#define GPIO_PADREGL_PAD47PULL_Pos        (24UL)                    /*!< GPIO PADREGL: PAD47PULL (Bit 24)                      */
#define GPIO_PADREGL_PAD47PULL_Msk        (0x1000000UL)             /*!< GPIO PADREGL: PAD47PULL (Bitfield-Mask: 0x01)         */
#define GPIO_PADREGL_PAD46FNCSEL_Pos      (19UL)                    /*!< GPIO PADREGL: PAD46FNCSEL (Bit 19)                    */
#define GPIO_PADREGL_PAD46FNCSEL_Msk      (0x380000UL)              /*!< GPIO PADREGL: PAD46FNCSEL (Bitfield-Mask: 0x07)       */
#define GPIO_PADREGL_PAD46STRNG_Pos       (18UL)                    /*!< GPIO PADREGL: PAD46STRNG (Bit 18)                     */
#define GPIO_PADREGL_PAD46STRNG_Msk       (0x40000UL)               /*!< GPIO PADREGL: PAD46STRNG (Bitfield-Mask: 0x01)        */
#define GPIO_PADREGL_PAD46INPEN_Pos       (17UL)                    /*!< GPIO PADREGL: PAD46INPEN (Bit 17)                     */
#define GPIO_PADREGL_PAD46INPEN_Msk       (0x20000UL)               /*!< GPIO PADREGL: PAD46INPEN (Bitfield-Mask: 0x01)        */
#define GPIO_PADREGL_PAD46PULL_Pos        (16UL)                    /*!< GPIO PADREGL: PAD46PULL (Bit 16)                      */
#define GPIO_PADREGL_PAD46PULL_Msk        (0x10000UL)               /*!< GPIO PADREGL: PAD46PULL (Bitfield-Mask: 0x01)         */
#define GPIO_PADREGL_PAD45FNCSEL_Pos      (11UL)                    /*!< GPIO PADREGL: PAD45FNCSEL (Bit 11)                    */
#define GPIO_PADREGL_PAD45FNCSEL_Msk      (0x3800UL)                /*!< GPIO PADREGL: PAD45FNCSEL (Bitfield-Mask: 0x07)       */
#define GPIO_PADREGL_PAD45STRNG_Pos       (10UL)                    /*!< GPIO PADREGL: PAD45STRNG (Bit 10)                     */
#define GPIO_PADREGL_PAD45STRNG_Msk       (0x400UL)                 /*!< GPIO PADREGL: PAD45STRNG (Bitfield-Mask: 0x01)        */
#define GPIO_PADREGL_PAD45INPEN_Pos       (9UL)                     /*!< GPIO PADREGL: PAD45INPEN (Bit 9)                      */
#define GPIO_PADREGL_PAD45INPEN_Msk       (0x200UL)                 /*!< GPIO PADREGL: PAD45INPEN (Bitfield-Mask: 0x01)        */
#define GPIO_PADREGL_PAD45PULL_Pos        (8UL)                     /*!< GPIO PADREGL: PAD45PULL (Bit 8)                       */
#define GPIO_PADREGL_PAD45PULL_Msk        (0x100UL)                 /*!< GPIO PADREGL: PAD45PULL (Bitfield-Mask: 0x01)         */
#define GPIO_PADREGL_PAD44FNCSEL_Pos      (3UL)                     /*!< GPIO PADREGL: PAD44FNCSEL (Bit 3)                     */
#define GPIO_PADREGL_PAD44FNCSEL_Msk      (0x38UL)                  /*!< GPIO PADREGL: PAD44FNCSEL (Bitfield-Mask: 0x07)       */
#define GPIO_PADREGL_PAD44STRNG_Pos       (2UL)                     /*!< GPIO PADREGL: PAD44STRNG (Bit 2)                      */
#define GPIO_PADREGL_PAD44STRNG_Msk       (0x4UL)                   /*!< GPIO PADREGL: PAD44STRNG (Bitfield-Mask: 0x01)        */
#define GPIO_PADREGL_PAD44INPEN_Pos       (1UL)                     /*!< GPIO PADREGL: PAD44INPEN (Bit 1)                      */
#define GPIO_PADREGL_PAD44INPEN_Msk       (0x2UL)                   /*!< GPIO PADREGL: PAD44INPEN (Bitfield-Mask: 0x01)        */
#define GPIO_PADREGL_PAD44PULL_Pos        (0UL)                     /*!< GPIO PADREGL: PAD44PULL (Bit 0)                       */
#define GPIO_PADREGL_PAD44PULL_Msk        (0x1UL)                   /*!< GPIO PADREGL: PAD44PULL (Bitfield-Mask: 0x01)         */
/* ========================================================  PADREGM  ======================================================== */
#define GPIO_PADREGM_PAD51FNCSEL_Pos      (27UL)                    /*!< GPIO PADREGM: PAD51FNCSEL (Bit 27)                    */
#define GPIO_PADREGM_PAD51FNCSEL_Msk      (0x38000000UL)            /*!< GPIO PADREGM: PAD51FNCSEL (Bitfield-Mask: 0x07)       */
#define GPIO_PADREGM_PAD51STRNG_Pos       (26UL)                    /*!< GPIO PADREGM: PAD51STRNG (Bit 26)                     */
#define GPIO_PADREGM_PAD51STRNG_Msk       (0x4000000UL)             /*!< GPIO PADREGM: PAD51STRNG (Bitfield-Mask: 0x01)        */
#define GPIO_PADREGM_PAD51INPEN_Pos       (25UL)                    /*!< GPIO PADREGM: PAD51INPEN (Bit 25)                     */
#define GPIO_PADREGM_PAD51INPEN_Msk       (0x2000000UL)             /*!< GPIO PADREGM: PAD51INPEN (Bitfield-Mask: 0x01)        */
#define GPIO_PADREGM_PAD51PULL_Pos        (24UL)                    /*!< GPIO PADREGM: PAD51PULL (Bit 24)                      */
#define GPIO_PADREGM_PAD51PULL_Msk        (0x1000000UL)             /*!< GPIO PADREGM: PAD51PULL (Bitfield-Mask: 0x01)         */
#define GPIO_PADREGM_PAD50FNCSEL_Pos      (19UL)                    /*!< GPIO PADREGM: PAD50FNCSEL (Bit 19)                    */
#define GPIO_PADREGM_PAD50FNCSEL_Msk      (0x380000UL)              /*!< GPIO PADREGM: PAD50FNCSEL (Bitfield-Mask: 0x07)       */
#define GPIO_PADREGM_PAD50STRNG_Pos       (18UL)                    /*!< GPIO PADREGM: PAD50STRNG (Bit 18)                     */
#define GPIO_PADREGM_PAD50STRNG_Msk       (0x40000UL)               /*!< GPIO PADREGM: PAD50STRNG (Bitfield-Mask: 0x01)        */
#define GPIO_PADREGM_PAD50INPEN_Pos       (17UL)                    /*!< GPIO PADREGM: PAD50INPEN (Bit 17)                     */
#define GPIO_PADREGM_PAD50INPEN_Msk       (0x20000UL)               /*!< GPIO PADREGM: PAD50INPEN (Bitfield-Mask: 0x01)        */
#define GPIO_PADREGM_PAD50PULL_Pos        (16UL)                    /*!< GPIO PADREGM: PAD50PULL (Bit 16)                      */
#define GPIO_PADREGM_PAD50PULL_Msk        (0x10000UL)               /*!< GPIO PADREGM: PAD50PULL (Bitfield-Mask: 0x01)         */
#define GPIO_PADREGM_PAD49RSEL_Pos        (14UL)                    /*!< GPIO PADREGM: PAD49RSEL (Bit 14)                      */
#define GPIO_PADREGM_PAD49RSEL_Msk        (0xc000UL)                /*!< GPIO PADREGM: PAD49RSEL (Bitfield-Mask: 0x03)         */
#define GPIO_PADREGM_PAD49FNCSEL_Pos      (11UL)                    /*!< GPIO PADREGM: PAD49FNCSEL (Bit 11)                    */
#define GPIO_PADREGM_PAD49FNCSEL_Msk      (0x3800UL)                /*!< GPIO PADREGM: PAD49FNCSEL (Bitfield-Mask: 0x07)       */
#define GPIO_PADREGM_PAD49STRNG_Pos       (10UL)                    /*!< GPIO PADREGM: PAD49STRNG (Bit 10)                     */
#define GPIO_PADREGM_PAD49STRNG_Msk       (0x400UL)                 /*!< GPIO PADREGM: PAD49STRNG (Bitfield-Mask: 0x01)        */
#define GPIO_PADREGM_PAD49INPEN_Pos       (9UL)                     /*!< GPIO PADREGM: PAD49INPEN (Bit 9)                      */
#define GPIO_PADREGM_PAD49INPEN_Msk       (0x200UL)                 /*!< GPIO PADREGM: PAD49INPEN (Bitfield-Mask: 0x01)        */
#define GPIO_PADREGM_PAD49PULL_Pos        (8UL)                     /*!< GPIO PADREGM: PAD49PULL (Bit 8)                       */
#define GPIO_PADREGM_PAD49PULL_Msk        (0x100UL)                 /*!< GPIO PADREGM: PAD49PULL (Bitfield-Mask: 0x01)         */
#define GPIO_PADREGM_PAD48RSEL_Pos        (6UL)                     /*!< GPIO PADREGM: PAD48RSEL (Bit 6)                       */
#define GPIO_PADREGM_PAD48RSEL_Msk        (0xc0UL)                  /*!< GPIO PADREGM: PAD48RSEL (Bitfield-Mask: 0x03)         */
#define GPIO_PADREGM_PAD48FNCSEL_Pos      (3UL)                     /*!< GPIO PADREGM: PAD48FNCSEL (Bit 3)                     */
#define GPIO_PADREGM_PAD48FNCSEL_Msk      (0x38UL)                  /*!< GPIO PADREGM: PAD48FNCSEL (Bitfield-Mask: 0x07)       */
#define GPIO_PADREGM_PAD48STRNG_Pos       (2UL)                     /*!< GPIO PADREGM: PAD48STRNG (Bit 2)                      */
#define GPIO_PADREGM_PAD48STRNG_Msk       (0x4UL)                   /*!< GPIO PADREGM: PAD48STRNG (Bitfield-Mask: 0x01)        */
#define GPIO_PADREGM_PAD48INPEN_Pos       (1UL)                     /*!< GPIO PADREGM: PAD48INPEN (Bit 1)                      */
#define GPIO_PADREGM_PAD48INPEN_Msk       (0x2UL)                   /*!< GPIO PADREGM: PAD48INPEN (Bitfield-Mask: 0x01)        */
#define GPIO_PADREGM_PAD48PULL_Pos        (0UL)                     /*!< GPIO PADREGM: PAD48PULL (Bit 0)                       */
#define GPIO_PADREGM_PAD48PULL_Msk        (0x1UL)                   /*!< GPIO PADREGM: PAD48PULL (Bitfield-Mask: 0x01)         */
/* ========================================================  PADREGN  ======================================================== */
#define GPIO_PADREGN_PAD55FNCSEL_Pos      (27UL)                    /*!< GPIO PADREGN: PAD55FNCSEL (Bit 27)                    */
#define GPIO_PADREGN_PAD55FNCSEL_Msk      (0x38000000UL)            /*!< GPIO PADREGN: PAD55FNCSEL (Bitfield-Mask: 0x07)       */
#define GPIO_PADREGN_PAD55STRNG_Pos       (26UL)                    /*!< GPIO PADREGN: PAD55STRNG (Bit 26)                     */
#define GPIO_PADREGN_PAD55STRNG_Msk       (0x4000000UL)             /*!< GPIO PADREGN: PAD55STRNG (Bitfield-Mask: 0x01)        */
#define GPIO_PADREGN_PAD55INPEN_Pos       (25UL)                    /*!< GPIO PADREGN: PAD55INPEN (Bit 25)                     */
#define GPIO_PADREGN_PAD55INPEN_Msk       (0x2000000UL)             /*!< GPIO PADREGN: PAD55INPEN (Bitfield-Mask: 0x01)        */
#define GPIO_PADREGN_PAD55PULL_Pos        (24UL)                    /*!< GPIO PADREGN: PAD55PULL (Bit 24)                      */
#define GPIO_PADREGN_PAD55PULL_Msk        (0x1000000UL)             /*!< GPIO PADREGN: PAD55PULL (Bitfield-Mask: 0x01)         */
#define GPIO_PADREGN_PAD54FNCSEL_Pos      (19UL)                    /*!< GPIO PADREGN: PAD54FNCSEL (Bit 19)                    */
#define GPIO_PADREGN_PAD54FNCSEL_Msk      (0x380000UL)              /*!< GPIO PADREGN: PAD54FNCSEL (Bitfield-Mask: 0x07)       */
#define GPIO_PADREGN_PAD54STRNG_Pos       (18UL)                    /*!< GPIO PADREGN: PAD54STRNG (Bit 18)                     */
#define GPIO_PADREGN_PAD54STRNG_Msk       (0x40000UL)               /*!< GPIO PADREGN: PAD54STRNG (Bitfield-Mask: 0x01)        */
#define GPIO_PADREGN_PAD54INPEN_Pos       (17UL)                    /*!< GPIO PADREGN: PAD54INPEN (Bit 17)                     */
#define GPIO_PADREGN_PAD54INPEN_Msk       (0x20000UL)               /*!< GPIO PADREGN: PAD54INPEN (Bitfield-Mask: 0x01)        */
#define GPIO_PADREGN_PAD54PULL_Pos        (16UL)                    /*!< GPIO PADREGN: PAD54PULL (Bit 16)                      */
#define GPIO_PADREGN_PAD54PULL_Msk        (0x10000UL)               /*!< GPIO PADREGN: PAD54PULL (Bitfield-Mask: 0x01)         */
#define GPIO_PADREGN_PAD53FNCSEL_Pos      (11UL)                    /*!< GPIO PADREGN: PAD53FNCSEL (Bit 11)                    */
#define GPIO_PADREGN_PAD53FNCSEL_Msk      (0x3800UL)                /*!< GPIO PADREGN: PAD53FNCSEL (Bitfield-Mask: 0x07)       */
#define GPIO_PADREGN_PAD53STRNG_Pos       (10UL)                    /*!< GPIO PADREGN: PAD53STRNG (Bit 10)                     */
#define GPIO_PADREGN_PAD53STRNG_Msk       (0x400UL)                 /*!< GPIO PADREGN: PAD53STRNG (Bitfield-Mask: 0x01)        */
#define GPIO_PADREGN_PAD53INPEN_Pos       (9UL)                     /*!< GPIO PADREGN: PAD53INPEN (Bit 9)                      */
#define GPIO_PADREGN_PAD53INPEN_Msk       (0x200UL)                 /*!< GPIO PADREGN: PAD53INPEN (Bitfield-Mask: 0x01)        */
#define GPIO_PADREGN_PAD53PULL_Pos        (8UL)                     /*!< GPIO PADREGN: PAD53PULL (Bit 8)                       */
#define GPIO_PADREGN_PAD53PULL_Msk        (0x100UL)                 /*!< GPIO PADREGN: PAD53PULL (Bitfield-Mask: 0x01)         */
#define GPIO_PADREGN_PAD52FNCSEL_Pos      (3UL)                     /*!< GPIO PADREGN: PAD52FNCSEL (Bit 3)                     */
#define GPIO_PADREGN_PAD52FNCSEL_Msk      (0x38UL)                  /*!< GPIO PADREGN: PAD52FNCSEL (Bitfield-Mask: 0x07)       */
#define GPIO_PADREGN_PAD52STRNG_Pos       (2UL)                     /*!< GPIO PADREGN: PAD52STRNG (Bit 2)                      */
#define GPIO_PADREGN_PAD52STRNG_Msk       (0x4UL)                   /*!< GPIO PADREGN: PAD52STRNG (Bitfield-Mask: 0x01)        */
#define GPIO_PADREGN_PAD52INPEN_Pos       (1UL)                     /*!< GPIO PADREGN: PAD52INPEN (Bit 1)                      */
#define GPIO_PADREGN_PAD52INPEN_Msk       (0x2UL)                   /*!< GPIO PADREGN: PAD52INPEN (Bitfield-Mask: 0x01)        */
#define GPIO_PADREGN_PAD52PULL_Pos        (0UL)                     /*!< GPIO PADREGN: PAD52PULL (Bit 0)                       */
#define GPIO_PADREGN_PAD52PULL_Msk        (0x1UL)                   /*!< GPIO PADREGN: PAD52PULL (Bitfield-Mask: 0x01)         */
/* ========================================================  PADREGO  ======================================================== */
#define GPIO_PADREGO_PAD59FNCSEL_Pos      (27UL)                    /*!< GPIO PADREGO: PAD59FNCSEL (Bit 27)                    */
#define GPIO_PADREGO_PAD59FNCSEL_Msk      (0x38000000UL)            /*!< GPIO PADREGO: PAD59FNCSEL (Bitfield-Mask: 0x07)       */
#define GPIO_PADREGO_PAD59STRNG_Pos       (26UL)                    /*!< GPIO PADREGO: PAD59STRNG (Bit 26)                     */
#define GPIO_PADREGO_PAD59STRNG_Msk       (0x4000000UL)             /*!< GPIO PADREGO: PAD59STRNG (Bitfield-Mask: 0x01)        */
#define GPIO_PADREGO_PAD59INPEN_Pos       (25UL)                    /*!< GPIO PADREGO: PAD59INPEN (Bit 25)                     */
#define GPIO_PADREGO_PAD59INPEN_Msk       (0x2000000UL)             /*!< GPIO PADREGO: PAD59INPEN (Bitfield-Mask: 0x01)        */
#define GPIO_PADREGO_PAD59PULL_Pos        (24UL)                    /*!< GPIO PADREGO: PAD59PULL (Bit 24)                      */
#define GPIO_PADREGO_PAD59PULL_Msk        (0x1000000UL)             /*!< GPIO PADREGO: PAD59PULL (Bitfield-Mask: 0x01)         */
#define GPIO_PADREGO_PAD58FNCSEL_Pos      (19UL)                    /*!< GPIO PADREGO: PAD58FNCSEL (Bit 19)                    */
#define GPIO_PADREGO_PAD58FNCSEL_Msk      (0x380000UL)              /*!< GPIO PADREGO: PAD58FNCSEL (Bitfield-Mask: 0x07)       */
#define GPIO_PADREGO_PAD58STRNG_Pos       (18UL)                    /*!< GPIO PADREGO: PAD58STRNG (Bit 18)                     */
#define GPIO_PADREGO_PAD58STRNG_Msk       (0x40000UL)               /*!< GPIO PADREGO: PAD58STRNG (Bitfield-Mask: 0x01)        */
#define GPIO_PADREGO_PAD58INPEN_Pos       (17UL)                    /*!< GPIO PADREGO: PAD58INPEN (Bit 17)                     */
#define GPIO_PADREGO_PAD58INPEN_Msk       (0x20000UL)               /*!< GPIO PADREGO: PAD58INPEN (Bitfield-Mask: 0x01)        */
#define GPIO_PADREGO_PAD58PULL_Pos        (16UL)                    /*!< GPIO PADREGO: PAD58PULL (Bit 16)                      */
#define GPIO_PADREGO_PAD58PULL_Msk        (0x10000UL)               /*!< GPIO PADREGO: PAD58PULL (Bitfield-Mask: 0x01)         */
#define GPIO_PADREGO_PAD57FNCSEL_Pos      (11UL)                    /*!< GPIO PADREGO: PAD57FNCSEL (Bit 11)                    */
#define GPIO_PADREGO_PAD57FNCSEL_Msk      (0x3800UL)                /*!< GPIO PADREGO: PAD57FNCSEL (Bitfield-Mask: 0x07)       */
#define GPIO_PADREGO_PAD57STRNG_Pos       (10UL)                    /*!< GPIO PADREGO: PAD57STRNG (Bit 10)                     */
#define GPIO_PADREGO_PAD57STRNG_Msk       (0x400UL)                 /*!< GPIO PADREGO: PAD57STRNG (Bitfield-Mask: 0x01)        */
#define GPIO_PADREGO_PAD57INPEN_Pos       (9UL)                     /*!< GPIO PADREGO: PAD57INPEN (Bit 9)                      */
#define GPIO_PADREGO_PAD57INPEN_Msk       (0x200UL)                 /*!< GPIO PADREGO: PAD57INPEN (Bitfield-Mask: 0x01)        */
#define GPIO_PADREGO_PAD57PULL_Pos        (8UL)                     /*!< GPIO PADREGO: PAD57PULL (Bit 8)                       */
#define GPIO_PADREGO_PAD57PULL_Msk        (0x100UL)                 /*!< GPIO PADREGO: PAD57PULL (Bitfield-Mask: 0x01)         */
#define GPIO_PADREGO_PAD56FNCSEL_Pos      (3UL)                     /*!< GPIO PADREGO: PAD56FNCSEL (Bit 3)                     */
#define GPIO_PADREGO_PAD56FNCSEL_Msk      (0x38UL)                  /*!< GPIO PADREGO: PAD56FNCSEL (Bitfield-Mask: 0x07)       */
#define GPIO_PADREGO_PAD56STRNG_Pos       (2UL)                     /*!< GPIO PADREGO: PAD56STRNG (Bit 2)                      */
#define GPIO_PADREGO_PAD56STRNG_Msk       (0x4UL)                   /*!< GPIO PADREGO: PAD56STRNG (Bitfield-Mask: 0x01)        */
#define GPIO_PADREGO_PAD56INPEN_Pos       (1UL)                     /*!< GPIO PADREGO: PAD56INPEN (Bit 1)                      */
#define GPIO_PADREGO_PAD56INPEN_Msk       (0x2UL)                   /*!< GPIO PADREGO: PAD56INPEN (Bitfield-Mask: 0x01)        */
#define GPIO_PADREGO_PAD56PULL_Pos        (0UL)                     /*!< GPIO PADREGO: PAD56PULL (Bit 0)                       */
#define GPIO_PADREGO_PAD56PULL_Msk        (0x1UL)                   /*!< GPIO PADREGO: PAD56PULL (Bitfield-Mask: 0x01)         */
/* ========================================================  PADREGP  ======================================================== */
#define GPIO_PADREGP_PAD63FNCSEL_Pos      (27UL)                    /*!< GPIO PADREGP: PAD63FNCSEL (Bit 27)                    */
#define GPIO_PADREGP_PAD63FNCSEL_Msk      (0x38000000UL)            /*!< GPIO PADREGP: PAD63FNCSEL (Bitfield-Mask: 0x07)       */
#define GPIO_PADREGP_PAD63STRNG_Pos       (26UL)                    /*!< GPIO PADREGP: PAD63STRNG (Bit 26)                     */
#define GPIO_PADREGP_PAD63STRNG_Msk       (0x4000000UL)             /*!< GPIO PADREGP: PAD63STRNG (Bitfield-Mask: 0x01)        */
#define GPIO_PADREGP_PAD63INPEN_Pos       (25UL)                    /*!< GPIO PADREGP: PAD63INPEN (Bit 25)                     */
#define GPIO_PADREGP_PAD63INPEN_Msk       (0x2000000UL)             /*!< GPIO PADREGP: PAD63INPEN (Bitfield-Mask: 0x01)        */
#define GPIO_PADREGP_PAD63PULL_Pos        (24UL)                    /*!< GPIO PADREGP: PAD63PULL (Bit 24)                      */
#define GPIO_PADREGP_PAD63PULL_Msk        (0x1000000UL)             /*!< GPIO PADREGP: PAD63PULL (Bitfield-Mask: 0x01)         */
#define GPIO_PADREGP_PAD62FNCSEL_Pos      (19UL)                    /*!< GPIO PADREGP: PAD62FNCSEL (Bit 19)                    */
#define GPIO_PADREGP_PAD62FNCSEL_Msk      (0x380000UL)              /*!< GPIO PADREGP: PAD62FNCSEL (Bitfield-Mask: 0x07)       */
#define GPIO_PADREGP_PAD62STRNG_Pos       (18UL)                    /*!< GPIO PADREGP: PAD62STRNG (Bit 18)                     */
#define GPIO_PADREGP_PAD62STRNG_Msk       (0x40000UL)               /*!< GPIO PADREGP: PAD62STRNG (Bitfield-Mask: 0x01)        */
#define GPIO_PADREGP_PAD62INPEN_Pos       (17UL)                    /*!< GPIO PADREGP: PAD62INPEN (Bit 17)                     */
#define GPIO_PADREGP_PAD62INPEN_Msk       (0x20000UL)               /*!< GPIO PADREGP: PAD62INPEN (Bitfield-Mask: 0x01)        */
#define GPIO_PADREGP_PAD62PULL_Pos        (16UL)                    /*!< GPIO PADREGP: PAD62PULL (Bit 16)                      */
#define GPIO_PADREGP_PAD62PULL_Msk        (0x10000UL)               /*!< GPIO PADREGP: PAD62PULL (Bitfield-Mask: 0x01)         */
#define GPIO_PADREGP_PAD61FNCSEL_Pos      (11UL)                    /*!< GPIO PADREGP: PAD61FNCSEL (Bit 11)                    */
#define GPIO_PADREGP_PAD61FNCSEL_Msk      (0x3800UL)                /*!< GPIO PADREGP: PAD61FNCSEL (Bitfield-Mask: 0x07)       */
#define GPIO_PADREGP_PAD61STRNG_Pos       (10UL)                    /*!< GPIO PADREGP: PAD61STRNG (Bit 10)                     */
#define GPIO_PADREGP_PAD61STRNG_Msk       (0x400UL)                 /*!< GPIO PADREGP: PAD61STRNG (Bitfield-Mask: 0x01)        */
#define GPIO_PADREGP_PAD61INPEN_Pos       (9UL)                     /*!< GPIO PADREGP: PAD61INPEN (Bit 9)                      */
#define GPIO_PADREGP_PAD61INPEN_Msk       (0x200UL)                 /*!< GPIO PADREGP: PAD61INPEN (Bitfield-Mask: 0x01)        */
