sparkfun/Arduino_Apollo3/cores/arduino/am_sdk_ap3/CMSIS/AmbiqMicro/Include/apollo3c.h
#define GPIO_PADREGP_PAD61PULL_Pos        (8UL)                     /*!< GPIO PADREGP: PAD61PULL (Bit 8)                       */
#define GPIO_PADREGP_PAD61PULL_Msk        (0x100UL)                 /*!< GPIO PADREGP: PAD61PULL (Bitfield-Mask: 0x01)         */
#define GPIO_PADREGP_PAD60FNCSEL_Pos      (3UL)                     /*!< GPIO PADREGP: PAD60FNCSEL (Bit 3)                     */
#define GPIO_PADREGP_PAD60FNCSEL_Msk      (0x38UL)                  /*!< GPIO PADREGP: PAD60FNCSEL (Bitfield-Mask: 0x07)       */
#define GPIO_PADREGP_PAD60STRNG_Pos       (2UL)                     /*!< GPIO PADREGP: PAD60STRNG (Bit 2)                      */
#define GPIO_PADREGP_PAD60STRNG_Msk       (0x4UL)                   /*!< GPIO PADREGP: PAD60STRNG (Bitfield-Mask: 0x01)        */
#define GPIO_PADREGP_PAD60INPEN_Pos       (1UL)                     /*!< GPIO PADREGP: PAD60INPEN (Bit 1)                      */
#define GPIO_PADREGP_PAD60INPEN_Msk       (0x2UL)                   /*!< GPIO PADREGP: PAD60INPEN (Bitfield-Mask: 0x01)        */
#define GPIO_PADREGP_PAD60PULL_Pos        (0UL)                     /*!< GPIO PADREGP: PAD60PULL (Bit 0)                       */
#define GPIO_PADREGP_PAD60PULL_Msk        (0x1UL)                   /*!< GPIO PADREGP: PAD60PULL (Bitfield-Mask: 0x01)         */
/* ========================================================  PADREGQ  ======================================================== */
#define GPIO_PADREGQ_PAD67FNCSEL_Pos      (27UL)                    /*!< GPIO PADREGQ: PAD67FNCSEL (Bit 27)                    */
#define GPIO_PADREGQ_PAD67FNCSEL_Msk      (0x38000000UL)            /*!< GPIO PADREGQ: PAD67FNCSEL (Bitfield-Mask: 0x07)       */
#define GPIO_PADREGQ_PAD67STRNG_Pos       (26UL)                    /*!< GPIO PADREGQ: PAD67STRNG (Bit 26)                     */
#define GPIO_PADREGQ_PAD67STRNG_Msk       (0x4000000UL)             /*!< GPIO PADREGQ: PAD67STRNG (Bitfield-Mask: 0x01)        */
#define GPIO_PADREGQ_PAD67INPEN_Pos       (25UL)                    /*!< GPIO PADREGQ: PAD67INPEN (Bit 25)                     */
#define GPIO_PADREGQ_PAD67INPEN_Msk       (0x2000000UL)             /*!< GPIO PADREGQ: PAD67INPEN (Bitfield-Mask: 0x01)        */
#define GPIO_PADREGQ_PAD67PULL_Pos        (24UL)                    /*!< GPIO PADREGQ: PAD67PULL (Bit 24)                      */
#define GPIO_PADREGQ_PAD67PULL_Msk        (0x1000000UL)             /*!< GPIO PADREGQ: PAD67PULL (Bitfield-Mask: 0x01)         */
#define GPIO_PADREGQ_PAD66FNCSEL_Pos      (19UL)                    /*!< GPIO PADREGQ: PAD66FNCSEL (Bit 19)                    */
#define GPIO_PADREGQ_PAD66FNCSEL_Msk      (0x380000UL)              /*!< GPIO PADREGQ: PAD66FNCSEL (Bitfield-Mask: 0x07)       */
#define GPIO_PADREGQ_PAD66STRNG_Pos       (18UL)                    /*!< GPIO PADREGQ: PAD66STRNG (Bit 18)                     */
#define GPIO_PADREGQ_PAD66STRNG_Msk       (0x40000UL)               /*!< GPIO PADREGQ: PAD66STRNG (Bitfield-Mask: 0x01)        */
#define GPIO_PADREGQ_PAD66INPEN_Pos       (17UL)                    /*!< GPIO PADREGQ: PAD66INPEN (Bit 17)                     */
#define GPIO_PADREGQ_PAD66INPEN_Msk       (0x20000UL)               /*!< GPIO PADREGQ: PAD66INPEN (Bitfield-Mask: 0x01)        */
#define GPIO_PADREGQ_PAD66PULL_Pos        (16UL)                    /*!< GPIO PADREGQ: PAD66PULL (Bit 16)                      */
#define GPIO_PADREGQ_PAD66PULL_Msk        (0x10000UL)               /*!< GPIO PADREGQ: PAD66PULL (Bitfield-Mask: 0x01)         */
#define GPIO_PADREGQ_PAD65FNCSEL_Pos      (11UL)                    /*!< GPIO PADREGQ: PAD65FNCSEL (Bit 11)                    */
#define GPIO_PADREGQ_PAD65FNCSEL_Msk      (0x3800UL)                /*!< GPIO PADREGQ: PAD65FNCSEL (Bitfield-Mask: 0x07)       */
#define GPIO_PADREGQ_PAD65STRNG_Pos       (10UL)                    /*!< GPIO PADREGQ: PAD65STRNG (Bit 10)                     */
#define GPIO_PADREGQ_PAD65STRNG_Msk       (0x400UL)                 /*!< GPIO PADREGQ: PAD65STRNG (Bitfield-Mask: 0x01)        */
#define GPIO_PADREGQ_PAD65INPEN_Pos       (9UL)                     /*!< GPIO PADREGQ: PAD65INPEN (Bit 9)                      */
#define GPIO_PADREGQ_PAD65INPEN_Msk       (0x200UL)                 /*!< GPIO PADREGQ: PAD65INPEN (Bitfield-Mask: 0x01)        */
#define GPIO_PADREGQ_PAD65PULL_Pos        (8UL)                     /*!< GPIO PADREGQ: PAD65PULL (Bit 8)                       */
#define GPIO_PADREGQ_PAD65PULL_Msk        (0x100UL)                 /*!< GPIO PADREGQ: PAD65PULL (Bitfield-Mask: 0x01)         */
#define GPIO_PADREGQ_PAD64FNCSEL_Pos      (3UL)                     /*!< GPIO PADREGQ: PAD64FNCSEL (Bit 3)                     */
#define GPIO_PADREGQ_PAD64FNCSEL_Msk      (0x38UL)                  /*!< GPIO PADREGQ: PAD64FNCSEL (Bitfield-Mask: 0x07)       */
#define GPIO_PADREGQ_PAD64STRNG_Pos       (2UL)                     /*!< GPIO PADREGQ: PAD64STRNG (Bit 2)                      */
#define GPIO_PADREGQ_PAD64STRNG_Msk       (0x4UL)                   /*!< GPIO PADREGQ: PAD64STRNG (Bitfield-Mask: 0x01)        */
#define GPIO_PADREGQ_PAD64INPEN_Pos       (1UL)                     /*!< GPIO PADREGQ: PAD64INPEN (Bit 1)                      */
#define GPIO_PADREGQ_PAD64INPEN_Msk       (0x2UL)                   /*!< GPIO PADREGQ: PAD64INPEN (Bitfield-Mask: 0x01)        */
#define GPIO_PADREGQ_PAD64PULL_Pos        (0UL)                     /*!< GPIO PADREGQ: PAD64PULL (Bit 0)                       */
#define GPIO_PADREGQ_PAD64PULL_Msk        (0x1UL)                   /*!< GPIO PADREGQ: PAD64PULL (Bitfield-Mask: 0x01)         */
/* ========================================================  PADREGR  ======================================================== */
#define GPIO_PADREGR_PAD71FNCSEL_Pos      (27UL)                    /*!< GPIO PADREGR: PAD71FNCSEL (Bit 27)                    */
#define GPIO_PADREGR_PAD71FNCSEL_Msk      (0x38000000UL)            /*!< GPIO PADREGR: PAD71FNCSEL (Bitfield-Mask: 0x07)       */
#define GPIO_PADREGR_PAD71STRNG_Pos       (26UL)                    /*!< GPIO PADREGR: PAD71STRNG (Bit 26)                     */
#define GPIO_PADREGR_PAD71STRNG_Msk       (0x4000000UL)             /*!< GPIO PADREGR: PAD71STRNG (Bitfield-Mask: 0x01)        */
#define GPIO_PADREGR_PAD71INPEN_Pos       (25UL)                    /*!< GPIO PADREGR: PAD71INPEN (Bit 25)                     */
#define GPIO_PADREGR_PAD71INPEN_Msk       (0x2000000UL)             /*!< GPIO PADREGR: PAD71INPEN (Bitfield-Mask: 0x01)        */
#define GPIO_PADREGR_PAD71PULL_Pos        (24UL)                    /*!< GPIO PADREGR: PAD71PULL (Bit 24)                      */
#define GPIO_PADREGR_PAD71PULL_Msk        (0x1000000UL)             /*!< GPIO PADREGR: PAD71PULL (Bitfield-Mask: 0x01)         */
#define GPIO_PADREGR_PAD70FNCSEL_Pos      (19UL)                    /*!< GPIO PADREGR: PAD70FNCSEL (Bit 19)                    */
#define GPIO_PADREGR_PAD70FNCSEL_Msk      (0x380000UL)              /*!< GPIO PADREGR: PAD70FNCSEL (Bitfield-Mask: 0x07)       */
#define GPIO_PADREGR_PAD70STRNG_Pos       (18UL)                    /*!< GPIO PADREGR: PAD70STRNG (Bit 18)                     */
#define GPIO_PADREGR_PAD70STRNG_Msk       (0x40000UL)               /*!< GPIO PADREGR: PAD70STRNG (Bitfield-Mask: 0x01)        */
#define GPIO_PADREGR_PAD70INPEN_Pos       (17UL)                    /*!< GPIO PADREGR: PAD70INPEN (Bit 17)                     */
#define GPIO_PADREGR_PAD70INPEN_Msk       (0x20000UL)               /*!< GPIO PADREGR: PAD70INPEN (Bitfield-Mask: 0x01)        */
#define GPIO_PADREGR_PAD70PULL_Pos        (16UL)                    /*!< GPIO PADREGR: PAD70PULL (Bit 16)                      */
#define GPIO_PADREGR_PAD70PULL_Msk        (0x10000UL)               /*!< GPIO PADREGR: PAD70PULL (Bitfield-Mask: 0x01)         */
#define GPIO_PADREGR_PAD69FNCSEL_Pos      (11UL)                    /*!< GPIO PADREGR: PAD69FNCSEL (Bit 11)                    */
#define GPIO_PADREGR_PAD69FNCSEL_Msk      (0x3800UL)                /*!< GPIO PADREGR: PAD69FNCSEL (Bitfield-Mask: 0x07)       */
#define GPIO_PADREGR_PAD69STRNG_Pos       (10UL)                    /*!< GPIO PADREGR: PAD69STRNG (Bit 10)                     */
#define GPIO_PADREGR_PAD69STRNG_Msk       (0x400UL)                 /*!< GPIO PADREGR: PAD69STRNG (Bitfield-Mask: 0x01)        */
#define GPIO_PADREGR_PAD69INPEN_Pos       (9UL)                     /*!< GPIO PADREGR: PAD69INPEN (Bit 9)                      */
#define GPIO_PADREGR_PAD69INPEN_Msk       (0x200UL)                 /*!< GPIO PADREGR: PAD69INPEN (Bitfield-Mask: 0x01)        */
#define GPIO_PADREGR_PAD69PULL_Pos        (8UL)                     /*!< GPIO PADREGR: PAD69PULL (Bit 8)                       */
#define GPIO_PADREGR_PAD69PULL_Msk        (0x100UL)                 /*!< GPIO PADREGR: PAD69PULL (Bitfield-Mask: 0x01)         */
#define GPIO_PADREGR_PAD68FNCSEL_Pos      (3UL)                     /*!< GPIO PADREGR: PAD68FNCSEL (Bit 3)                     */
#define GPIO_PADREGR_PAD68FNCSEL_Msk      (0x38UL)                  /*!< GPIO PADREGR: PAD68FNCSEL (Bitfield-Mask: 0x07)       */
#define GPIO_PADREGR_PAD68STRNG_Pos       (2UL)                     /*!< GPIO PADREGR: PAD68STRNG (Bit 2)                      */
#define GPIO_PADREGR_PAD68STRNG_Msk       (0x4UL)                   /*!< GPIO PADREGR: PAD68STRNG (Bitfield-Mask: 0x01)        */
#define GPIO_PADREGR_PAD68INPEN_Pos       (1UL)                     /*!< GPIO PADREGR: PAD68INPEN (Bit 1)                      */
#define GPIO_PADREGR_PAD68INPEN_Msk       (0x2UL)                   /*!< GPIO PADREGR: PAD68INPEN (Bitfield-Mask: 0x01)        */
#define GPIO_PADREGR_PAD68PULL_Pos        (0UL)                     /*!< GPIO PADREGR: PAD68PULL (Bit 0)                       */
#define GPIO_PADREGR_PAD68PULL_Msk        (0x1UL)                   /*!< GPIO PADREGR: PAD68PULL (Bitfield-Mask: 0x01)         */
/* ========================================================  PADREGS  ======================================================== */
#define GPIO_PADREGS_PAD73FNCSEL_Pos      (11UL)                    /*!< GPIO PADREGS: PAD73FNCSEL (Bit 11)                    */
#define GPIO_PADREGS_PAD73FNCSEL_Msk      (0x3800UL)                /*!< GPIO PADREGS: PAD73FNCSEL (Bitfield-Mask: 0x07)       */
#define GPIO_PADREGS_PAD73STRNG_Pos       (10UL)                    /*!< GPIO PADREGS: PAD73STRNG (Bit 10)                     */
#define GPIO_PADREGS_PAD73STRNG_Msk       (0x400UL)                 /*!< GPIO PADREGS: PAD73STRNG (Bitfield-Mask: 0x01)        */
#define GPIO_PADREGS_PAD73INPEN_Pos       (9UL)                     /*!< GPIO PADREGS: PAD73INPEN (Bit 9)                      */
#define GPIO_PADREGS_PAD73INPEN_Msk       (0x200UL)                 /*!< GPIO PADREGS: PAD73INPEN (Bitfield-Mask: 0x01)        */
#define GPIO_PADREGS_PAD73PULL_Pos        (8UL)                     /*!< GPIO PADREGS: PAD73PULL (Bit 8)                       */
#define GPIO_PADREGS_PAD73PULL_Msk        (0x100UL)                 /*!< GPIO PADREGS: PAD73PULL (Bitfield-Mask: 0x01)         */
#define GPIO_PADREGS_PAD72FNCSEL_Pos      (3UL)                     /*!< GPIO PADREGS: PAD72FNCSEL (Bit 3)                     */
#define GPIO_PADREGS_PAD72FNCSEL_Msk      (0x38UL)                  /*!< GPIO PADREGS: PAD72FNCSEL (Bitfield-Mask: 0x07)       */
#define GPIO_PADREGS_PAD72STRNG_Pos       (2UL)                     /*!< GPIO PADREGS: PAD72STRNG (Bit 2)                      */
#define GPIO_PADREGS_PAD72STRNG_Msk       (0x4UL)                   /*!< GPIO PADREGS: PAD72STRNG (Bitfield-Mask: 0x01)        */
#define GPIO_PADREGS_PAD72INPEN_Pos       (1UL)                     /*!< GPIO PADREGS: PAD72INPEN (Bit 1)                      */
#define GPIO_PADREGS_PAD72INPEN_Msk       (0x2UL)                   /*!< GPIO PADREGS: PAD72INPEN (Bitfield-Mask: 0x01)        */
#define GPIO_PADREGS_PAD72PULL_Pos        (0UL)                     /*!< GPIO PADREGS: PAD72PULL (Bit 0)                       */
#define GPIO_PADREGS_PAD72PULL_Msk        (0x1UL)                   /*!< GPIO PADREGS: PAD72PULL (Bitfield-Mask: 0x01)         */
/* =========================================================  CFGA  ========================================================== */
#define GPIO_CFGA_GPIO7INTD_Pos           (31UL)                    /*!< GPIO CFGA: GPIO7INTD (Bit 31)                         */
#define GPIO_CFGA_GPIO7INTD_Msk           (0x80000000UL)            /*!< GPIO CFGA: GPIO7INTD (Bitfield-Mask: 0x01)            */
#define GPIO_CFGA_GPIO7OUTCFG_Pos         (29UL)                    /*!< GPIO CFGA: GPIO7OUTCFG (Bit 29)                       */
#define GPIO_CFGA_GPIO7OUTCFG_Msk         (0x60000000UL)            /*!< GPIO CFGA: GPIO7OUTCFG (Bitfield-Mask: 0x03)          */
#define GPIO_CFGA_GPIO7INCFG_Pos          (28UL)                    /*!< GPIO CFGA: GPIO7INCFG (Bit 28)                        */
#define GPIO_CFGA_GPIO7INCFG_Msk          (0x10000000UL)            /*!< GPIO CFGA: GPIO7INCFG (Bitfield-Mask: 0x01)           */
#define GPIO_CFGA_GPIO6INTD_Pos           (27UL)                    /*!< GPIO CFGA: GPIO6INTD (Bit 27)                         */
#define GPIO_CFGA_GPIO6INTD_Msk           (0x8000000UL)             /*!< GPIO CFGA: GPIO6INTD (Bitfield-Mask: 0x01)            */
#define GPIO_CFGA_GPIO6OUTCFG_Pos         (25UL)                    /*!< GPIO CFGA: GPIO6OUTCFG (Bit 25)                       */
#define GPIO_CFGA_GPIO6OUTCFG_Msk         (0x6000000UL)             /*!< GPIO CFGA: GPIO6OUTCFG (Bitfield-Mask: 0x03)          */
#define GPIO_CFGA_GPIO6INCFG_Pos          (24UL)                    /*!< GPIO CFGA: GPIO6INCFG (Bit 24)                        */
#define GPIO_CFGA_GPIO6INCFG_Msk          (0x1000000UL)             /*!< GPIO CFGA: GPIO6INCFG (Bitfield-Mask: 0x01)           */
#define GPIO_CFGA_GPIO5INTD_Pos           (23UL)                    /*!< GPIO CFGA: GPIO5INTD (Bit 23)                         */
#define GPIO_CFGA_GPIO5INTD_Msk           (0x800000UL)              /*!< GPIO CFGA: GPIO5INTD (Bitfield-Mask: 0x01)            */
#define GPIO_CFGA_GPIO5OUTCFG_Pos         (21UL)                    /*!< GPIO CFGA: GPIO5OUTCFG (Bit 21)                       */
#define GPIO_CFGA_GPIO5OUTCFG_Msk         (0x600000UL)              /*!< GPIO CFGA: GPIO5OUTCFG (Bitfield-Mask: 0x03)          */
#define GPIO_CFGA_GPIO5INCFG_Pos          (20UL)                    /*!< GPIO CFGA: GPIO5INCFG (Bit 20)                        */
#define GPIO_CFGA_GPIO5INCFG_Msk          (0x100000UL)              /*!< GPIO CFGA: GPIO5INCFG (Bitfield-Mask: 0x01)           */
#define GPIO_CFGA_GPIO4INTD_Pos           (19UL)                    /*!< GPIO CFGA: GPIO4INTD (Bit 19)                         */
#define GPIO_CFGA_GPIO4INTD_Msk           (0x80000UL)               /*!< GPIO CFGA: GPIO4INTD (Bitfield-Mask: 0x01)            */
#define GPIO_CFGA_GPIO4OUTCFG_Pos         (17UL)                    /*!< GPIO CFGA: GPIO4OUTCFG (Bit 17)                       */
#define GPIO_CFGA_GPIO4OUTCFG_Msk         (0x60000UL)               /*!< GPIO CFGA: GPIO4OUTCFG (Bitfield-Mask: 0x03)          */
#define GPIO_CFGA_GPIO4INCFG_Pos          (16UL)                    /*!< GPIO CFGA: GPIO4INCFG (Bit 16)                        */
#define GPIO_CFGA_GPIO4INCFG_Msk          (0x10000UL)               /*!< GPIO CFGA: GPIO4INCFG (Bitfield-Mask: 0x01)           */
#define GPIO_CFGA_GPIO3INTD_Pos           (15UL)                    /*!< GPIO CFGA: GPIO3INTD (Bit 15)                         */
#define GPIO_CFGA_GPIO3INTD_Msk           (0x8000UL)                /*!< GPIO CFGA: GPIO3INTD (Bitfield-Mask: 0x01)            */
#define GPIO_CFGA_GPIO3OUTCFG_Pos         (13UL)                    /*!< GPIO CFGA: GPIO3OUTCFG (Bit 13)                       */
#define GPIO_CFGA_GPIO3OUTCFG_Msk         (0x6000UL)                /*!< GPIO CFGA: GPIO3OUTCFG (Bitfield-Mask: 0x03)          */
#define GPIO_CFGA_GPIO3INCFG_Pos          (12UL)                    /*!< GPIO CFGA: GPIO3INCFG (Bit 12)                        */
#define GPIO_CFGA_GPIO3INCFG_Msk          (0x1000UL)                /*!< GPIO CFGA: GPIO3INCFG (Bitfield-Mask: 0x01)           */
#define GPIO_CFGA_GPIO2INTD_Pos           (11UL)                    /*!< GPIO CFGA: GPIO2INTD (Bit 11)                         */
#define GPIO_CFGA_GPIO2INTD_Msk           (0x800UL)                 /*!< GPIO CFGA: GPIO2INTD (Bitfield-Mask: 0x01)            */
#define GPIO_CFGA_GPIO2OUTCFG_Pos         (9UL)                     /*!< GPIO CFGA: GPIO2OUTCFG (Bit 9)                        */
#define GPIO_CFGA_GPIO2OUTCFG_Msk         (0x600UL)                 /*!< GPIO CFGA: GPIO2OUTCFG (Bitfield-Mask: 0x03)          */
#define GPIO_CFGA_GPIO2INCFG_Pos          (8UL)                     /*!< GPIO CFGA: GPIO2INCFG (Bit 8)                         */
#define GPIO_CFGA_GPIO2INCFG_Msk          (0x100UL)                 /*!< GPIO CFGA: GPIO2INCFG (Bitfield-Mask: 0x01)           */
#define GPIO_CFGA_GPIO1INTD_Pos           (7UL)                     /*!< GPIO CFGA: GPIO1INTD (Bit 7)                          */
#define GPIO_CFGA_GPIO1INTD_Msk           (0x80UL)                  /*!< GPIO CFGA: GPIO1INTD (Bitfield-Mask: 0x01)            */
#define GPIO_CFGA_GPIO1OUTCFG_Pos         (5UL)                     /*!< GPIO CFGA: GPIO1OUTCFG (Bit 5)                        */
#define GPIO_CFGA_GPIO1OUTCFG_Msk         (0x60UL)                  /*!< GPIO CFGA: GPIO1OUTCFG (Bitfield-Mask: 0x03)          */
#define GPIO_CFGA_GPIO1INCFG_Pos          (4UL)                     /*!< GPIO CFGA: GPIO1INCFG (Bit 4)                         */
#define GPIO_CFGA_GPIO1INCFG_Msk          (0x10UL)                  /*!< GPIO CFGA: GPIO1INCFG (Bitfield-Mask: 0x01)           */
#define GPIO_CFGA_GPIO0INTD_Pos           (3UL)                     /*!< GPIO CFGA: GPIO0INTD (Bit 3)                          */
#define GPIO_CFGA_GPIO0INTD_Msk           (0x8UL)                   /*!< GPIO CFGA: GPIO0INTD (Bitfield-Mask: 0x01)            */
#define GPIO_CFGA_GPIO0OUTCFG_Pos         (1UL)                     /*!< GPIO CFGA: GPIO0OUTCFG (Bit 1)                        */
#define GPIO_CFGA_GPIO0OUTCFG_Msk         (0x6UL)                   /*!< GPIO CFGA: GPIO0OUTCFG (Bitfield-Mask: 0x03)          */
#define GPIO_CFGA_GPIO0INCFG_Pos          (0UL)                     /*!< GPIO CFGA: GPIO0INCFG (Bit 0)                         */
#define GPIO_CFGA_GPIO0INCFG_Msk          (0x1UL)                   /*!< GPIO CFGA: GPIO0INCFG (Bitfield-Mask: 0x01)           */
/* =========================================================  CFGB  ========================================================== */
#define GPIO_CFGB_GPIO15INTD_Pos          (31UL)                    /*!< GPIO CFGB: GPIO15INTD (Bit 31)                        */
#define GPIO_CFGB_GPIO15INTD_Msk          (0x80000000UL)            /*!< GPIO CFGB: GPIO15INTD (Bitfield-Mask: 0x01)           */
#define GPIO_CFGB_GPIO15OUTCFG_Pos        (29UL)                    /*!< GPIO CFGB: GPIO15OUTCFG (Bit 29)                      */
#define GPIO_CFGB_GPIO15OUTCFG_Msk        (0x60000000UL)            /*!< GPIO CFGB: GPIO15OUTCFG (Bitfield-Mask: 0x03)         */
#define GPIO_CFGB_GPIO15INCFG_Pos         (28UL)                    /*!< GPIO CFGB: GPIO15INCFG (Bit 28)                       */
#define GPIO_CFGB_GPIO15INCFG_Msk         (0x10000000UL)            /*!< GPIO CFGB: GPIO15INCFG (Bitfield-Mask: 0x01)          */
#define GPIO_CFGB_GPIO14INTD_Pos          (27UL)                    /*!< GPIO CFGB: GPIO14INTD (Bit 27)                        */
#define GPIO_CFGB_GPIO14INTD_Msk          (0x8000000UL)             /*!< GPIO CFGB: GPIO14INTD (Bitfield-Mask: 0x01)           */
#define GPIO_CFGB_GPIO14OUTCFG_Pos        (25UL)                    /*!< GPIO CFGB: GPIO14OUTCFG (Bit 25)                      */
#define GPIO_CFGB_GPIO14OUTCFG_Msk        (0x6000000UL)             /*!< GPIO CFGB: GPIO14OUTCFG (Bitfield-Mask: 0x03)         */
#define GPIO_CFGB_GPIO14INCFG_Pos         (24UL)                    /*!< GPIO CFGB: GPIO14INCFG (Bit 24)                       */
#define GPIO_CFGB_GPIO14INCFG_Msk         (0x1000000UL)             /*!< GPIO CFGB: GPIO14INCFG (Bitfield-Mask: 0x01)          */
#define GPIO_CFGB_GPIO13INTD_Pos          (23UL)                    /*!< GPIO CFGB: GPIO13INTD (Bit 23)                        */
#define GPIO_CFGB_GPIO13INTD_Msk          (0x800000UL)              /*!< GPIO CFGB: GPIO13INTD (Bitfield-Mask: 0x01)           */
#define GPIO_CFGB_GPIO13OUTCFG_Pos        (21UL)                    /*!< GPIO CFGB: GPIO13OUTCFG (Bit 21)                      */
#define GPIO_CFGB_GPIO13OUTCFG_Msk        (0x600000UL)              /*!< GPIO CFGB: GPIO13OUTCFG (Bitfield-Mask: 0x03)         */
#define GPIO_CFGB_GPIO13INCFG_Pos         (20UL)                    /*!< GPIO CFGB: GPIO13INCFG (Bit 20)                       */
#define GPIO_CFGB_GPIO13INCFG_Msk         (0x100000UL)              /*!< GPIO CFGB: GPIO13INCFG (Bitfield-Mask: 0x01)          */
#define GPIO_CFGB_GPIO12INTD_Pos          (19UL)                    /*!< GPIO CFGB: GPIO12INTD (Bit 19)                        */
#define GPIO_CFGB_GPIO12INTD_Msk          (0x80000UL)               /*!< GPIO CFGB: GPIO12INTD (Bitfield-Mask: 0x01)           */
#define GPIO_CFGB_GPIO12OUTCFG_Pos        (17UL)                    /*!< GPIO CFGB: GPIO12OUTCFG (Bit 17)                      */
#define GPIO_CFGB_GPIO12OUTCFG_Msk        (0x60000UL)               /*!< GPIO CFGB: GPIO12OUTCFG (Bitfield-Mask: 0x03)         */
#define GPIO_CFGB_GPIO12INCFG_Pos         (16UL)                    /*!< GPIO CFGB: GPIO12INCFG (Bit 16)                       */
#define GPIO_CFGB_GPIO12INCFG_Msk         (0x10000UL)               /*!< GPIO CFGB: GPIO12INCFG (Bitfield-Mask: 0x01)          */
#define GPIO_CFGB_GPIO11INTD_Pos          (15UL)                    /*!< GPIO CFGB: GPIO11INTD (Bit 15)                        */
#define GPIO_CFGB_GPIO11INTD_Msk          (0x8000UL)                /*!< GPIO CFGB: GPIO11INTD (Bitfield-Mask: 0x01)           */
#define GPIO_CFGB_GPIO11OUTCFG_Pos        (13UL)                    /*!< GPIO CFGB: GPIO11OUTCFG (Bit 13)                      */
#define GPIO_CFGB_GPIO11OUTCFG_Msk        (0x6000UL)                /*!< GPIO CFGB: GPIO11OUTCFG (Bitfield-Mask: 0x03)         */
#define GPIO_CFGB_GPIO11INCFG_Pos         (12UL)                    /*!< GPIO CFGB: GPIO11INCFG (Bit 12)                       */
#define GPIO_CFGB_GPIO11INCFG_Msk         (0x1000UL)                /*!< GPIO CFGB: GPIO11INCFG (Bitfield-Mask: 0x01)          */
#define GPIO_CFGB_GPIO10INTD_Pos          (11UL)                    /*!< GPIO CFGB: GPIO10INTD (Bit 11)                        */
#define GPIO_CFGB_GPIO10INTD_Msk          (0x800UL)                 /*!< GPIO CFGB: GPIO10INTD (Bitfield-Mask: 0x01)           */
#define GPIO_CFGB_GPIO10OUTCFG_Pos        (9UL)                     /*!< GPIO CFGB: GPIO10OUTCFG (Bit 9)                       */
#define GPIO_CFGB_GPIO10OUTCFG_Msk        (0x600UL)                 /*!< GPIO CFGB: GPIO10OUTCFG (Bitfield-Mask: 0x03)         */
#define GPIO_CFGB_GPIO10INCFG_Pos         (8UL)                     /*!< GPIO CFGB: GPIO10INCFG (Bit 8)                        */
#define GPIO_CFGB_GPIO10INCFG_Msk         (0x100UL)                 /*!< GPIO CFGB: GPIO10INCFG (Bitfield-Mask: 0x01)          */
#define GPIO_CFGB_GPIO9INTD_Pos           (7UL)                     /*!< GPIO CFGB: GPIO9INTD (Bit 7)                          */
#define GPIO_CFGB_GPIO9INTD_Msk           (0x80UL)                  /*!< GPIO CFGB: GPIO9INTD (Bitfield-Mask: 0x01)            */
#define GPIO_CFGB_GPIO9OUTCFG_Pos         (5UL)                     /*!< GPIO CFGB: GPIO9OUTCFG (Bit 5)                        */
#define GPIO_CFGB_GPIO9OUTCFG_Msk         (0x60UL)                  /*!< GPIO CFGB: GPIO9OUTCFG (Bitfield-Mask: 0x03)          */
#define GPIO_CFGB_GPIO9INCFG_Pos          (4UL)                     /*!< GPIO CFGB: GPIO9INCFG (Bit 4)                         */
