sparkfun/Arduino_Apollo3/cores/arduino/am_sdk_ap3/CMSIS/AmbiqMicro/Include/apollo3c.h
#define GPIO_ALTPADCFGP_PAD61_DS1_Pos     (8UL)                     /*!< GPIO ALTPADCFGP: PAD61_DS1 (Bit 8)                    */
#define GPIO_ALTPADCFGP_PAD61_DS1_Msk     (0x100UL)                 /*!< GPIO ALTPADCFGP: PAD61_DS1 (Bitfield-Mask: 0x01)      */
#define GPIO_ALTPADCFGP_PAD60_SR_Pos      (4UL)                     /*!< GPIO ALTPADCFGP: PAD60_SR (Bit 4)                     */
#define GPIO_ALTPADCFGP_PAD60_SR_Msk      (0x10UL)                  /*!< GPIO ALTPADCFGP: PAD60_SR (Bitfield-Mask: 0x01)       */
#define GPIO_ALTPADCFGP_PAD60_DS1_Pos     (0UL)                     /*!< GPIO ALTPADCFGP: PAD60_DS1 (Bit 0)                    */
#define GPIO_ALTPADCFGP_PAD60_DS1_Msk     (0x1UL)                   /*!< GPIO ALTPADCFGP: PAD60_DS1 (Bitfield-Mask: 0x01)      */
/* ======================================================  ALTPADCFGQ  ======================================================= */
#define GPIO_ALTPADCFGQ_PAD67_SR_Pos      (28UL)                    /*!< GPIO ALTPADCFGQ: PAD67_SR (Bit 28)                    */
#define GPIO_ALTPADCFGQ_PAD67_SR_Msk      (0x10000000UL)            /*!< GPIO ALTPADCFGQ: PAD67_SR (Bitfield-Mask: 0x01)       */
#define GPIO_ALTPADCFGQ_PAD67_DS1_Pos     (24UL)                    /*!< GPIO ALTPADCFGQ: PAD67_DS1 (Bit 24)                   */
#define GPIO_ALTPADCFGQ_PAD67_DS1_Msk     (0x1000000UL)             /*!< GPIO ALTPADCFGQ: PAD67_DS1 (Bitfield-Mask: 0x01)      */
#define GPIO_ALTPADCFGQ_PAD66_SR_Pos      (20UL)                    /*!< GPIO ALTPADCFGQ: PAD66_SR (Bit 20)                    */
#define GPIO_ALTPADCFGQ_PAD66_SR_Msk      (0x100000UL)              /*!< GPIO ALTPADCFGQ: PAD66_SR (Bitfield-Mask: 0x01)       */
#define GPIO_ALTPADCFGQ_PAD66_DS1_Pos     (16UL)                    /*!< GPIO ALTPADCFGQ: PAD66_DS1 (Bit 16)                   */
#define GPIO_ALTPADCFGQ_PAD66_DS1_Msk     (0x10000UL)               /*!< GPIO ALTPADCFGQ: PAD66_DS1 (Bitfield-Mask: 0x01)      */
#define GPIO_ALTPADCFGQ_PAD65_SR_Pos      (12UL)                    /*!< GPIO ALTPADCFGQ: PAD65_SR (Bit 12)                    */
#define GPIO_ALTPADCFGQ_PAD65_SR_Msk      (0x1000UL)                /*!< GPIO ALTPADCFGQ: PAD65_SR (Bitfield-Mask: 0x01)       */
#define GPIO_ALTPADCFGQ_PAD65_DS1_Pos     (8UL)                     /*!< GPIO ALTPADCFGQ: PAD65_DS1 (Bit 8)                    */
#define GPIO_ALTPADCFGQ_PAD65_DS1_Msk     (0x100UL)                 /*!< GPIO ALTPADCFGQ: PAD65_DS1 (Bitfield-Mask: 0x01)      */
#define GPIO_ALTPADCFGQ_PAD64_SR_Pos      (4UL)                     /*!< GPIO ALTPADCFGQ: PAD64_SR (Bit 4)                     */
#define GPIO_ALTPADCFGQ_PAD64_SR_Msk      (0x10UL)                  /*!< GPIO ALTPADCFGQ: PAD64_SR (Bitfield-Mask: 0x01)       */
#define GPIO_ALTPADCFGQ_PAD64_DS1_Pos     (0UL)                     /*!< GPIO ALTPADCFGQ: PAD64_DS1 (Bit 0)                    */
#define GPIO_ALTPADCFGQ_PAD64_DS1_Msk     (0x1UL)                   /*!< GPIO ALTPADCFGQ: PAD64_DS1 (Bitfield-Mask: 0x01)      */
/* ======================================================  ALTPADCFGR  ======================================================= */
#define GPIO_ALTPADCFGR_PAD71_SR_Pos      (28UL)                    /*!< GPIO ALTPADCFGR: PAD71_SR (Bit 28)                    */
#define GPIO_ALTPADCFGR_PAD71_SR_Msk      (0x10000000UL)            /*!< GPIO ALTPADCFGR: PAD71_SR (Bitfield-Mask: 0x01)       */
#define GPIO_ALTPADCFGR_PAD71_DS1_Pos     (24UL)                    /*!< GPIO ALTPADCFGR: PAD71_DS1 (Bit 24)                   */
#define GPIO_ALTPADCFGR_PAD71_DS1_Msk     (0x1000000UL)             /*!< GPIO ALTPADCFGR: PAD71_DS1 (Bitfield-Mask: 0x01)      */
#define GPIO_ALTPADCFGR_PAD70_SR_Pos      (20UL)                    /*!< GPIO ALTPADCFGR: PAD70_SR (Bit 20)                    */
#define GPIO_ALTPADCFGR_PAD70_SR_Msk      (0x100000UL)              /*!< GPIO ALTPADCFGR: PAD70_SR (Bitfield-Mask: 0x01)       */
#define GPIO_ALTPADCFGR_PAD70_DS1_Pos     (16UL)                    /*!< GPIO ALTPADCFGR: PAD70_DS1 (Bit 16)                   */
#define GPIO_ALTPADCFGR_PAD70_DS1_Msk     (0x10000UL)               /*!< GPIO ALTPADCFGR: PAD70_DS1 (Bitfield-Mask: 0x01)      */
#define GPIO_ALTPADCFGR_PAD69_SR_Pos      (12UL)                    /*!< GPIO ALTPADCFGR: PAD69_SR (Bit 12)                    */
#define GPIO_ALTPADCFGR_PAD69_SR_Msk      (0x1000UL)                /*!< GPIO ALTPADCFGR: PAD69_SR (Bitfield-Mask: 0x01)       */
#define GPIO_ALTPADCFGR_PAD69_DS1_Pos     (8UL)                     /*!< GPIO ALTPADCFGR: PAD69_DS1 (Bit 8)                    */
#define GPIO_ALTPADCFGR_PAD69_DS1_Msk     (0x100UL)                 /*!< GPIO ALTPADCFGR: PAD69_DS1 (Bitfield-Mask: 0x01)      */
#define GPIO_ALTPADCFGR_PAD68_SR_Pos      (4UL)                     /*!< GPIO ALTPADCFGR: PAD68_SR (Bit 4)                     */
#define GPIO_ALTPADCFGR_PAD68_SR_Msk      (0x10UL)                  /*!< GPIO ALTPADCFGR: PAD68_SR (Bitfield-Mask: 0x01)       */
#define GPIO_ALTPADCFGR_PAD68_DS1_Pos     (0UL)                     /*!< GPIO ALTPADCFGR: PAD68_DS1 (Bit 0)                    */
#define GPIO_ALTPADCFGR_PAD68_DS1_Msk     (0x1UL)                   /*!< GPIO ALTPADCFGR: PAD68_DS1 (Bitfield-Mask: 0x01)      */
/* ======================================================  ALTPADCFGS  ======================================================= */
#define GPIO_ALTPADCFGS_PAD73_SR_Pos      (12UL)                    /*!< GPIO ALTPADCFGS: PAD73_SR (Bit 12)                    */
#define GPIO_ALTPADCFGS_PAD73_SR_Msk      (0x1000UL)                /*!< GPIO ALTPADCFGS: PAD73_SR (Bitfield-Mask: 0x01)       */
#define GPIO_ALTPADCFGS_PAD73_DS1_Pos     (8UL)                     /*!< GPIO ALTPADCFGS: PAD73_DS1 (Bit 8)                    */
#define GPIO_ALTPADCFGS_PAD73_DS1_Msk     (0x100UL)                 /*!< GPIO ALTPADCFGS: PAD73_DS1 (Bitfield-Mask: 0x01)      */
#define GPIO_ALTPADCFGS_PAD72_SR_Pos      (4UL)                     /*!< GPIO ALTPADCFGS: PAD72_SR (Bit 4)                     */
#define GPIO_ALTPADCFGS_PAD72_SR_Msk      (0x10UL)                  /*!< GPIO ALTPADCFGS: PAD72_SR (Bitfield-Mask: 0x01)       */
#define GPIO_ALTPADCFGS_PAD72_DS1_Pos     (0UL)                     /*!< GPIO ALTPADCFGS: PAD72_DS1 (Bit 0)                    */
#define GPIO_ALTPADCFGS_PAD72_DS1_Msk     (0x1UL)                   /*!< GPIO ALTPADCFGS: PAD72_DS1 (Bitfield-Mask: 0x01)      */
/* =========================================================  SCDET  ========================================================= */
#define GPIO_SCDET_SCDET_Pos              (0UL)                     /*!< GPIO SCDET: SCDET (Bit 0)                             */
#define GPIO_SCDET_SCDET_Msk              (0x7fUL)                  /*!< GPIO SCDET: SCDET (Bitfield-Mask: 0x7f)               */
/* ========================================================  CTENCFG  ======================================================== */
#define GPIO_CTENCFG_EN31_Pos             (31UL)                    /*!< GPIO CTENCFG: EN31 (Bit 31)                           */
#define GPIO_CTENCFG_EN31_Msk             (0x80000000UL)            /*!< GPIO CTENCFG: EN31 (Bitfield-Mask: 0x01)              */
#define GPIO_CTENCFG_EN30_Pos             (30UL)                    /*!< GPIO CTENCFG: EN30 (Bit 30)                           */
#define GPIO_CTENCFG_EN30_Msk             (0x40000000UL)            /*!< GPIO CTENCFG: EN30 (Bitfield-Mask: 0x01)              */
#define GPIO_CTENCFG_EN29_Pos             (29UL)                    /*!< GPIO CTENCFG: EN29 (Bit 29)                           */
#define GPIO_CTENCFG_EN29_Msk             (0x20000000UL)            /*!< GPIO CTENCFG: EN29 (Bitfield-Mask: 0x01)              */
#define GPIO_CTENCFG_EN28_Pos             (28UL)                    /*!< GPIO CTENCFG: EN28 (Bit 28)                           */
#define GPIO_CTENCFG_EN28_Msk             (0x10000000UL)            /*!< GPIO CTENCFG: EN28 (Bitfield-Mask: 0x01)              */
#define GPIO_CTENCFG_EN27_Pos             (27UL)                    /*!< GPIO CTENCFG: EN27 (Bit 27)                           */
#define GPIO_CTENCFG_EN27_Msk             (0x8000000UL)             /*!< GPIO CTENCFG: EN27 (Bitfield-Mask: 0x01)              */
#define GPIO_CTENCFG_EN26_Pos             (26UL)                    /*!< GPIO CTENCFG: EN26 (Bit 26)                           */
#define GPIO_CTENCFG_EN26_Msk             (0x4000000UL)             /*!< GPIO CTENCFG: EN26 (Bitfield-Mask: 0x01)              */
#define GPIO_CTENCFG_EN25_Pos             (25UL)                    /*!< GPIO CTENCFG: EN25 (Bit 25)                           */
#define GPIO_CTENCFG_EN25_Msk             (0x2000000UL)             /*!< GPIO CTENCFG: EN25 (Bitfield-Mask: 0x01)              */
#define GPIO_CTENCFG_EN24_Pos             (24UL)                    /*!< GPIO CTENCFG: EN24 (Bit 24)                           */
#define GPIO_CTENCFG_EN24_Msk             (0x1000000UL)             /*!< GPIO CTENCFG: EN24 (Bitfield-Mask: 0x01)              */
#define GPIO_CTENCFG_EN23_Pos             (23UL)                    /*!< GPIO CTENCFG: EN23 (Bit 23)                           */
#define GPIO_CTENCFG_EN23_Msk             (0x800000UL)              /*!< GPIO CTENCFG: EN23 (Bitfield-Mask: 0x01)              */
#define GPIO_CTENCFG_EN22_Pos             (22UL)                    /*!< GPIO CTENCFG: EN22 (Bit 22)                           */
#define GPIO_CTENCFG_EN22_Msk             (0x400000UL)              /*!< GPIO CTENCFG: EN22 (Bitfield-Mask: 0x01)              */
#define GPIO_CTENCFG_EN21_Pos             (21UL)                    /*!< GPIO CTENCFG: EN21 (Bit 21)                           */
#define GPIO_CTENCFG_EN21_Msk             (0x200000UL)              /*!< GPIO CTENCFG: EN21 (Bitfield-Mask: 0x01)              */
#define GPIO_CTENCFG_EN20_Pos             (20UL)                    /*!< GPIO CTENCFG: EN20 (Bit 20)                           */
#define GPIO_CTENCFG_EN20_Msk             (0x100000UL)              /*!< GPIO CTENCFG: EN20 (Bitfield-Mask: 0x01)              */
#define GPIO_CTENCFG_EN19_Pos             (19UL)                    /*!< GPIO CTENCFG: EN19 (Bit 19)                           */
#define GPIO_CTENCFG_EN19_Msk             (0x80000UL)               /*!< GPIO CTENCFG: EN19 (Bitfield-Mask: 0x01)              */
#define GPIO_CTENCFG_EN18_Pos             (18UL)                    /*!< GPIO CTENCFG: EN18 (Bit 18)                           */
#define GPIO_CTENCFG_EN18_Msk             (0x40000UL)               /*!< GPIO CTENCFG: EN18 (Bitfield-Mask: 0x01)              */
#define GPIO_CTENCFG_EN17_Pos             (17UL)                    /*!< GPIO CTENCFG: EN17 (Bit 17)                           */
#define GPIO_CTENCFG_EN17_Msk             (0x20000UL)               /*!< GPIO CTENCFG: EN17 (Bitfield-Mask: 0x01)              */
#define GPIO_CTENCFG_EN16_Pos             (16UL)                    /*!< GPIO CTENCFG: EN16 (Bit 16)                           */
#define GPIO_CTENCFG_EN16_Msk             (0x10000UL)               /*!< GPIO CTENCFG: EN16 (Bitfield-Mask: 0x01)              */
#define GPIO_CTENCFG_EN15_Pos             (15UL)                    /*!< GPIO CTENCFG: EN15 (Bit 15)                           */
#define GPIO_CTENCFG_EN15_Msk             (0x8000UL)                /*!< GPIO CTENCFG: EN15 (Bitfield-Mask: 0x01)              */
#define GPIO_CTENCFG_EN14_Pos             (14UL)                    /*!< GPIO CTENCFG: EN14 (Bit 14)                           */
#define GPIO_CTENCFG_EN14_Msk             (0x4000UL)                /*!< GPIO CTENCFG: EN14 (Bitfield-Mask: 0x01)              */
#define GPIO_CTENCFG_EN13_Pos             (13UL)                    /*!< GPIO CTENCFG: EN13 (Bit 13)                           */
#define GPIO_CTENCFG_EN13_Msk             (0x2000UL)                /*!< GPIO CTENCFG: EN13 (Bitfield-Mask: 0x01)              */
#define GPIO_CTENCFG_EN12_Pos             (12UL)                    /*!< GPIO CTENCFG: EN12 (Bit 12)                           */
#define GPIO_CTENCFG_EN12_Msk             (0x1000UL)                /*!< GPIO CTENCFG: EN12 (Bitfield-Mask: 0x01)              */
#define GPIO_CTENCFG_EN11_Pos             (11UL)                    /*!< GPIO CTENCFG: EN11 (Bit 11)                           */
#define GPIO_CTENCFG_EN11_Msk             (0x800UL)                 /*!< GPIO CTENCFG: EN11 (Bitfield-Mask: 0x01)              */
#define GPIO_CTENCFG_EN10_Pos             (10UL)                    /*!< GPIO CTENCFG: EN10 (Bit 10)                           */
#define GPIO_CTENCFG_EN10_Msk             (0x400UL)                 /*!< GPIO CTENCFG: EN10 (Bitfield-Mask: 0x01)              */
#define GPIO_CTENCFG_EN9_Pos              (9UL)                     /*!< GPIO CTENCFG: EN9 (Bit 9)                             */
#define GPIO_CTENCFG_EN9_Msk              (0x200UL)                 /*!< GPIO CTENCFG: EN9 (Bitfield-Mask: 0x01)               */
#define GPIO_CTENCFG_EN8_Pos              (8UL)                     /*!< GPIO CTENCFG: EN8 (Bit 8)                             */
#define GPIO_CTENCFG_EN8_Msk              (0x100UL)                 /*!< GPIO CTENCFG: EN8 (Bitfield-Mask: 0x01)               */
#define GPIO_CTENCFG_EN7_Pos              (7UL)                     /*!< GPIO CTENCFG: EN7 (Bit 7)                             */
#define GPIO_CTENCFG_EN7_Msk              (0x80UL)                  /*!< GPIO CTENCFG: EN7 (Bitfield-Mask: 0x01)               */
#define GPIO_CTENCFG_EN6_Pos              (6UL)                     /*!< GPIO CTENCFG: EN6 (Bit 6)                             */
#define GPIO_CTENCFG_EN6_Msk              (0x40UL)                  /*!< GPIO CTENCFG: EN6 (Bitfield-Mask: 0x01)               */
#define GPIO_CTENCFG_EN5_Pos              (5UL)                     /*!< GPIO CTENCFG: EN5 (Bit 5)                             */
#define GPIO_CTENCFG_EN5_Msk              (0x20UL)                  /*!< GPIO CTENCFG: EN5 (Bitfield-Mask: 0x01)               */
#define GPIO_CTENCFG_EN4_Pos              (4UL)                     /*!< GPIO CTENCFG: EN4 (Bit 4)                             */
#define GPIO_CTENCFG_EN4_Msk              (0x10UL)                  /*!< GPIO CTENCFG: EN4 (Bitfield-Mask: 0x01)               */
#define GPIO_CTENCFG_EN3_Pos              (3UL)                     /*!< GPIO CTENCFG: EN3 (Bit 3)                             */
#define GPIO_CTENCFG_EN3_Msk              (0x8UL)                   /*!< GPIO CTENCFG: EN3 (Bitfield-Mask: 0x01)               */
#define GPIO_CTENCFG_EN2_Pos              (2UL)                     /*!< GPIO CTENCFG: EN2 (Bit 2)                             */
#define GPIO_CTENCFG_EN2_Msk              (0x4UL)                   /*!< GPIO CTENCFG: EN2 (Bitfield-Mask: 0x01)               */
#define GPIO_CTENCFG_EN1_Pos              (1UL)                     /*!< GPIO CTENCFG: EN1 (Bit 1)                             */
#define GPIO_CTENCFG_EN1_Msk              (0x2UL)                   /*!< GPIO CTENCFG: EN1 (Bitfield-Mask: 0x01)               */
#define GPIO_CTENCFG_EN0_Pos              (0UL)                     /*!< GPIO CTENCFG: EN0 (Bit 0)                             */
#define GPIO_CTENCFG_EN0_Msk              (0x1UL)                   /*!< GPIO CTENCFG: EN0 (Bitfield-Mask: 0x01)               */
/* ========================================================  INT0EN  ========================================================= */
#define GPIO_INT0EN_GPIO31_Pos            (31UL)                    /*!< GPIO INT0EN: GPIO31 (Bit 31)                          */
#define GPIO_INT0EN_GPIO31_Msk            (0x80000000UL)            /*!< GPIO INT0EN: GPIO31 (Bitfield-Mask: 0x01)             */
#define GPIO_INT0EN_GPIO30_Pos            (30UL)                    /*!< GPIO INT0EN: GPIO30 (Bit 30)                          */
#define GPIO_INT0EN_GPIO30_Msk            (0x40000000UL)            /*!< GPIO INT0EN: GPIO30 (Bitfield-Mask: 0x01)             */
#define GPIO_INT0EN_GPIO29_Pos            (29UL)                    /*!< GPIO INT0EN: GPIO29 (Bit 29)                          */
#define GPIO_INT0EN_GPIO29_Msk            (0x20000000UL)            /*!< GPIO INT0EN: GPIO29 (Bitfield-Mask: 0x01)             */
#define GPIO_INT0EN_GPIO28_Pos            (28UL)                    /*!< GPIO INT0EN: GPIO28 (Bit 28)                          */
#define GPIO_INT0EN_GPIO28_Msk            (0x10000000UL)            /*!< GPIO INT0EN: GPIO28 (Bitfield-Mask: 0x01)             */
#define GPIO_INT0EN_GPIO27_Pos            (27UL)                    /*!< GPIO INT0EN: GPIO27 (Bit 27)                          */
#define GPIO_INT0EN_GPIO27_Msk            (0x8000000UL)             /*!< GPIO INT0EN: GPIO27 (Bitfield-Mask: 0x01)             */
#define GPIO_INT0EN_GPIO26_Pos            (26UL)                    /*!< GPIO INT0EN: GPIO26 (Bit 26)                          */
#define GPIO_INT0EN_GPIO26_Msk            (0x4000000UL)             /*!< GPIO INT0EN: GPIO26 (Bitfield-Mask: 0x01)             */
#define GPIO_INT0EN_GPIO25_Pos            (25UL)                    /*!< GPIO INT0EN: GPIO25 (Bit 25)                          */
#define GPIO_INT0EN_GPIO25_Msk            (0x2000000UL)             /*!< GPIO INT0EN: GPIO25 (Bitfield-Mask: 0x01)             */
#define GPIO_INT0EN_GPIO24_Pos            (24UL)                    /*!< GPIO INT0EN: GPIO24 (Bit 24)                          */
#define GPIO_INT0EN_GPIO24_Msk            (0x1000000UL)             /*!< GPIO INT0EN: GPIO24 (Bitfield-Mask: 0x01)             */
#define GPIO_INT0EN_GPIO23_Pos            (23UL)                    /*!< GPIO INT0EN: GPIO23 (Bit 23)                          */
#define GPIO_INT0EN_GPIO23_Msk            (0x800000UL)              /*!< GPIO INT0EN: GPIO23 (Bitfield-Mask: 0x01)             */
#define GPIO_INT0EN_GPIO22_Pos            (22UL)                    /*!< GPIO INT0EN: GPIO22 (Bit 22)                          */
#define GPIO_INT0EN_GPIO22_Msk            (0x400000UL)              /*!< GPIO INT0EN: GPIO22 (Bitfield-Mask: 0x01)             */
#define GPIO_INT0EN_GPIO21_Pos            (21UL)                    /*!< GPIO INT0EN: GPIO21 (Bit 21)                          */
#define GPIO_INT0EN_GPIO21_Msk            (0x200000UL)              /*!< GPIO INT0EN: GPIO21 (Bitfield-Mask: 0x01)             */
#define GPIO_INT0EN_GPIO20_Pos            (20UL)                    /*!< GPIO INT0EN: GPIO20 (Bit 20)                          */
#define GPIO_INT0EN_GPIO20_Msk            (0x100000UL)              /*!< GPIO INT0EN: GPIO20 (Bitfield-Mask: 0x01)             */
#define GPIO_INT0EN_GPIO19_Pos            (19UL)                    /*!< GPIO INT0EN: GPIO19 (Bit 19)                          */
#define GPIO_INT0EN_GPIO19_Msk            (0x80000UL)               /*!< GPIO INT0EN: GPIO19 (Bitfield-Mask: 0x01)             */
#define GPIO_INT0EN_GPIO18_Pos            (18UL)                    /*!< GPIO INT0EN: GPIO18 (Bit 18)                          */
#define GPIO_INT0EN_GPIO18_Msk            (0x40000UL)               /*!< GPIO INT0EN: GPIO18 (Bitfield-Mask: 0x01)             */
#define GPIO_INT0EN_GPIO17_Pos            (17UL)                    /*!< GPIO INT0EN: GPIO17 (Bit 17)                          */
#define GPIO_INT0EN_GPIO17_Msk            (0x20000UL)               /*!< GPIO INT0EN: GPIO17 (Bitfield-Mask: 0x01)             */
#define GPIO_INT0EN_GPIO16_Pos            (16UL)                    /*!< GPIO INT0EN: GPIO16 (Bit 16)                          */
#define GPIO_INT0EN_GPIO16_Msk            (0x10000UL)               /*!< GPIO INT0EN: GPIO16 (Bitfield-Mask: 0x01)             */
#define GPIO_INT0EN_GPIO15_Pos            (15UL)                    /*!< GPIO INT0EN: GPIO15 (Bit 15)                          */
#define GPIO_INT0EN_GPIO15_Msk            (0x8000UL)                /*!< GPIO INT0EN: GPIO15 (Bitfield-Mask: 0x01)             */
#define GPIO_INT0EN_GPIO14_Pos            (14UL)                    /*!< GPIO INT0EN: GPIO14 (Bit 14)                          */
#define GPIO_INT0EN_GPIO14_Msk            (0x4000UL)                /*!< GPIO INT0EN: GPIO14 (Bitfield-Mask: 0x01)             */
#define GPIO_INT0EN_GPIO13_Pos            (13UL)                    /*!< GPIO INT0EN: GPIO13 (Bit 13)                          */
#define GPIO_INT0EN_GPIO13_Msk            (0x2000UL)                /*!< GPIO INT0EN: GPIO13 (Bitfield-Mask: 0x01)             */
#define GPIO_INT0EN_GPIO12_Pos            (12UL)                    /*!< GPIO INT0EN: GPIO12 (Bit 12)                          */
#define GPIO_INT0EN_GPIO12_Msk            (0x1000UL)                /*!< GPIO INT0EN: GPIO12 (Bitfield-Mask: 0x01)             */
#define GPIO_INT0EN_GPIO11_Pos            (11UL)                    /*!< GPIO INT0EN: GPIO11 (Bit 11)                          */
#define GPIO_INT0EN_GPIO11_Msk            (0x800UL)                 /*!< GPIO INT0EN: GPIO11 (Bitfield-Mask: 0x01)             */
#define GPIO_INT0EN_GPIO10_Pos            (10UL)                    /*!< GPIO INT0EN: GPIO10 (Bit 10)                          */
#define GPIO_INT0EN_GPIO10_Msk            (0x400UL)                 /*!< GPIO INT0EN: GPIO10 (Bitfield-Mask: 0x01)             */
#define GPIO_INT0EN_GPIO9_Pos             (9UL)                     /*!< GPIO INT0EN: GPIO9 (Bit 9)                            */
#define GPIO_INT0EN_GPIO9_Msk             (0x200UL)                 /*!< GPIO INT0EN: GPIO9 (Bitfield-Mask: 0x01)              */
#define GPIO_INT0EN_GPIO8_Pos             (8UL)                     /*!< GPIO INT0EN: GPIO8 (Bit 8)                            */
#define GPIO_INT0EN_GPIO8_Msk             (0x100UL)                 /*!< GPIO INT0EN: GPIO8 (Bitfield-Mask: 0x01)              */
#define GPIO_INT0EN_GPIO7_Pos             (7UL)                     /*!< GPIO INT0EN: GPIO7 (Bit 7)                            */
#define GPIO_INT0EN_GPIO7_Msk             (0x80UL)                  /*!< GPIO INT0EN: GPIO7 (Bitfield-Mask: 0x01)              */
#define GPIO_INT0EN_GPIO6_Pos             (6UL)                     /*!< GPIO INT0EN: GPIO6 (Bit 6)                            */
#define GPIO_INT0EN_GPIO6_Msk             (0x40UL)                  /*!< GPIO INT0EN: GPIO6 (Bitfield-Mask: 0x01)              */
#define GPIO_INT0EN_GPIO5_Pos             (5UL)                     /*!< GPIO INT0EN: GPIO5 (Bit 5)                            */
#define GPIO_INT0EN_GPIO5_Msk             (0x20UL)                  /*!< GPIO INT0EN: GPIO5 (Bitfield-Mask: 0x01)              */
#define GPIO_INT0EN_GPIO4_Pos             (4UL)                     /*!< GPIO INT0EN: GPIO4 (Bit 4)                            */
#define GPIO_INT0EN_GPIO4_Msk             (0x10UL)                  /*!< GPIO INT0EN: GPIO4 (Bitfield-Mask: 0x01)              */
#define GPIO_INT0EN_GPIO3_Pos             (3UL)                     /*!< GPIO INT0EN: GPIO3 (Bit 3)                            */
#define GPIO_INT0EN_GPIO3_Msk             (0x8UL)                   /*!< GPIO INT0EN: GPIO3 (Bitfield-Mask: 0x01)              */
#define GPIO_INT0EN_GPIO2_Pos             (2UL)                     /*!< GPIO INT0EN: GPIO2 (Bit 2)                            */
#define GPIO_INT0EN_GPIO2_Msk             (0x4UL)                   /*!< GPIO INT0EN: GPIO2 (Bitfield-Mask: 0x01)              */
#define GPIO_INT0EN_GPIO1_Pos             (1UL)                     /*!< GPIO INT0EN: GPIO1 (Bit 1)                            */
#define GPIO_INT0EN_GPIO1_Msk             (0x2UL)                   /*!< GPIO INT0EN: GPIO1 (Bitfield-Mask: 0x01)              */
#define GPIO_INT0EN_GPIO0_Pos             (0UL)                     /*!< GPIO INT0EN: GPIO0 (Bit 0)                            */
#define GPIO_INT0EN_GPIO0_Msk             (0x1UL)                   /*!< GPIO INT0EN: GPIO0 (Bitfield-Mask: 0x01)              */
/* =======================================================  INT0STAT  ======================================================== */
#define GPIO_INT0STAT_GPIO31_Pos          (31UL)                    /*!< GPIO INT0STAT: GPIO31 (Bit 31)                        */
