sparkfun/Arduino_Apollo3/cores/arduino/am_sdk_ap3/CMSIS/AmbiqMicro/Include/apollo3c.h
#define GPIO_INT1CLR_GPIO41_Pos           (9UL)                     /*!< GPIO INT1CLR: GPIO41 (Bit 9)                          */
#define GPIO_INT1CLR_GPIO41_Msk           (0x200UL)                 /*!< GPIO INT1CLR: GPIO41 (Bitfield-Mask: 0x01)            */
#define GPIO_INT1CLR_GPIO40_Pos           (8UL)                     /*!< GPIO INT1CLR: GPIO40 (Bit 8)                          */
#define GPIO_INT1CLR_GPIO40_Msk           (0x100UL)                 /*!< GPIO INT1CLR: GPIO40 (Bitfield-Mask: 0x01)            */
#define GPIO_INT1CLR_GPIO39_Pos           (7UL)                     /*!< GPIO INT1CLR: GPIO39 (Bit 7)                          */
#define GPIO_INT1CLR_GPIO39_Msk           (0x80UL)                  /*!< GPIO INT1CLR: GPIO39 (Bitfield-Mask: 0x01)            */
#define GPIO_INT1CLR_GPIO38_Pos           (6UL)                     /*!< GPIO INT1CLR: GPIO38 (Bit 6)                          */
#define GPIO_INT1CLR_GPIO38_Msk           (0x40UL)                  /*!< GPIO INT1CLR: GPIO38 (Bitfield-Mask: 0x01)            */
#define GPIO_INT1CLR_GPIO37_Pos           (5UL)                     /*!< GPIO INT1CLR: GPIO37 (Bit 5)                          */
#define GPIO_INT1CLR_GPIO37_Msk           (0x20UL)                  /*!< GPIO INT1CLR: GPIO37 (Bitfield-Mask: 0x01)            */
#define GPIO_INT1CLR_GPIO36_Pos           (4UL)                     /*!< GPIO INT1CLR: GPIO36 (Bit 4)                          */
#define GPIO_INT1CLR_GPIO36_Msk           (0x10UL)                  /*!< GPIO INT1CLR: GPIO36 (Bitfield-Mask: 0x01)            */
#define GPIO_INT1CLR_GPIO35_Pos           (3UL)                     /*!< GPIO INT1CLR: GPIO35 (Bit 3)                          */
#define GPIO_INT1CLR_GPIO35_Msk           (0x8UL)                   /*!< GPIO INT1CLR: GPIO35 (Bitfield-Mask: 0x01)            */
#define GPIO_INT1CLR_GPIO34_Pos           (2UL)                     /*!< GPIO INT1CLR: GPIO34 (Bit 2)                          */
#define GPIO_INT1CLR_GPIO34_Msk           (0x4UL)                   /*!< GPIO INT1CLR: GPIO34 (Bitfield-Mask: 0x01)            */
#define GPIO_INT1CLR_GPIO33_Pos           (1UL)                     /*!< GPIO INT1CLR: GPIO33 (Bit 1)                          */
#define GPIO_INT1CLR_GPIO33_Msk           (0x2UL)                   /*!< GPIO INT1CLR: GPIO33 (Bitfield-Mask: 0x01)            */
#define GPIO_INT1CLR_GPIO32_Pos           (0UL)                     /*!< GPIO INT1CLR: GPIO32 (Bit 0)                          */
#define GPIO_INT1CLR_GPIO32_Msk           (0x1UL)                   /*!< GPIO INT1CLR: GPIO32 (Bitfield-Mask: 0x01)            */
/* ========================================================  INT1SET  ======================================================== */
#define GPIO_INT1SET_GPIO63_Pos           (31UL)                    /*!< GPIO INT1SET: GPIO63 (Bit 31)                         */
#define GPIO_INT1SET_GPIO63_Msk           (0x80000000UL)            /*!< GPIO INT1SET: GPIO63 (Bitfield-Mask: 0x01)            */
#define GPIO_INT1SET_GPIO62_Pos           (30UL)                    /*!< GPIO INT1SET: GPIO62 (Bit 30)                         */
#define GPIO_INT1SET_GPIO62_Msk           (0x40000000UL)            /*!< GPIO INT1SET: GPIO62 (Bitfield-Mask: 0x01)            */
#define GPIO_INT1SET_GPIO61_Pos           (29UL)                    /*!< GPIO INT1SET: GPIO61 (Bit 29)                         */
#define GPIO_INT1SET_GPIO61_Msk           (0x20000000UL)            /*!< GPIO INT1SET: GPIO61 (Bitfield-Mask: 0x01)            */
#define GPIO_INT1SET_GPIO60_Pos           (28UL)                    /*!< GPIO INT1SET: GPIO60 (Bit 28)                         */
#define GPIO_INT1SET_GPIO60_Msk           (0x10000000UL)            /*!< GPIO INT1SET: GPIO60 (Bitfield-Mask: 0x01)            */
#define GPIO_INT1SET_GPIO59_Pos           (27UL)                    /*!< GPIO INT1SET: GPIO59 (Bit 27)                         */
#define GPIO_INT1SET_GPIO59_Msk           (0x8000000UL)             /*!< GPIO INT1SET: GPIO59 (Bitfield-Mask: 0x01)            */
#define GPIO_INT1SET_GPIO58_Pos           (26UL)                    /*!< GPIO INT1SET: GPIO58 (Bit 26)                         */
#define GPIO_INT1SET_GPIO58_Msk           (0x4000000UL)             /*!< GPIO INT1SET: GPIO58 (Bitfield-Mask: 0x01)            */
#define GPIO_INT1SET_GPIO57_Pos           (25UL)                    /*!< GPIO INT1SET: GPIO57 (Bit 25)                         */
#define GPIO_INT1SET_GPIO57_Msk           (0x2000000UL)             /*!< GPIO INT1SET: GPIO57 (Bitfield-Mask: 0x01)            */
#define GPIO_INT1SET_GPIO56_Pos           (24UL)                    /*!< GPIO INT1SET: GPIO56 (Bit 24)                         */
#define GPIO_INT1SET_GPIO56_Msk           (0x1000000UL)             /*!< GPIO INT1SET: GPIO56 (Bitfield-Mask: 0x01)            */
#define GPIO_INT1SET_GPIO55_Pos           (23UL)                    /*!< GPIO INT1SET: GPIO55 (Bit 23)                         */
#define GPIO_INT1SET_GPIO55_Msk           (0x800000UL)              /*!< GPIO INT1SET: GPIO55 (Bitfield-Mask: 0x01)            */
#define GPIO_INT1SET_GPIO54_Pos           (22UL)                    /*!< GPIO INT1SET: GPIO54 (Bit 22)                         */
#define GPIO_INT1SET_GPIO54_Msk           (0x400000UL)              /*!< GPIO INT1SET: GPIO54 (Bitfield-Mask: 0x01)            */
#define GPIO_INT1SET_GPIO53_Pos           (21UL)                    /*!< GPIO INT1SET: GPIO53 (Bit 21)                         */
#define GPIO_INT1SET_GPIO53_Msk           (0x200000UL)              /*!< GPIO INT1SET: GPIO53 (Bitfield-Mask: 0x01)            */
#define GPIO_INT1SET_GPIO52_Pos           (20UL)                    /*!< GPIO INT1SET: GPIO52 (Bit 20)                         */
#define GPIO_INT1SET_GPIO52_Msk           (0x100000UL)              /*!< GPIO INT1SET: GPIO52 (Bitfield-Mask: 0x01)            */
#define GPIO_INT1SET_GPIO51_Pos           (19UL)                    /*!< GPIO INT1SET: GPIO51 (Bit 19)                         */
#define GPIO_INT1SET_GPIO51_Msk           (0x80000UL)               /*!< GPIO INT1SET: GPIO51 (Bitfield-Mask: 0x01)            */
#define GPIO_INT1SET_GPIO50_Pos           (18UL)                    /*!< GPIO INT1SET: GPIO50 (Bit 18)                         */
#define GPIO_INT1SET_GPIO50_Msk           (0x40000UL)               /*!< GPIO INT1SET: GPIO50 (Bitfield-Mask: 0x01)            */
#define GPIO_INT1SET_GPIO49_Pos           (17UL)                    /*!< GPIO INT1SET: GPIO49 (Bit 17)                         */
#define GPIO_INT1SET_GPIO49_Msk           (0x20000UL)               /*!< GPIO INT1SET: GPIO49 (Bitfield-Mask: 0x01)            */
#define GPIO_INT1SET_GPIO48_Pos           (16UL)                    /*!< GPIO INT1SET: GPIO48 (Bit 16)                         */
#define GPIO_INT1SET_GPIO48_Msk           (0x10000UL)               /*!< GPIO INT1SET: GPIO48 (Bitfield-Mask: 0x01)            */
#define GPIO_INT1SET_GPIO47_Pos           (15UL)                    /*!< GPIO INT1SET: GPIO47 (Bit 15)                         */
#define GPIO_INT1SET_GPIO47_Msk           (0x8000UL)                /*!< GPIO INT1SET: GPIO47 (Bitfield-Mask: 0x01)            */
#define GPIO_INT1SET_GPIO46_Pos           (14UL)                    /*!< GPIO INT1SET: GPIO46 (Bit 14)                         */
#define GPIO_INT1SET_GPIO46_Msk           (0x4000UL)                /*!< GPIO INT1SET: GPIO46 (Bitfield-Mask: 0x01)            */
#define GPIO_INT1SET_GPIO45_Pos           (13UL)                    /*!< GPIO INT1SET: GPIO45 (Bit 13)                         */
#define GPIO_INT1SET_GPIO45_Msk           (0x2000UL)                /*!< GPIO INT1SET: GPIO45 (Bitfield-Mask: 0x01)            */
#define GPIO_INT1SET_GPIO44_Pos           (12UL)                    /*!< GPIO INT1SET: GPIO44 (Bit 12)                         */
#define GPIO_INT1SET_GPIO44_Msk           (0x1000UL)                /*!< GPIO INT1SET: GPIO44 (Bitfield-Mask: 0x01)            */
#define GPIO_INT1SET_GPIO43_Pos           (11UL)                    /*!< GPIO INT1SET: GPIO43 (Bit 11)                         */
#define GPIO_INT1SET_GPIO43_Msk           (0x800UL)                 /*!< GPIO INT1SET: GPIO43 (Bitfield-Mask: 0x01)            */
#define GPIO_INT1SET_GPIO42_Pos           (10UL)                    /*!< GPIO INT1SET: GPIO42 (Bit 10)                         */
#define GPIO_INT1SET_GPIO42_Msk           (0x400UL)                 /*!< GPIO INT1SET: GPIO42 (Bitfield-Mask: 0x01)            */
#define GPIO_INT1SET_GPIO41_Pos           (9UL)                     /*!< GPIO INT1SET: GPIO41 (Bit 9)                          */
#define GPIO_INT1SET_GPIO41_Msk           (0x200UL)                 /*!< GPIO INT1SET: GPIO41 (Bitfield-Mask: 0x01)            */
#define GPIO_INT1SET_GPIO40_Pos           (8UL)                     /*!< GPIO INT1SET: GPIO40 (Bit 8)                          */
#define GPIO_INT1SET_GPIO40_Msk           (0x100UL)                 /*!< GPIO INT1SET: GPIO40 (Bitfield-Mask: 0x01)            */
#define GPIO_INT1SET_GPIO39_Pos           (7UL)                     /*!< GPIO INT1SET: GPIO39 (Bit 7)                          */
#define GPIO_INT1SET_GPIO39_Msk           (0x80UL)                  /*!< GPIO INT1SET: GPIO39 (Bitfield-Mask: 0x01)            */
#define GPIO_INT1SET_GPIO38_Pos           (6UL)                     /*!< GPIO INT1SET: GPIO38 (Bit 6)                          */
#define GPIO_INT1SET_GPIO38_Msk           (0x40UL)                  /*!< GPIO INT1SET: GPIO38 (Bitfield-Mask: 0x01)            */
#define GPIO_INT1SET_GPIO37_Pos           (5UL)                     /*!< GPIO INT1SET: GPIO37 (Bit 5)                          */
#define GPIO_INT1SET_GPIO37_Msk           (0x20UL)                  /*!< GPIO INT1SET: GPIO37 (Bitfield-Mask: 0x01)            */
#define GPIO_INT1SET_GPIO36_Pos           (4UL)                     /*!< GPIO INT1SET: GPIO36 (Bit 4)                          */
#define GPIO_INT1SET_GPIO36_Msk           (0x10UL)                  /*!< GPIO INT1SET: GPIO36 (Bitfield-Mask: 0x01)            */
#define GPIO_INT1SET_GPIO35_Pos           (3UL)                     /*!< GPIO INT1SET: GPIO35 (Bit 3)                          */
#define GPIO_INT1SET_GPIO35_Msk           (0x8UL)                   /*!< GPIO INT1SET: GPIO35 (Bitfield-Mask: 0x01)            */
#define GPIO_INT1SET_GPIO34_Pos           (2UL)                     /*!< GPIO INT1SET: GPIO34 (Bit 2)                          */
#define GPIO_INT1SET_GPIO34_Msk           (0x4UL)                   /*!< GPIO INT1SET: GPIO34 (Bitfield-Mask: 0x01)            */
#define GPIO_INT1SET_GPIO33_Pos           (1UL)                     /*!< GPIO INT1SET: GPIO33 (Bit 1)                          */
#define GPIO_INT1SET_GPIO33_Msk           (0x2UL)                   /*!< GPIO INT1SET: GPIO33 (Bitfield-Mask: 0x01)            */
#define GPIO_INT1SET_GPIO32_Pos           (0UL)                     /*!< GPIO INT1SET: GPIO32 (Bit 0)                          */
#define GPIO_INT1SET_GPIO32_Msk           (0x1UL)                   /*!< GPIO INT1SET: GPIO32 (Bitfield-Mask: 0x01)            */
/* ========================================================  INT2EN  ========================================================= */
#define GPIO_INT2EN_GPIO73_Pos            (9UL)                     /*!< GPIO INT2EN: GPIO73 (Bit 9)                           */
#define GPIO_INT2EN_GPIO73_Msk            (0x200UL)                 /*!< GPIO INT2EN: GPIO73 (Bitfield-Mask: 0x01)             */
#define GPIO_INT2EN_GPIO72_Pos            (8UL)                     /*!< GPIO INT2EN: GPIO72 (Bit 8)                           */
#define GPIO_INT2EN_GPIO72_Msk            (0x100UL)                 /*!< GPIO INT2EN: GPIO72 (Bitfield-Mask: 0x01)             */
#define GPIO_INT2EN_GPIO71_Pos            (7UL)                     /*!< GPIO INT2EN: GPIO71 (Bit 7)                           */
#define GPIO_INT2EN_GPIO71_Msk            (0x80UL)                  /*!< GPIO INT2EN: GPIO71 (Bitfield-Mask: 0x01)             */
#define GPIO_INT2EN_GPIO70_Pos            (6UL)                     /*!< GPIO INT2EN: GPIO70 (Bit 6)                           */
#define GPIO_INT2EN_GPIO70_Msk            (0x40UL)                  /*!< GPIO INT2EN: GPIO70 (Bitfield-Mask: 0x01)             */
#define GPIO_INT2EN_GPIO69_Pos            (5UL)                     /*!< GPIO INT2EN: GPIO69 (Bit 5)                           */
#define GPIO_INT2EN_GPIO69_Msk            (0x20UL)                  /*!< GPIO INT2EN: GPIO69 (Bitfield-Mask: 0x01)             */
#define GPIO_INT2EN_GPIO68_Pos            (4UL)                     /*!< GPIO INT2EN: GPIO68 (Bit 4)                           */
#define GPIO_INT2EN_GPIO68_Msk            (0x10UL)                  /*!< GPIO INT2EN: GPIO68 (Bitfield-Mask: 0x01)             */
#define GPIO_INT2EN_GPIO67_Pos            (3UL)                     /*!< GPIO INT2EN: GPIO67 (Bit 3)                           */
#define GPIO_INT2EN_GPIO67_Msk            (0x8UL)                   /*!< GPIO INT2EN: GPIO67 (Bitfield-Mask: 0x01)             */
#define GPIO_INT2EN_GPIO66_Pos            (2UL)                     /*!< GPIO INT2EN: GPIO66 (Bit 2)                           */
#define GPIO_INT2EN_GPIO66_Msk            (0x4UL)                   /*!< GPIO INT2EN: GPIO66 (Bitfield-Mask: 0x01)             */
#define GPIO_INT2EN_GPIO65_Pos            (1UL)                     /*!< GPIO INT2EN: GPIO65 (Bit 1)                           */
#define GPIO_INT2EN_GPIO65_Msk            (0x2UL)                   /*!< GPIO INT2EN: GPIO65 (Bitfield-Mask: 0x01)             */
#define GPIO_INT2EN_GPIO64_Pos            (0UL)                     /*!< GPIO INT2EN: GPIO64 (Bit 0)                           */
#define GPIO_INT2EN_GPIO64_Msk            (0x1UL)                   /*!< GPIO INT2EN: GPIO64 (Bitfield-Mask: 0x01)             */
/* =======================================================  INT2STAT  ======================================================== */
#define GPIO_INT2STAT_GPIO73_Pos          (9UL)                     /*!< GPIO INT2STAT: GPIO73 (Bit 9)                         */
#define GPIO_INT2STAT_GPIO73_Msk          (0x200UL)                 /*!< GPIO INT2STAT: GPIO73 (Bitfield-Mask: 0x01)           */
#define GPIO_INT2STAT_GPIO72_Pos          (8UL)                     /*!< GPIO INT2STAT: GPIO72 (Bit 8)                         */
#define GPIO_INT2STAT_GPIO72_Msk          (0x100UL)                 /*!< GPIO INT2STAT: GPIO72 (Bitfield-Mask: 0x01)           */
#define GPIO_INT2STAT_GPIO71_Pos          (7UL)                     /*!< GPIO INT2STAT: GPIO71 (Bit 7)                         */
#define GPIO_INT2STAT_GPIO71_Msk          (0x80UL)                  /*!< GPIO INT2STAT: GPIO71 (Bitfield-Mask: 0x01)           */
#define GPIO_INT2STAT_GPIO70_Pos          (6UL)                     /*!< GPIO INT2STAT: GPIO70 (Bit 6)                         */
#define GPIO_INT2STAT_GPIO70_Msk          (0x40UL)                  /*!< GPIO INT2STAT: GPIO70 (Bitfield-Mask: 0x01)           */
#define GPIO_INT2STAT_GPIO69_Pos          (5UL)                     /*!< GPIO INT2STAT: GPIO69 (Bit 5)                         */
#define GPIO_INT2STAT_GPIO69_Msk          (0x20UL)                  /*!< GPIO INT2STAT: GPIO69 (Bitfield-Mask: 0x01)           */
#define GPIO_INT2STAT_GPIO68_Pos          (4UL)                     /*!< GPIO INT2STAT: GPIO68 (Bit 4)                         */
#define GPIO_INT2STAT_GPIO68_Msk          (0x10UL)                  /*!< GPIO INT2STAT: GPIO68 (Bitfield-Mask: 0x01)           */
#define GPIO_INT2STAT_GPIO67_Pos          (3UL)                     /*!< GPIO INT2STAT: GPIO67 (Bit 3)                         */
#define GPIO_INT2STAT_GPIO67_Msk          (0x8UL)                   /*!< GPIO INT2STAT: GPIO67 (Bitfield-Mask: 0x01)           */
#define GPIO_INT2STAT_GPIO66_Pos          (2UL)                     /*!< GPIO INT2STAT: GPIO66 (Bit 2)                         */
#define GPIO_INT2STAT_GPIO66_Msk          (0x4UL)                   /*!< GPIO INT2STAT: GPIO66 (Bitfield-Mask: 0x01)           */
#define GPIO_INT2STAT_GPIO65_Pos          (1UL)                     /*!< GPIO INT2STAT: GPIO65 (Bit 1)                         */
#define GPIO_INT2STAT_GPIO65_Msk          (0x2UL)                   /*!< GPIO INT2STAT: GPIO65 (Bitfield-Mask: 0x01)           */
#define GPIO_INT2STAT_GPIO64_Pos          (0UL)                     /*!< GPIO INT2STAT: GPIO64 (Bit 0)                         */
#define GPIO_INT2STAT_GPIO64_Msk          (0x1UL)                   /*!< GPIO INT2STAT: GPIO64 (Bitfield-Mask: 0x01)           */
/* ========================================================  INT2CLR  ======================================================== */
#define GPIO_INT2CLR_GPIO73_Pos           (9UL)                     /*!< GPIO INT2CLR: GPIO73 (Bit 9)                          */
#define GPIO_INT2CLR_GPIO73_Msk           (0x200UL)                 /*!< GPIO INT2CLR: GPIO73 (Bitfield-Mask: 0x01)            */
#define GPIO_INT2CLR_GPIO72_Pos           (8UL)                     /*!< GPIO INT2CLR: GPIO72 (Bit 8)                          */
#define GPIO_INT2CLR_GPIO72_Msk           (0x100UL)                 /*!< GPIO INT2CLR: GPIO72 (Bitfield-Mask: 0x01)            */
#define GPIO_INT2CLR_GPIO71_Pos           (7UL)                     /*!< GPIO INT2CLR: GPIO71 (Bit 7)                          */
#define GPIO_INT2CLR_GPIO71_Msk           (0x80UL)                  /*!< GPIO INT2CLR: GPIO71 (Bitfield-Mask: 0x01)            */
#define GPIO_INT2CLR_GPIO70_Pos           (6UL)                     /*!< GPIO INT2CLR: GPIO70 (Bit 6)                          */
#define GPIO_INT2CLR_GPIO70_Msk           (0x40UL)                  /*!< GPIO INT2CLR: GPIO70 (Bitfield-Mask: 0x01)            */
#define GPIO_INT2CLR_GPIO69_Pos           (5UL)                     /*!< GPIO INT2CLR: GPIO69 (Bit 5)                          */
#define GPIO_INT2CLR_GPIO69_Msk           (0x20UL)                  /*!< GPIO INT2CLR: GPIO69 (Bitfield-Mask: 0x01)            */
#define GPIO_INT2CLR_GPIO68_Pos           (4UL)                     /*!< GPIO INT2CLR: GPIO68 (Bit 4)                          */
#define GPIO_INT2CLR_GPIO68_Msk           (0x10UL)                  /*!< GPIO INT2CLR: GPIO68 (Bitfield-Mask: 0x01)            */
#define GPIO_INT2CLR_GPIO67_Pos           (3UL)                     /*!< GPIO INT2CLR: GPIO67 (Bit 3)                          */
#define GPIO_INT2CLR_GPIO67_Msk           (0x8UL)                   /*!< GPIO INT2CLR: GPIO67 (Bitfield-Mask: 0x01)            */
#define GPIO_INT2CLR_GPIO66_Pos           (2UL)                     /*!< GPIO INT2CLR: GPIO66 (Bit 2)                          */
#define GPIO_INT2CLR_GPIO66_Msk           (0x4UL)                   /*!< GPIO INT2CLR: GPIO66 (Bitfield-Mask: 0x01)            */
#define GPIO_INT2CLR_GPIO65_Pos           (1UL)                     /*!< GPIO INT2CLR: GPIO65 (Bit 1)                          */
#define GPIO_INT2CLR_GPIO65_Msk           (0x2UL)                   /*!< GPIO INT2CLR: GPIO65 (Bitfield-Mask: 0x01)            */
#define GPIO_INT2CLR_GPIO64_Pos           (0UL)                     /*!< GPIO INT2CLR: GPIO64 (Bit 0)                          */
#define GPIO_INT2CLR_GPIO64_Msk           (0x1UL)                   /*!< GPIO INT2CLR: GPIO64 (Bitfield-Mask: 0x01)            */
/* ========================================================  INT2SET  ======================================================== */
#define GPIO_INT2SET_GPIO73_Pos           (9UL)                     /*!< GPIO INT2SET: GPIO73 (Bit 9)                          */
#define GPIO_INT2SET_GPIO73_Msk           (0x200UL)                 /*!< GPIO INT2SET: GPIO73 (Bitfield-Mask: 0x01)            */
#define GPIO_INT2SET_GPIO72_Pos           (8UL)                     /*!< GPIO INT2SET: GPIO72 (Bit 8)                          */
#define GPIO_INT2SET_GPIO72_Msk           (0x100UL)                 /*!< GPIO INT2SET: GPIO72 (Bitfield-Mask: 0x01)            */
#define GPIO_INT2SET_GPIO71_Pos           (7UL)                     /*!< GPIO INT2SET: GPIO71 (Bit 7)                          */
#define GPIO_INT2SET_GPIO71_Msk           (0x80UL)                  /*!< GPIO INT2SET: GPIO71 (Bitfield-Mask: 0x01)            */
#define GPIO_INT2SET_GPIO70_Pos           (6UL)                     /*!< GPIO INT2SET: GPIO70 (Bit 6)                          */
#define GPIO_INT2SET_GPIO70_Msk           (0x40UL)                  /*!< GPIO INT2SET: GPIO70 (Bitfield-Mask: 0x01)            */
#define GPIO_INT2SET_GPIO69_Pos           (5UL)                     /*!< GPIO INT2SET: GPIO69 (Bit 5)                          */
#define GPIO_INT2SET_GPIO69_Msk           (0x20UL)                  /*!< GPIO INT2SET: GPIO69 (Bitfield-Mask: 0x01)            */
#define GPIO_INT2SET_GPIO68_Pos           (4UL)                     /*!< GPIO INT2SET: GPIO68 (Bit 4)                          */
#define GPIO_INT2SET_GPIO68_Msk           (0x10UL)                  /*!< GPIO INT2SET: GPIO68 (Bitfield-Mask: 0x01)            */
#define GPIO_INT2SET_GPIO67_Pos           (3UL)                     /*!< GPIO INT2SET: GPIO67 (Bit 3)                          */
#define GPIO_INT2SET_GPIO67_Msk           (0x8UL)                   /*!< GPIO INT2SET: GPIO67 (Bitfield-Mask: 0x01)            */
#define GPIO_INT2SET_GPIO66_Pos           (2UL)                     /*!< GPIO INT2SET: GPIO66 (Bit 2)                          */
#define GPIO_INT2SET_GPIO66_Msk           (0x4UL)                   /*!< GPIO INT2SET: GPIO66 (Bitfield-Mask: 0x01)            */
#define GPIO_INT2SET_GPIO65_Pos           (1UL)                     /*!< GPIO INT2SET: GPIO65 (Bit 1)                          */
#define GPIO_INT2SET_GPIO65_Msk           (0x2UL)                   /*!< GPIO INT2SET: GPIO65 (Bitfield-Mask: 0x01)            */
#define GPIO_INT2SET_GPIO64_Pos           (0UL)                     /*!< GPIO INT2SET: GPIO64 (Bit 0)                          */
#define GPIO_INT2SET_GPIO64_Msk           (0x1UL)                   /*!< GPIO INT2SET: GPIO64 (Bitfield-Mask: 0x01)            */
/* ========================================================  DBGCTRL  ======================================================== */
#define GPIO_DBGCTRL_GCLK5_Pos            (5UL)                     /*!< GPIO DBGCTRL: GCLK5 (Bit 5)                           */
#define GPIO_DBGCTRL_GCLK5_Msk            (0x20UL)                  /*!< GPIO DBGCTRL: GCLK5 (Bitfield-Mask: 0x01)             */
#define GPIO_DBGCTRL_GCLK4_Pos            (4UL)                     /*!< GPIO DBGCTRL: GCLK4 (Bit 4)                           */
#define GPIO_DBGCTRL_GCLK4_Msk            (0x10UL)                  /*!< GPIO DBGCTRL: GCLK4 (Bitfield-Mask: 0x01)             */
#define GPIO_DBGCTRL_GCLK3_Pos            (3UL)                     /*!< GPIO DBGCTRL: GCLK3 (Bit 3)                           */
#define GPIO_DBGCTRL_GCLK3_Msk            (0x8UL)                   /*!< GPIO DBGCTRL: GCLK3 (Bitfield-Mask: 0x01)             */
#define GPIO_DBGCTRL_GCLK2_Pos            (2UL)                     /*!< GPIO DBGCTRL: GCLK2 (Bit 2)                           */
#define GPIO_DBGCTRL_GCLK2_Msk            (0x4UL)                   /*!< GPIO DBGCTRL: GCLK2 (Bitfield-Mask: 0x01)             */
#define GPIO_DBGCTRL_GCLK1_Pos            (1UL)                     /*!< GPIO DBGCTRL: GCLK1 (Bit 1)                           */
#define GPIO_DBGCTRL_GCLK1_Msk            (0x2UL)                   /*!< GPIO DBGCTRL: GCLK1 (Bitfield-Mask: 0x01)             */
#define GPIO_DBGCTRL_GCLK0_Pos            (0UL)                     /*!< GPIO DBGCTRL: GCLK0 (Bit 0)                           */
#define GPIO_DBGCTRL_GCLK0_Msk            (0x1UL)                   /*!< GPIO DBGCTRL: GCLK0 (Bitfield-Mask: 0x01)             */


