sparkfun/Arduino_Apollo3/cores/arduino/am_sdk_ap3/CMSIS/AmbiqMicro/Include/apollo3c.h
/* =========================================================================================================================== */
/* ================                                           IOM0                                            ================ */
/* =========================================================================================================================== */

/* =========================================================  FIFO  ========================================================== */
#define IOM0_FIFO_FIFO_Pos                (0UL)                     /*!< IOM0 FIFO: FIFO (Bit 0)                               */
#define IOM0_FIFO_FIFO_Msk                (0xffffffffUL)            /*!< IOM0 FIFO: FIFO (Bitfield-Mask: 0xffffffff)           */
/* ========================================================  FIFOPTR  ======================================================== */
#define IOM0_FIFOPTR_FIFO1REM_Pos         (24UL)                    /*!< IOM0 FIFOPTR: FIFO1REM (Bit 24)                       */
#define IOM0_FIFOPTR_FIFO1REM_Msk         (0xff000000UL)            /*!< IOM0 FIFOPTR: FIFO1REM (Bitfield-Mask: 0xff)          */
#define IOM0_FIFOPTR_FIFO1SIZ_Pos         (16UL)                    /*!< IOM0 FIFOPTR: FIFO1SIZ (Bit 16)                       */
#define IOM0_FIFOPTR_FIFO1SIZ_Msk         (0xff0000UL)              /*!< IOM0 FIFOPTR: FIFO1SIZ (Bitfield-Mask: 0xff)          */
#define IOM0_FIFOPTR_FIFO0REM_Pos         (8UL)                     /*!< IOM0 FIFOPTR: FIFO0REM (Bit 8)                        */
#define IOM0_FIFOPTR_FIFO0REM_Msk         (0xff00UL)                /*!< IOM0 FIFOPTR: FIFO0REM (Bitfield-Mask: 0xff)          */
#define IOM0_FIFOPTR_FIFO0SIZ_Pos         (0UL)                     /*!< IOM0 FIFOPTR: FIFO0SIZ (Bit 0)                        */
#define IOM0_FIFOPTR_FIFO0SIZ_Msk         (0xffUL)                  /*!< IOM0 FIFOPTR: FIFO0SIZ (Bitfield-Mask: 0xff)          */
/* ========================================================  FIFOTHR  ======================================================== */
#define IOM0_FIFOTHR_FIFOWTHR_Pos         (8UL)                     /*!< IOM0 FIFOTHR: FIFOWTHR (Bit 8)                        */
#define IOM0_FIFOTHR_FIFOWTHR_Msk         (0x3f00UL)                /*!< IOM0 FIFOTHR: FIFOWTHR (Bitfield-Mask: 0x3f)          */
#define IOM0_FIFOTHR_FIFORTHR_Pos         (0UL)                     /*!< IOM0 FIFOTHR: FIFORTHR (Bit 0)                        */
#define IOM0_FIFOTHR_FIFORTHR_Msk         (0x3fUL)                  /*!< IOM0 FIFOTHR: FIFORTHR (Bitfield-Mask: 0x3f)          */
/* ========================================================  FIFOPOP  ======================================================== */
#define IOM0_FIFOPOP_FIFODOUT_Pos         (0UL)                     /*!< IOM0 FIFOPOP: FIFODOUT (Bit 0)                        */
#define IOM0_FIFOPOP_FIFODOUT_Msk         (0xffffffffUL)            /*!< IOM0 FIFOPOP: FIFODOUT (Bitfield-Mask: 0xffffffff)    */
/* =======================================================  FIFOPUSH  ======================================================== */
#define IOM0_FIFOPUSH_FIFODIN_Pos         (0UL)                     /*!< IOM0 FIFOPUSH: FIFODIN (Bit 0)                        */
#define IOM0_FIFOPUSH_FIFODIN_Msk         (0xffffffffUL)            /*!< IOM0 FIFOPUSH: FIFODIN (Bitfield-Mask: 0xffffffff)    */
/* =======================================================  FIFOCTRL  ======================================================== */
#define IOM0_FIFOCTRL_FIFORSTN_Pos        (1UL)                     /*!< IOM0 FIFOCTRL: FIFORSTN (Bit 1)                       */
#define IOM0_FIFOCTRL_FIFORSTN_Msk        (0x2UL)                   /*!< IOM0 FIFOCTRL: FIFORSTN (Bitfield-Mask: 0x01)         */
#define IOM0_FIFOCTRL_POPWR_Pos           (0UL)                     /*!< IOM0 FIFOCTRL: POPWR (Bit 0)                          */
#define IOM0_FIFOCTRL_POPWR_Msk           (0x1UL)                   /*!< IOM0 FIFOCTRL: POPWR (Bitfield-Mask: 0x01)            */
/* ========================================================  FIFOLOC  ======================================================== */
#define IOM0_FIFOLOC_FIFORPTR_Pos         (8UL)                     /*!< IOM0 FIFOLOC: FIFORPTR (Bit 8)                        */
#define IOM0_FIFOLOC_FIFORPTR_Msk         (0xf00UL)                 /*!< IOM0 FIFOLOC: FIFORPTR (Bitfield-Mask: 0x0f)          */
#define IOM0_FIFOLOC_FIFOWPTR_Pos         (0UL)                     /*!< IOM0 FIFOLOC: FIFOWPTR (Bit 0)                        */
#define IOM0_FIFOLOC_FIFOWPTR_Msk         (0xfUL)                   /*!< IOM0 FIFOLOC: FIFOWPTR (Bitfield-Mask: 0x0f)          */
/* =========================================================  INTEN  ========================================================= */
#define IOM0_INTEN_CQERR_Pos              (14UL)                    /*!< IOM0 INTEN: CQERR (Bit 14)                            */
#define IOM0_INTEN_CQERR_Msk              (0x4000UL)                /*!< IOM0 INTEN: CQERR (Bitfield-Mask: 0x01)               */
#define IOM0_INTEN_CQUPD_Pos              (13UL)                    /*!< IOM0 INTEN: CQUPD (Bit 13)                            */
#define IOM0_INTEN_CQUPD_Msk              (0x2000UL)                /*!< IOM0 INTEN: CQUPD (Bitfield-Mask: 0x01)               */
#define IOM0_INTEN_CQPAUSED_Pos           (12UL)                    /*!< IOM0 INTEN: CQPAUSED (Bit 12)                         */
#define IOM0_INTEN_CQPAUSED_Msk           (0x1000UL)                /*!< IOM0 INTEN: CQPAUSED (Bitfield-Mask: 0x01)            */
#define IOM0_INTEN_DERR_Pos               (11UL)                    /*!< IOM0 INTEN: DERR (Bit 11)                             */
#define IOM0_INTEN_DERR_Msk               (0x800UL)                 /*!< IOM0 INTEN: DERR (Bitfield-Mask: 0x01)                */
#define IOM0_INTEN_DCMP_Pos               (10UL)                    /*!< IOM0 INTEN: DCMP (Bit 10)                             */
#define IOM0_INTEN_DCMP_Msk               (0x400UL)                 /*!< IOM0 INTEN: DCMP (Bitfield-Mask: 0x01)                */
#define IOM0_INTEN_ARB_Pos                (9UL)                     /*!< IOM0 INTEN: ARB (Bit 9)                               */
#define IOM0_INTEN_ARB_Msk                (0x200UL)                 /*!< IOM0 INTEN: ARB (Bitfield-Mask: 0x01)                 */
#define IOM0_INTEN_STOP_Pos               (8UL)                     /*!< IOM0 INTEN: STOP (Bit 8)                              */
#define IOM0_INTEN_STOP_Msk               (0x100UL)                 /*!< IOM0 INTEN: STOP (Bitfield-Mask: 0x01)                */
#define IOM0_INTEN_START_Pos              (7UL)                     /*!< IOM0 INTEN: START (Bit 7)                             */
#define IOM0_INTEN_START_Msk              (0x80UL)                  /*!< IOM0 INTEN: START (Bitfield-Mask: 0x01)               */
#define IOM0_INTEN_ICMD_Pos               (6UL)                     /*!< IOM0 INTEN: ICMD (Bit 6)                              */
#define IOM0_INTEN_ICMD_Msk               (0x40UL)                  /*!< IOM0 INTEN: ICMD (Bitfield-Mask: 0x01)                */
#define IOM0_INTEN_IACC_Pos               (5UL)                     /*!< IOM0 INTEN: IACC (Bit 5)                              */
#define IOM0_INTEN_IACC_Msk               (0x20UL)                  /*!< IOM0 INTEN: IACC (Bitfield-Mask: 0x01)                */
#define IOM0_INTEN_NAK_Pos                (4UL)                     /*!< IOM0 INTEN: NAK (Bit 4)                               */
#define IOM0_INTEN_NAK_Msk                (0x10UL)                  /*!< IOM0 INTEN: NAK (Bitfield-Mask: 0x01)                 */
#define IOM0_INTEN_FOVFL_Pos              (3UL)                     /*!< IOM0 INTEN: FOVFL (Bit 3)                             */
#define IOM0_INTEN_FOVFL_Msk              (0x8UL)                   /*!< IOM0 INTEN: FOVFL (Bitfield-Mask: 0x01)               */
#define IOM0_INTEN_FUNDFL_Pos             (2UL)                     /*!< IOM0 INTEN: FUNDFL (Bit 2)                            */
#define IOM0_INTEN_FUNDFL_Msk             (0x4UL)                   /*!< IOM0 INTEN: FUNDFL (Bitfield-Mask: 0x01)              */
#define IOM0_INTEN_THR_Pos                (1UL)                     /*!< IOM0 INTEN: THR (Bit 1)                               */
#define IOM0_INTEN_THR_Msk                (0x2UL)                   /*!< IOM0 INTEN: THR (Bitfield-Mask: 0x01)                 */
#define IOM0_INTEN_CMDCMP_Pos             (0UL)                     /*!< IOM0 INTEN: CMDCMP (Bit 0)                            */
#define IOM0_INTEN_CMDCMP_Msk             (0x1UL)                   /*!< IOM0 INTEN: CMDCMP (Bitfield-Mask: 0x01)              */
/* ========================================================  INTSTAT  ======================================================== */
#define IOM0_INTSTAT_CQERR_Pos            (14UL)                    /*!< IOM0 INTSTAT: CQERR (Bit 14)                          */
#define IOM0_INTSTAT_CQERR_Msk            (0x4000UL)                /*!< IOM0 INTSTAT: CQERR (Bitfield-Mask: 0x01)             */
#define IOM0_INTSTAT_CQUPD_Pos            (13UL)                    /*!< IOM0 INTSTAT: CQUPD (Bit 13)                          */
#define IOM0_INTSTAT_CQUPD_Msk            (0x2000UL)                /*!< IOM0 INTSTAT: CQUPD (Bitfield-Mask: 0x01)             */
#define IOM0_INTSTAT_CQPAUSED_Pos         (12UL)                    /*!< IOM0 INTSTAT: CQPAUSED (Bit 12)                       */
#define IOM0_INTSTAT_CQPAUSED_Msk         (0x1000UL)                /*!< IOM0 INTSTAT: CQPAUSED (Bitfield-Mask: 0x01)          */
#define IOM0_INTSTAT_DERR_Pos             (11UL)                    /*!< IOM0 INTSTAT: DERR (Bit 11)                           */
#define IOM0_INTSTAT_DERR_Msk             (0x800UL)                 /*!< IOM0 INTSTAT: DERR (Bitfield-Mask: 0x01)              */
#define IOM0_INTSTAT_DCMP_Pos             (10UL)                    /*!< IOM0 INTSTAT: DCMP (Bit 10)                           */
#define IOM0_INTSTAT_DCMP_Msk             (0x400UL)                 /*!< IOM0 INTSTAT: DCMP (Bitfield-Mask: 0x01)              */
#define IOM0_INTSTAT_ARB_Pos              (9UL)                     /*!< IOM0 INTSTAT: ARB (Bit 9)                             */
#define IOM0_INTSTAT_ARB_Msk              (0x200UL)                 /*!< IOM0 INTSTAT: ARB (Bitfield-Mask: 0x01)               */
#define IOM0_INTSTAT_STOP_Pos             (8UL)                     /*!< IOM0 INTSTAT: STOP (Bit 8)                            */
#define IOM0_INTSTAT_STOP_Msk             (0x100UL)                 /*!< IOM0 INTSTAT: STOP (Bitfield-Mask: 0x01)              */
#define IOM0_INTSTAT_START_Pos            (7UL)                     /*!< IOM0 INTSTAT: START (Bit 7)                           */
#define IOM0_INTSTAT_START_Msk            (0x80UL)                  /*!< IOM0 INTSTAT: START (Bitfield-Mask: 0x01)             */
#define IOM0_INTSTAT_ICMD_Pos             (6UL)                     /*!< IOM0 INTSTAT: ICMD (Bit 6)                            */
#define IOM0_INTSTAT_ICMD_Msk             (0x40UL)                  /*!< IOM0 INTSTAT: ICMD (Bitfield-Mask: 0x01)              */
#define IOM0_INTSTAT_IACC_Pos             (5UL)                     /*!< IOM0 INTSTAT: IACC (Bit 5)                            */
#define IOM0_INTSTAT_IACC_Msk             (0x20UL)                  /*!< IOM0 INTSTAT: IACC (Bitfield-Mask: 0x01)              */
#define IOM0_INTSTAT_NAK_Pos              (4UL)                     /*!< IOM0 INTSTAT: NAK (Bit 4)                             */
#define IOM0_INTSTAT_NAK_Msk              (0x10UL)                  /*!< IOM0 INTSTAT: NAK (Bitfield-Mask: 0x01)               */
#define IOM0_INTSTAT_FOVFL_Pos            (3UL)                     /*!< IOM0 INTSTAT: FOVFL (Bit 3)                           */
#define IOM0_INTSTAT_FOVFL_Msk            (0x8UL)                   /*!< IOM0 INTSTAT: FOVFL (Bitfield-Mask: 0x01)             */
#define IOM0_INTSTAT_FUNDFL_Pos           (2UL)                     /*!< IOM0 INTSTAT: FUNDFL (Bit 2)                          */
#define IOM0_INTSTAT_FUNDFL_Msk           (0x4UL)                   /*!< IOM0 INTSTAT: FUNDFL (Bitfield-Mask: 0x01)            */
#define IOM0_INTSTAT_THR_Pos              (1UL)                     /*!< IOM0 INTSTAT: THR (Bit 1)                             */
#define IOM0_INTSTAT_THR_Msk              (0x2UL)                   /*!< IOM0 INTSTAT: THR (Bitfield-Mask: 0x01)               */
#define IOM0_INTSTAT_CMDCMP_Pos           (0UL)                     /*!< IOM0 INTSTAT: CMDCMP (Bit 0)                          */
#define IOM0_INTSTAT_CMDCMP_Msk           (0x1UL)                   /*!< IOM0 INTSTAT: CMDCMP (Bitfield-Mask: 0x01)            */
/* ========================================================  INTCLR  ========================================================= */
#define IOM0_INTCLR_CQERR_Pos             (14UL)                    /*!< IOM0 INTCLR: CQERR (Bit 14)                           */
#define IOM0_INTCLR_CQERR_Msk             (0x4000UL)                /*!< IOM0 INTCLR: CQERR (Bitfield-Mask: 0x01)              */
#define IOM0_INTCLR_CQUPD_Pos             (13UL)                    /*!< IOM0 INTCLR: CQUPD (Bit 13)                           */
#define IOM0_INTCLR_CQUPD_Msk             (0x2000UL)                /*!< IOM0 INTCLR: CQUPD (Bitfield-Mask: 0x01)              */
#define IOM0_INTCLR_CQPAUSED_Pos          (12UL)                    /*!< IOM0 INTCLR: CQPAUSED (Bit 12)                        */
#define IOM0_INTCLR_CQPAUSED_Msk          (0x1000UL)                /*!< IOM0 INTCLR: CQPAUSED (Bitfield-Mask: 0x01)           */
#define IOM0_INTCLR_DERR_Pos              (11UL)                    /*!< IOM0 INTCLR: DERR (Bit 11)                            */
#define IOM0_INTCLR_DERR_Msk              (0x800UL)                 /*!< IOM0 INTCLR: DERR (Bitfield-Mask: 0x01)               */
#define IOM0_INTCLR_DCMP_Pos              (10UL)                    /*!< IOM0 INTCLR: DCMP (Bit 10)                            */
#define IOM0_INTCLR_DCMP_Msk              (0x400UL)                 /*!< IOM0 INTCLR: DCMP (Bitfield-Mask: 0x01)               */
#define IOM0_INTCLR_ARB_Pos               (9UL)                     /*!< IOM0 INTCLR: ARB (Bit 9)                              */
#define IOM0_INTCLR_ARB_Msk               (0x200UL)                 /*!< IOM0 INTCLR: ARB (Bitfield-Mask: 0x01)                */
#define IOM0_INTCLR_STOP_Pos              (8UL)                     /*!< IOM0 INTCLR: STOP (Bit 8)                             */
#define IOM0_INTCLR_STOP_Msk              (0x100UL)                 /*!< IOM0 INTCLR: STOP (Bitfield-Mask: 0x01)               */
#define IOM0_INTCLR_START_Pos             (7UL)                     /*!< IOM0 INTCLR: START (Bit 7)                            */
#define IOM0_INTCLR_START_Msk             (0x80UL)                  /*!< IOM0 INTCLR: START (Bitfield-Mask: 0x01)              */
#define IOM0_INTCLR_ICMD_Pos              (6UL)                     /*!< IOM0 INTCLR: ICMD (Bit 6)                             */
#define IOM0_INTCLR_ICMD_Msk              (0x40UL)                  /*!< IOM0 INTCLR: ICMD (Bitfield-Mask: 0x01)               */
#define IOM0_INTCLR_IACC_Pos              (5UL)                     /*!< IOM0 INTCLR: IACC (Bit 5)                             */
#define IOM0_INTCLR_IACC_Msk              (0x20UL)                  /*!< IOM0 INTCLR: IACC (Bitfield-Mask: 0x01)               */
#define IOM0_INTCLR_NAK_Pos               (4UL)                     /*!< IOM0 INTCLR: NAK (Bit 4)                              */
#define IOM0_INTCLR_NAK_Msk               (0x10UL)                  /*!< IOM0 INTCLR: NAK (Bitfield-Mask: 0x01)                */
#define IOM0_INTCLR_FOVFL_Pos             (3UL)                     /*!< IOM0 INTCLR: FOVFL (Bit 3)                            */
#define IOM0_INTCLR_FOVFL_Msk             (0x8UL)                   /*!< IOM0 INTCLR: FOVFL (Bitfield-Mask: 0x01)              */
#define IOM0_INTCLR_FUNDFL_Pos            (2UL)                     /*!< IOM0 INTCLR: FUNDFL (Bit 2)                           */
#define IOM0_INTCLR_FUNDFL_Msk            (0x4UL)                   /*!< IOM0 INTCLR: FUNDFL (Bitfield-Mask: 0x01)             */
#define IOM0_INTCLR_THR_Pos               (1UL)                     /*!< IOM0 INTCLR: THR (Bit 1)                              */
#define IOM0_INTCLR_THR_Msk               (0x2UL)                   /*!< IOM0 INTCLR: THR (Bitfield-Mask: 0x01)                */
#define IOM0_INTCLR_CMDCMP_Pos            (0UL)                     /*!< IOM0 INTCLR: CMDCMP (Bit 0)                           */
#define IOM0_INTCLR_CMDCMP_Msk            (0x1UL)                   /*!< IOM0 INTCLR: CMDCMP (Bitfield-Mask: 0x01)             */
/* ========================================================  INTSET  ========================================================= */
#define IOM0_INTSET_CQERR_Pos             (14UL)                    /*!< IOM0 INTSET: CQERR (Bit 14)                           */
#define IOM0_INTSET_CQERR_Msk             (0x4000UL)                /*!< IOM0 INTSET: CQERR (Bitfield-Mask: 0x01)              */
#define IOM0_INTSET_CQUPD_Pos             (13UL)                    /*!< IOM0 INTSET: CQUPD (Bit 13)                           */
#define IOM0_INTSET_CQUPD_Msk             (0x2000UL)                /*!< IOM0 INTSET: CQUPD (Bitfield-Mask: 0x01)              */
#define IOM0_INTSET_CQPAUSED_Pos          (12UL)                    /*!< IOM0 INTSET: CQPAUSED (Bit 12)                        */
#define IOM0_INTSET_CQPAUSED_Msk          (0x1000UL)                /*!< IOM0 INTSET: CQPAUSED (Bitfield-Mask: 0x01)           */
#define IOM0_INTSET_DERR_Pos              (11UL)                    /*!< IOM0 INTSET: DERR (Bit 11)                            */
#define IOM0_INTSET_DERR_Msk              (0x800UL)                 /*!< IOM0 INTSET: DERR (Bitfield-Mask: 0x01)               */
#define IOM0_INTSET_DCMP_Pos              (10UL)                    /*!< IOM0 INTSET: DCMP (Bit 10)                            */
#define IOM0_INTSET_DCMP_Msk              (0x400UL)                 /*!< IOM0 INTSET: DCMP (Bitfield-Mask: 0x01)               */
#define IOM0_INTSET_ARB_Pos               (9UL)                     /*!< IOM0 INTSET: ARB (Bit 9)                              */
#define IOM0_INTSET_ARB_Msk               (0x200UL)                 /*!< IOM0 INTSET: ARB (Bitfield-Mask: 0x01)                */
#define IOM0_INTSET_STOP_Pos              (8UL)                     /*!< IOM0 INTSET: STOP (Bit 8)                             */
#define IOM0_INTSET_STOP_Msk              (0x100UL)                 /*!< IOM0 INTSET: STOP (Bitfield-Mask: 0x01)               */
#define IOM0_INTSET_START_Pos             (7UL)                     /*!< IOM0 INTSET: START (Bit 7)                            */
#define IOM0_INTSET_START_Msk             (0x80UL)                  /*!< IOM0 INTSET: START (Bitfield-Mask: 0x01)              */
#define IOM0_INTSET_ICMD_Pos              (6UL)                     /*!< IOM0 INTSET: ICMD (Bit 6)                             */
#define IOM0_INTSET_ICMD_Msk              (0x40UL)                  /*!< IOM0 INTSET: ICMD (Bitfield-Mask: 0x01)               */
#define IOM0_INTSET_IACC_Pos              (5UL)                     /*!< IOM0 INTSET: IACC (Bit 5)                             */
#define IOM0_INTSET_IACC_Msk              (0x20UL)                  /*!< IOM0 INTSET: IACC (Bitfield-Mask: 0x01)               */
#define IOM0_INTSET_NAK_Pos               (4UL)                     /*!< IOM0 INTSET: NAK (Bit 4)                              */
#define IOM0_INTSET_NAK_Msk               (0x10UL)                  /*!< IOM0 INTSET: NAK (Bitfield-Mask: 0x01)                */
#define IOM0_INTSET_FOVFL_Pos             (3UL)                     /*!< IOM0 INTSET: FOVFL (Bit 3)                            */
#define IOM0_INTSET_FOVFL_Msk             (0x8UL)                   /*!< IOM0 INTSET: FOVFL (Bitfield-Mask: 0x01)              */
#define IOM0_INTSET_FUNDFL_Pos            (2UL)                     /*!< IOM0 INTSET: FUNDFL (Bit 2)                           */
#define IOM0_INTSET_FUNDFL_Msk            (0x4UL)                   /*!< IOM0 INTSET: FUNDFL (Bitfield-Mask: 0x01)             */
#define IOM0_INTSET_THR_Pos               (1UL)                     /*!< IOM0 INTSET: THR (Bit 1)                              */
#define IOM0_INTSET_THR_Msk               (0x2UL)                   /*!< IOM0 INTSET: THR (Bitfield-Mask: 0x01)                */
#define IOM0_INTSET_CMDCMP_Pos            (0UL)                     /*!< IOM0 INTSET: CMDCMP (Bit 0)                           */
#define IOM0_INTSET_CMDCMP_Msk            (0x1UL)                   /*!< IOM0 INTSET: CMDCMP (Bitfield-Mask: 0x01)             */
/* ========================================================  CLKCFG  ========================================================= */
#define IOM0_CLKCFG_TOTPER_Pos            (24UL)                    /*!< IOM0 CLKCFG: TOTPER (Bit 24)                          */
#define IOM0_CLKCFG_TOTPER_Msk            (0xff000000UL)            /*!< IOM0 CLKCFG: TOTPER (Bitfield-Mask: 0xff)             */
#define IOM0_CLKCFG_LOWPER_Pos            (16UL)                    /*!< IOM0 CLKCFG: LOWPER (Bit 16)                          */
#define IOM0_CLKCFG_LOWPER_Msk            (0xff0000UL)              /*!< IOM0 CLKCFG: LOWPER (Bitfield-Mask: 0xff)             */
#define IOM0_CLKCFG_DIVEN_Pos             (12UL)                    /*!< IOM0 CLKCFG: DIVEN (Bit 12)                           */
#define IOM0_CLKCFG_DIVEN_Msk             (0x1000UL)                /*!< IOM0 CLKCFG: DIVEN (Bitfield-Mask: 0x01)              */
#define IOM0_CLKCFG_DIV3_Pos              (11UL)                    /*!< IOM0 CLKCFG: DIV3 (Bit 11)                            */
#define IOM0_CLKCFG_DIV3_Msk              (0x800UL)                 /*!< IOM0 CLKCFG: DIV3 (Bitfield-Mask: 0x01)               */
#define IOM0_CLKCFG_FSEL_Pos              (8UL)                     /*!< IOM0 CLKCFG: FSEL (Bit 8)                             */
#define IOM0_CLKCFG_FSEL_Msk              (0x700UL)                 /*!< IOM0 CLKCFG: FSEL (Bitfield-Mask: 0x07)               */
#define IOM0_CLKCFG_IOCLKEN_Pos           (0UL)                     /*!< IOM0 CLKCFG: IOCLKEN (Bit 0)                          */
#define IOM0_CLKCFG_IOCLKEN_Msk           (0x1UL)                   /*!< IOM0 CLKCFG: IOCLKEN (Bitfield-Mask: 0x01)            */
/* ======================================================  SUBMODCTRL  ======================================================= */
#define IOM0_SUBMODCTRL_SMOD1TYPE_Pos     (5UL)                     /*!< IOM0 SUBMODCTRL: SMOD1TYPE (Bit 5)                    */
#define IOM0_SUBMODCTRL_SMOD1TYPE_Msk     (0xe0UL)                  /*!< IOM0 SUBMODCTRL: SMOD1TYPE (Bitfield-Mask: 0x07)      */
#define IOM0_SUBMODCTRL_SMOD1EN_Pos       (4UL)                     /*!< IOM0 SUBMODCTRL: SMOD1EN (Bit 4)                      */
#define IOM0_SUBMODCTRL_SMOD1EN_Msk       (0x10UL)                  /*!< IOM0 SUBMODCTRL: SMOD1EN (Bitfield-Mask: 0x01)        */
#define IOM0_SUBMODCTRL_SMOD0TYPE_Pos     (1UL)                     /*!< IOM0 SUBMODCTRL: SMOD0TYPE (Bit 1)                    */
#define IOM0_SUBMODCTRL_SMOD0TYPE_Msk     (0xeUL)                   /*!< IOM0 SUBMODCTRL: SMOD0TYPE (Bitfield-Mask: 0x07)      */
#define IOM0_SUBMODCTRL_SMOD0EN_Pos       (0UL)                     /*!< IOM0 SUBMODCTRL: SMOD0EN (Bit 0)                      */
#define IOM0_SUBMODCTRL_SMOD0EN_Msk       (0x1UL)                   /*!< IOM0 SUBMODCTRL: SMOD0EN (Bitfield-Mask: 0x01)        */
/* ==========================================================  CMD  ========================================================== */
#define IOM0_CMD_OFFSETLO_Pos             (24UL)                    /*!< IOM0 CMD: OFFSETLO (Bit 24)                           */
