sparkfun/Arduino_Apollo3/cores/arduino/am_sdk_ap3/CMSIS/AmbiqMicro/Include/apollo3c.h
/* ========================================================  CHIPPN  ========================================================= */
#define MCUCTRL_CHIPPN_PARTNUM_Pos        (0UL)                     /*!< MCUCTRL CHIPPN: PARTNUM (Bit 0)                       */
#define MCUCTRL_CHIPPN_PARTNUM_Msk        (0xffffffffUL)            /*!< MCUCTRL CHIPPN: PARTNUM (Bitfield-Mask: 0xffffffff)   */
/* ========================================================  CHIPID0  ======================================================== */
#define MCUCTRL_CHIPID0_CHIPID0_Pos       (0UL)                     /*!< MCUCTRL CHIPID0: CHIPID0 (Bit 0)                      */
#define MCUCTRL_CHIPID0_CHIPID0_Msk       (0xffffffffUL)            /*!< MCUCTRL CHIPID0: CHIPID0 (Bitfield-Mask: 0xffffffff)  */
/* ========================================================  CHIPID1  ======================================================== */
#define MCUCTRL_CHIPID1_CHIPID1_Pos       (0UL)                     /*!< MCUCTRL CHIPID1: CHIPID1 (Bit 0)                      */
#define MCUCTRL_CHIPID1_CHIPID1_Msk       (0xffffffffUL)            /*!< MCUCTRL CHIPID1: CHIPID1 (Bitfield-Mask: 0xffffffff)  */
/* ========================================================  CHIPREV  ======================================================== */
#define MCUCTRL_CHIPREV_SIPART_Pos        (8UL)                     /*!< MCUCTRL CHIPREV: SIPART (Bit 8)                       */
#define MCUCTRL_CHIPREV_SIPART_Msk        (0xfff00UL)               /*!< MCUCTRL CHIPREV: SIPART (Bitfield-Mask: 0xfff)        */
#define MCUCTRL_CHIPREV_REVMAJ_Pos        (4UL)                     /*!< MCUCTRL CHIPREV: REVMAJ (Bit 4)                       */
#define MCUCTRL_CHIPREV_REVMAJ_Msk        (0xf0UL)                  /*!< MCUCTRL CHIPREV: REVMAJ (Bitfield-Mask: 0x0f)         */
#define MCUCTRL_CHIPREV_REVMIN_Pos        (0UL)                     /*!< MCUCTRL CHIPREV: REVMIN (Bit 0)                       */
#define MCUCTRL_CHIPREV_REVMIN_Msk        (0xfUL)                   /*!< MCUCTRL CHIPREV: REVMIN (Bitfield-Mask: 0x0f)         */
/* =======================================================  VENDORID  ======================================================== */
#define MCUCTRL_VENDORID_VENDORID_Pos     (0UL)                     /*!< MCUCTRL VENDORID: VENDORID (Bit 0)                    */
#define MCUCTRL_VENDORID_VENDORID_Msk     (0xffffffffUL)            /*!< MCUCTRL VENDORID: VENDORID (Bitfield-Mask: 0xffffffff) */
/* ==========================================================  SKU  ========================================================== */
#define MCUCTRL_SKU_SECBOOT_Pos           (2UL)                     /*!< MCUCTRL SKU: SECBOOT (Bit 2)                          */
#define MCUCTRL_SKU_SECBOOT_Msk           (0x4UL)                   /*!< MCUCTRL SKU: SECBOOT (Bitfield-Mask: 0x01)            */
#define MCUCTRL_SKU_ALLOWBLE_Pos          (1UL)                     /*!< MCUCTRL SKU: ALLOWBLE (Bit 1)                         */
#define MCUCTRL_SKU_ALLOWBLE_Msk          (0x2UL)                   /*!< MCUCTRL SKU: ALLOWBLE (Bitfield-Mask: 0x01)           */
#define MCUCTRL_SKU_ALLOWBURST_Pos        (0UL)                     /*!< MCUCTRL SKU: ALLOWBURST (Bit 0)                       */
#define MCUCTRL_SKU_ALLOWBURST_Msk        (0x1UL)                   /*!< MCUCTRL SKU: ALLOWBURST (Bitfield-Mask: 0x01)         */
/* =====================================================  FEATUREENABLE  ===================================================== */
#define MCUCTRL_FEATUREENABLE_BURSTAVAIL_Pos (6UL)                  /*!< MCUCTRL FEATUREENABLE: BURSTAVAIL (Bit 6)             */
#define MCUCTRL_FEATUREENABLE_BURSTAVAIL_Msk (0x40UL)               /*!< MCUCTRL FEATUREENABLE: BURSTAVAIL (Bitfield-Mask: 0x01) */
#define MCUCTRL_FEATUREENABLE_BURSTACK_Pos (5UL)                    /*!< MCUCTRL FEATUREENABLE: BURSTACK (Bit 5)               */
#define MCUCTRL_FEATUREENABLE_BURSTACK_Msk (0x20UL)                 /*!< MCUCTRL FEATUREENABLE: BURSTACK (Bitfield-Mask: 0x01) */
#define MCUCTRL_FEATUREENABLE_BURSTREQ_Pos (4UL)                    /*!< MCUCTRL FEATUREENABLE: BURSTREQ (Bit 4)               */
#define MCUCTRL_FEATUREENABLE_BURSTREQ_Msk (0x10UL)                 /*!< MCUCTRL FEATUREENABLE: BURSTREQ (Bitfield-Mask: 0x01) */
#define MCUCTRL_FEATUREENABLE_BLEAVAIL_Pos (2UL)                    /*!< MCUCTRL FEATUREENABLE: BLEAVAIL (Bit 2)               */
#define MCUCTRL_FEATUREENABLE_BLEAVAIL_Msk (0x4UL)                  /*!< MCUCTRL FEATUREENABLE: BLEAVAIL (Bitfield-Mask: 0x01) */
#define MCUCTRL_FEATUREENABLE_BLEACK_Pos  (1UL)                     /*!< MCUCTRL FEATUREENABLE: BLEACK (Bit 1)                 */
#define MCUCTRL_FEATUREENABLE_BLEACK_Msk  (0x2UL)                   /*!< MCUCTRL FEATUREENABLE: BLEACK (Bitfield-Mask: 0x01)   */
#define MCUCTRL_FEATUREENABLE_BLEREQ_Pos  (0UL)                     /*!< MCUCTRL FEATUREENABLE: BLEREQ (Bit 0)                 */
#define MCUCTRL_FEATUREENABLE_BLEREQ_Msk  (0x1UL)                   /*!< MCUCTRL FEATUREENABLE: BLEREQ (Bitfield-Mask: 0x01)   */
/* =======================================================  DEBUGGER  ======================================================== */
#define MCUCTRL_DEBUGGER_LOCKOUT_Pos      (0UL)                     /*!< MCUCTRL DEBUGGER: LOCKOUT (Bit 0)                     */
#define MCUCTRL_DEBUGGER_LOCKOUT_Msk      (0x1UL)                   /*!< MCUCTRL DEBUGGER: LOCKOUT (Bitfield-Mask: 0x01)       */
/* =================================================  DMASRAMWRITEPROTECT2  ================================================== */
#define MCUCTRL_DMASRAMWRITEPROTECT2_DMA_WPROT2_Pos (0UL)           /*!< MCUCTRL DMASRAMWRITEPROTECT2: DMA_WPROT2 (Bit 0)      */
#define MCUCTRL_DMASRAMWRITEPROTECT2_DMA_WPROT2_Msk (0xffffffffUL)  /*!< MCUCTRL DMASRAMWRITEPROTECT2: DMA_WPROT2 (Bitfield-Mask: 0xffffffff) */
/* ========================================================  BODCTRL  ======================================================== */
#define MCUCTRL_BODCTRL_BODHVREFSEL_Pos   (5UL)                     /*!< MCUCTRL BODCTRL: BODHVREFSEL (Bit 5)                  */
#define MCUCTRL_BODCTRL_BODHVREFSEL_Msk   (0x20UL)                  /*!< MCUCTRL BODCTRL: BODHVREFSEL (Bitfield-Mask: 0x01)    */
#define MCUCTRL_BODCTRL_BODLVREFSEL_Pos   (4UL)                     /*!< MCUCTRL BODCTRL: BODLVREFSEL (Bit 4)                  */
#define MCUCTRL_BODCTRL_BODLVREFSEL_Msk   (0x10UL)                  /*!< MCUCTRL BODCTRL: BODLVREFSEL (Bitfield-Mask: 0x01)    */
#define MCUCTRL_BODCTRL_BODFPWD_Pos       (3UL)                     /*!< MCUCTRL BODCTRL: BODFPWD (Bit 3)                      */
#define MCUCTRL_BODCTRL_BODFPWD_Msk       (0x8UL)                   /*!< MCUCTRL BODCTRL: BODFPWD (Bitfield-Mask: 0x01)        */
#define MCUCTRL_BODCTRL_BODCPWD_Pos       (2UL)                     /*!< MCUCTRL BODCTRL: BODCPWD (Bit 2)                      */
#define MCUCTRL_BODCTRL_BODCPWD_Msk       (0x4UL)                   /*!< MCUCTRL BODCTRL: BODCPWD (Bitfield-Mask: 0x01)        */
#define MCUCTRL_BODCTRL_BODHPWD_Pos       (1UL)                     /*!< MCUCTRL BODCTRL: BODHPWD (Bit 1)                      */
#define MCUCTRL_BODCTRL_BODHPWD_Msk       (0x2UL)                   /*!< MCUCTRL BODCTRL: BODHPWD (Bitfield-Mask: 0x01)        */
#define MCUCTRL_BODCTRL_BODLPWD_Pos       (0UL)                     /*!< MCUCTRL BODCTRL: BODLPWD (Bit 0)                      */
#define MCUCTRL_BODCTRL_BODLPWD_Msk       (0x1UL)                   /*!< MCUCTRL BODCTRL: BODLPWD (Bitfield-Mask: 0x01)        */
/* =======================================================  ADCPWRDLY  ======================================================= */
#define MCUCTRL_ADCPWRDLY_ADCPWR1_Pos     (8UL)                     /*!< MCUCTRL ADCPWRDLY: ADCPWR1 (Bit 8)                    */
#define MCUCTRL_ADCPWRDLY_ADCPWR1_Msk     (0xff00UL)                /*!< MCUCTRL ADCPWRDLY: ADCPWR1 (Bitfield-Mask: 0xff)      */
#define MCUCTRL_ADCPWRDLY_ADCPWR0_Pos     (0UL)                     /*!< MCUCTRL ADCPWRDLY: ADCPWR0 (Bit 0)                    */
#define MCUCTRL_ADCPWRDLY_ADCPWR0_Msk     (0xffUL)                  /*!< MCUCTRL ADCPWRDLY: ADCPWR0 (Bitfield-Mask: 0xff)      */
/* ========================================================  ADCCAL  ========================================================= */
#define MCUCTRL_ADCCAL_ADCCALIBRATED_Pos  (1UL)                     /*!< MCUCTRL ADCCAL: ADCCALIBRATED (Bit 1)                 */
#define MCUCTRL_ADCCAL_ADCCALIBRATED_Msk  (0x2UL)                   /*!< MCUCTRL ADCCAL: ADCCALIBRATED (Bitfield-Mask: 0x01)   */
#define MCUCTRL_ADCCAL_CALONPWRUP_Pos     (0UL)                     /*!< MCUCTRL ADCCAL: CALONPWRUP (Bit 0)                    */
#define MCUCTRL_ADCCAL_CALONPWRUP_Msk     (0x1UL)                   /*!< MCUCTRL ADCCAL: CALONPWRUP (Bitfield-Mask: 0x01)      */
/* ======================================================  ADCBATTLOAD  ====================================================== */
#define MCUCTRL_ADCBATTLOAD_BATTLOAD_Pos  (0UL)                     /*!< MCUCTRL ADCBATTLOAD: BATTLOAD (Bit 0)                 */
#define MCUCTRL_ADCBATTLOAD_BATTLOAD_Msk  (0x1UL)                   /*!< MCUCTRL ADCBATTLOAD: BATTLOAD (Bitfield-Mask: 0x01)   */
/* ========================================================  ADCTRIM  ======================================================== */
#define MCUCTRL_ADCTRIM_ADCRFBUFIBTRIM_Pos (11UL)                   /*!< MCUCTRL ADCTRIM: ADCRFBUFIBTRIM (Bit 11)              */
#define MCUCTRL_ADCTRIM_ADCRFBUFIBTRIM_Msk (0x1800UL)               /*!< MCUCTRL ADCTRIM: ADCRFBUFIBTRIM (Bitfield-Mask: 0x03) */
#define MCUCTRL_ADCTRIM_ADCREFBUFTRIM_Pos (6UL)                     /*!< MCUCTRL ADCTRIM: ADCREFBUFTRIM (Bit 6)                */
#define MCUCTRL_ADCTRIM_ADCREFBUFTRIM_Msk (0x7c0UL)                 /*!< MCUCTRL ADCTRIM: ADCREFBUFTRIM (Bitfield-Mask: 0x1f)  */
#define MCUCTRL_ADCTRIM_ADCREFKEEPIBTRIM_Pos (0UL)                  /*!< MCUCTRL ADCTRIM: ADCREFKEEPIBTRIM (Bit 0)             */
#define MCUCTRL_ADCTRIM_ADCREFKEEPIBTRIM_Msk (0x3UL)                /*!< MCUCTRL ADCTRIM: ADCREFKEEPIBTRIM (Bitfield-Mask: 0x03) */
/* ======================================================  ADCREFCOMP  ======================================================= */
#define MCUCTRL_ADCREFCOMP_ADCRFCMPEN_Pos (16UL)                    /*!< MCUCTRL ADCREFCOMP: ADCRFCMPEN (Bit 16)               */
#define MCUCTRL_ADCREFCOMP_ADCRFCMPEN_Msk (0x10000UL)               /*!< MCUCTRL ADCREFCOMP: ADCRFCMPEN (Bitfield-Mask: 0x01)  */
#define MCUCTRL_ADCREFCOMP_ADCREFKEEPTRIM_Pos (8UL)                 /*!< MCUCTRL ADCREFCOMP: ADCREFKEEPTRIM (Bit 8)            */
#define MCUCTRL_ADCREFCOMP_ADCREFKEEPTRIM_Msk (0x1f00UL)            /*!< MCUCTRL ADCREFCOMP: ADCREFKEEPTRIM (Bitfield-Mask: 0x1f) */
#define MCUCTRL_ADCREFCOMP_ADC_REFCOMP_OUT_Pos (0UL)                /*!< MCUCTRL ADCREFCOMP: ADC_REFCOMP_OUT (Bit 0)           */
#define MCUCTRL_ADCREFCOMP_ADC_REFCOMP_OUT_Msk (0x1UL)              /*!< MCUCTRL ADCREFCOMP: ADC_REFCOMP_OUT (Bitfield-Mask: 0x01) */
/* =======================================================  XTALCTRL  ======================================================== */
#define MCUCTRL_XTALCTRL_XTALICOMPTRIM_Pos (8UL)                    /*!< MCUCTRL XTALCTRL: XTALICOMPTRIM (Bit 8)               */
#define MCUCTRL_XTALCTRL_XTALICOMPTRIM_Msk (0x300UL)                /*!< MCUCTRL XTALCTRL: XTALICOMPTRIM (Bitfield-Mask: 0x03) */
#define MCUCTRL_XTALCTRL_XTALIBUFTRIM_Pos (6UL)                     /*!< MCUCTRL XTALCTRL: XTALIBUFTRIM (Bit 6)                */
#define MCUCTRL_XTALCTRL_XTALIBUFTRIM_Msk (0xc0UL)                  /*!< MCUCTRL XTALCTRL: XTALIBUFTRIM (Bitfield-Mask: 0x03)  */
#define MCUCTRL_XTALCTRL_PWDBODXTAL_Pos   (5UL)                     /*!< MCUCTRL XTALCTRL: PWDBODXTAL (Bit 5)                  */
#define MCUCTRL_XTALCTRL_PWDBODXTAL_Msk   (0x20UL)                  /*!< MCUCTRL XTALCTRL: PWDBODXTAL (Bitfield-Mask: 0x01)    */
#define MCUCTRL_XTALCTRL_PDNBCMPRXTAL_Pos (4UL)                     /*!< MCUCTRL XTALCTRL: PDNBCMPRXTAL (Bit 4)                */
#define MCUCTRL_XTALCTRL_PDNBCMPRXTAL_Msk (0x10UL)                  /*!< MCUCTRL XTALCTRL: PDNBCMPRXTAL (Bitfield-Mask: 0x01)  */
#define MCUCTRL_XTALCTRL_PDNBCOREXTAL_Pos (3UL)                     /*!< MCUCTRL XTALCTRL: PDNBCOREXTAL (Bit 3)                */
#define MCUCTRL_XTALCTRL_PDNBCOREXTAL_Msk (0x8UL)                   /*!< MCUCTRL XTALCTRL: PDNBCOREXTAL (Bitfield-Mask: 0x01)  */
#define MCUCTRL_XTALCTRL_BYPCMPRXTAL_Pos  (2UL)                     /*!< MCUCTRL XTALCTRL: BYPCMPRXTAL (Bit 2)                 */
#define MCUCTRL_XTALCTRL_BYPCMPRXTAL_Msk  (0x4UL)                   /*!< MCUCTRL XTALCTRL: BYPCMPRXTAL (Bitfield-Mask: 0x01)   */
#define MCUCTRL_XTALCTRL_FDBKDSBLXTAL_Pos (1UL)                     /*!< MCUCTRL XTALCTRL: FDBKDSBLXTAL (Bit 1)                */
#define MCUCTRL_XTALCTRL_FDBKDSBLXTAL_Msk (0x2UL)                   /*!< MCUCTRL XTALCTRL: FDBKDSBLXTAL (Bitfield-Mask: 0x01)  */
#define MCUCTRL_XTALCTRL_XTALSWE_Pos      (0UL)                     /*!< MCUCTRL XTALCTRL: XTALSWE (Bit 0)                     */
#define MCUCTRL_XTALCTRL_XTALSWE_Msk      (0x1UL)                   /*!< MCUCTRL XTALCTRL: XTALSWE (Bitfield-Mask: 0x01)       */
/* ======================================================  XTALGENCTRL  ====================================================== */
#define MCUCTRL_XTALGENCTRL_XTALKSBIASTRIM_Pos (8UL)                /*!< MCUCTRL XTALGENCTRL: XTALKSBIASTRIM (Bit 8)           */
#define MCUCTRL_XTALGENCTRL_XTALKSBIASTRIM_Msk (0x3f00UL)           /*!< MCUCTRL XTALGENCTRL: XTALKSBIASTRIM (Bitfield-Mask: 0x3f) */
#define MCUCTRL_XTALGENCTRL_XTALBIASTRIM_Pos (2UL)                  /*!< MCUCTRL XTALGENCTRL: XTALBIASTRIM (Bit 2)             */
#define MCUCTRL_XTALGENCTRL_XTALBIASTRIM_Msk (0xfcUL)               /*!< MCUCTRL XTALGENCTRL: XTALBIASTRIM (Bitfield-Mask: 0x3f) */
#define MCUCTRL_XTALGENCTRL_ACWARMUP_Pos  (0UL)                     /*!< MCUCTRL XTALGENCTRL: ACWARMUP (Bit 0)                 */
#define MCUCTRL_XTALGENCTRL_ACWARMUP_Msk  (0x3UL)                   /*!< MCUCTRL XTALGENCTRL: ACWARMUP (Bitfield-Mask: 0x03)   */
/* =======================================================  MISCCTRL  ======================================================== */
#define MCUCTRL_MISCCTRL_BLE_RESETN_Pos   (5UL)                     /*!< MCUCTRL MISCCTRL: BLE_RESETN (Bit 5)                  */
#define MCUCTRL_MISCCTRL_BLE_RESETN_Msk   (0x20UL)                  /*!< MCUCTRL MISCCTRL: BLE_RESETN (Bitfield-Mask: 0x01)    */
#define MCUCTRL_MISCCTRL_RESERVED_RW_0_Pos (0UL)                    /*!< MCUCTRL MISCCTRL: RESERVED_RW_0 (Bit 0)               */
#define MCUCTRL_MISCCTRL_RESERVED_RW_0_Msk (0x1fUL)                 /*!< MCUCTRL MISCCTRL: RESERVED_RW_0 (Bitfield-Mask: 0x1f) */
/* ======================================================  BOOTLOADER  ======================================================= */
#define MCUCTRL_BOOTLOADER_SECBOOTONRST_Pos (30UL)                  /*!< MCUCTRL BOOTLOADER: SECBOOTONRST (Bit 30)             */
#define MCUCTRL_BOOTLOADER_SECBOOTONRST_Msk (0xc0000000UL)          /*!< MCUCTRL BOOTLOADER: SECBOOTONRST (Bitfield-Mask: 0x03) */
#define MCUCTRL_BOOTLOADER_SECBOOT_Pos    (28UL)                    /*!< MCUCTRL BOOTLOADER: SECBOOT (Bit 28)                  */
#define MCUCTRL_BOOTLOADER_SECBOOT_Msk    (0x30000000UL)            /*!< MCUCTRL BOOTLOADER: SECBOOT (Bitfield-Mask: 0x03)     */
#define MCUCTRL_BOOTLOADER_SECBOOTFEATURE_Pos (26UL)                /*!< MCUCTRL BOOTLOADER: SECBOOTFEATURE (Bit 26)           */
#define MCUCTRL_BOOTLOADER_SECBOOTFEATURE_Msk (0xc000000UL)         /*!< MCUCTRL BOOTLOADER: SECBOOTFEATURE (Bitfield-Mask: 0x03) */
#define MCUCTRL_BOOTLOADER_PROTLOCK_Pos   (2UL)                     /*!< MCUCTRL BOOTLOADER: PROTLOCK (Bit 2)                  */
#define MCUCTRL_BOOTLOADER_PROTLOCK_Msk   (0x4UL)                   /*!< MCUCTRL BOOTLOADER: PROTLOCK (Bitfield-Mask: 0x01)    */
#define MCUCTRL_BOOTLOADER_SBLOCK_Pos     (1UL)                     /*!< MCUCTRL BOOTLOADER: SBLOCK (Bit 1)                    */
#define MCUCTRL_BOOTLOADER_SBLOCK_Msk     (0x2UL)                   /*!< MCUCTRL BOOTLOADER: SBLOCK (Bitfield-Mask: 0x01)      */
#define MCUCTRL_BOOTLOADER_BOOTLOADERLOW_Pos (0UL)                  /*!< MCUCTRL BOOTLOADER: BOOTLOADERLOW (Bit 0)             */
#define MCUCTRL_BOOTLOADER_BOOTLOADERLOW_Msk (0x1UL)                /*!< MCUCTRL BOOTLOADER: BOOTLOADERLOW (Bitfield-Mask: 0x01) */
/* ======================================================  SHADOWVALID  ====================================================== */
#define MCUCTRL_SHADOWVALID_INFO0_VALID_Pos (2UL)                   /*!< MCUCTRL SHADOWVALID: INFO0_VALID (Bit 2)              */
#define MCUCTRL_SHADOWVALID_INFO0_VALID_Msk (0x4UL)                 /*!< MCUCTRL SHADOWVALID: INFO0_VALID (Bitfield-Mask: 0x01) */
#define MCUCTRL_SHADOWVALID_BLDSLEEP_Pos  (1UL)                     /*!< MCUCTRL SHADOWVALID: BLDSLEEP (Bit 1)                 */
#define MCUCTRL_SHADOWVALID_BLDSLEEP_Msk  (0x2UL)                   /*!< MCUCTRL SHADOWVALID: BLDSLEEP (Bitfield-Mask: 0x01)   */
#define MCUCTRL_SHADOWVALID_VALID_Pos     (0UL)                     /*!< MCUCTRL SHADOWVALID: VALID (Bit 0)                    */
#define MCUCTRL_SHADOWVALID_VALID_Msk     (0x1UL)                   /*!< MCUCTRL SHADOWVALID: VALID (Bitfield-Mask: 0x01)      */
/* =======================================================  SCRATCH0  ======================================================== */
#define MCUCTRL_SCRATCH0_SCRATCH0_Pos     (0UL)                     /*!< MCUCTRL SCRATCH0: SCRATCH0 (Bit 0)                    */
#define MCUCTRL_SCRATCH0_SCRATCH0_Msk     (0xffffffffUL)            /*!< MCUCTRL SCRATCH0: SCRATCH0 (Bitfield-Mask: 0xffffffff) */
/* =======================================================  SCRATCH1  ======================================================== */
#define MCUCTRL_SCRATCH1_SCRATCH1_Pos     (0UL)                     /*!< MCUCTRL SCRATCH1: SCRATCH1 (Bit 0)                    */
#define MCUCTRL_SCRATCH1_SCRATCH1_Msk     (0xffffffffUL)            /*!< MCUCTRL SCRATCH1: SCRATCH1 (Bitfield-Mask: 0xffffffff) */
/* ====================================================  ICODEFAULTADDR  ===================================================== */
#define MCUCTRL_ICODEFAULTADDR_ICODEFAULTADDR_Pos (0UL)             /*!< MCUCTRL ICODEFAULTADDR: ICODEFAULTADDR (Bit 0)        */
#define MCUCTRL_ICODEFAULTADDR_ICODEFAULTADDR_Msk (0xffffffffUL)    /*!< MCUCTRL ICODEFAULTADDR: ICODEFAULTADDR (Bitfield-Mask: 0xffffffff) */
/* ====================================================  DCODEFAULTADDR  ===================================================== */
#define MCUCTRL_DCODEFAULTADDR_DCODEFAULTADDR_Pos (0UL)             /*!< MCUCTRL DCODEFAULTADDR: DCODEFAULTADDR (Bit 0)        */
#define MCUCTRL_DCODEFAULTADDR_DCODEFAULTADDR_Msk (0xffffffffUL)    /*!< MCUCTRL DCODEFAULTADDR: DCODEFAULTADDR (Bitfield-Mask: 0xffffffff) */
/* =====================================================  SYSFAULTADDR  ====================================================== */
#define MCUCTRL_SYSFAULTADDR_SYSFAULTADDR_Pos (0UL)                 /*!< MCUCTRL SYSFAULTADDR: SYSFAULTADDR (Bit 0)            */
#define MCUCTRL_SYSFAULTADDR_SYSFAULTADDR_Msk (0xffffffffUL)        /*!< MCUCTRL SYSFAULTADDR: SYSFAULTADDR (Bitfield-Mask: 0xffffffff) */
/* ======================================================  FAULTSTATUS  ====================================================== */
#define MCUCTRL_FAULTSTATUS_SYSFAULT_Pos  (2UL)                     /*!< MCUCTRL FAULTSTATUS: SYSFAULT (Bit 2)                 */
#define MCUCTRL_FAULTSTATUS_SYSFAULT_Msk  (0x4UL)                   /*!< MCUCTRL FAULTSTATUS: SYSFAULT (Bitfield-Mask: 0x01)   */
#define MCUCTRL_FAULTSTATUS_DCODEFAULT_Pos (1UL)                    /*!< MCUCTRL FAULTSTATUS: DCODEFAULT (Bit 1)               */
#define MCUCTRL_FAULTSTATUS_DCODEFAULT_Msk (0x2UL)                  /*!< MCUCTRL FAULTSTATUS: DCODEFAULT (Bitfield-Mask: 0x01) */
#define MCUCTRL_FAULTSTATUS_ICODEFAULT_Pos (0UL)                    /*!< MCUCTRL FAULTSTATUS: ICODEFAULT (Bit 0)               */
#define MCUCTRL_FAULTSTATUS_ICODEFAULT_Msk (0x1UL)                  /*!< MCUCTRL FAULTSTATUS: ICODEFAULT (Bitfield-Mask: 0x01) */
/* ====================================================  FAULTCAPTUREEN  ===================================================== */
#define MCUCTRL_FAULTCAPTUREEN_FAULTCAPTUREEN_Pos (0UL)             /*!< MCUCTRL FAULTCAPTUREEN: FAULTCAPTUREEN (Bit 0)        */
#define MCUCTRL_FAULTCAPTUREEN_FAULTCAPTUREEN_Msk (0x1UL)           /*!< MCUCTRL FAULTCAPTUREEN: FAULTCAPTUREEN (Bitfield-Mask: 0x01) */
/* =========================================================  DBGR1  ========================================================= */
#define MCUCTRL_DBGR1_ONETO8_Pos          (0UL)                     /*!< MCUCTRL DBGR1: ONETO8 (Bit 0)                         */
#define MCUCTRL_DBGR1_ONETO8_Msk          (0xffffffffUL)            /*!< MCUCTRL DBGR1: ONETO8 (Bitfield-Mask: 0xffffffff)     */
/* =========================================================  DBGR2  ========================================================= */
#define MCUCTRL_DBGR2_COOLCODE_Pos        (0UL)                     /*!< MCUCTRL DBGR2: COOLCODE (Bit 0)                       */
#define MCUCTRL_DBGR2_COOLCODE_Msk        (0xffffffffUL)            /*!< MCUCTRL DBGR2: COOLCODE (Bitfield-Mask: 0xffffffff)   */
/* =======================================================  PMUENABLE  ======================================================= */
#define MCUCTRL_PMUENABLE_ENABLE_Pos      (0UL)                     /*!< MCUCTRL PMUENABLE: ENABLE (Bit 0)                     */
#define MCUCTRL_PMUENABLE_ENABLE_Msk      (0x1UL)                   /*!< MCUCTRL PMUENABLE: ENABLE (Bitfield-Mask: 0x01)       */
/* =======================================================  TPIUCTRL  ======================================================== */
#define MCUCTRL_TPIUCTRL_CLKSEL_Pos       (8UL)                     /*!< MCUCTRL TPIUCTRL: CLKSEL (Bit 8)                      */
#define MCUCTRL_TPIUCTRL_CLKSEL_Msk       (0x700UL)                 /*!< MCUCTRL TPIUCTRL: CLKSEL (Bitfield-Mask: 0x07)        */
#define MCUCTRL_TPIUCTRL_ENABLE_Pos       (0UL)                     /*!< MCUCTRL TPIUCTRL: ENABLE (Bit 0)                      */
#define MCUCTRL_TPIUCTRL_ENABLE_Msk       (0x1UL)                   /*!< MCUCTRL TPIUCTRL: ENABLE (Bitfield-Mask: 0x01)        */
/* ======================================================  OTAPOINTER  ======================================================= */
#define MCUCTRL_OTAPOINTER_OTAPOINTER_Pos (2UL)                     /*!< MCUCTRL OTAPOINTER: OTAPOINTER (Bit 2)                */
#define MCUCTRL_OTAPOINTER_OTAPOINTER_Msk (0xfffffffcUL)            /*!< MCUCTRL OTAPOINTER: OTAPOINTER (Bitfield-Mask: 0x3fffffff) */
#define MCUCTRL_OTAPOINTER_OTASBLUPDATE_Pos (1UL)                   /*!< MCUCTRL OTAPOINTER: OTASBLUPDATE (Bit 1)              */
#define MCUCTRL_OTAPOINTER_OTASBLUPDATE_Msk (0x2UL)                 /*!< MCUCTRL OTAPOINTER: OTASBLUPDATE (Bitfield-Mask: 0x01) */
#define MCUCTRL_OTAPOINTER_OTAVALID_Pos   (0UL)                     /*!< MCUCTRL OTAPOINTER: OTAVALID (Bit 0)                  */
#define MCUCTRL_OTAPOINTER_OTAVALID_Msk   (0x1UL)                   /*!< MCUCTRL OTAPOINTER: OTAVALID (Bitfield-Mask: 0x01)    */
/* ======================================================  APBDMACTRL  ======================================================= */
#define MCUCTRL_APBDMACTRL_HYSTERESIS_Pos (8UL)                     /*!< MCUCTRL APBDMACTRL: HYSTERESIS (Bit 8)                */
#define MCUCTRL_APBDMACTRL_HYSTERESIS_Msk (0xff00UL)                /*!< MCUCTRL APBDMACTRL: HYSTERESIS (Bitfield-Mask: 0xff)  */
