sparkfun/Arduino_Apollo3/cores/arduino/am_sdk_ap3/CMSIS/AmbiqMicro/Include/apollo3c.h
/* =========================================================  CTRL  ========================================================== */
#define MSPI0_CTRL_XFERBYTES_Pos          (16UL)                    /*!< MSPI0 CTRL: XFERBYTES (Bit 16)                        */
#define MSPI0_CTRL_XFERBYTES_Msk          (0xffff0000UL)            /*!< MSPI0 CTRL: XFERBYTES (Bitfield-Mask: 0xffff)         */
#define MSPI0_CTRL_ENDCX_Pos              (12UL)                    /*!< MSPI0 CTRL: ENDCX (Bit 12)                            */
#define MSPI0_CTRL_ENDCX_Msk              (0x1000UL)                /*!< MSPI0 CTRL: ENDCX (Bitfield-Mask: 0x01)               */
#define MSPI0_CTRL_PIOSCRAMBLE_Pos        (11UL)                    /*!< MSPI0 CTRL: PIOSCRAMBLE (Bit 11)                      */
#define MSPI0_CTRL_PIOSCRAMBLE_Msk        (0x800UL)                 /*!< MSPI0 CTRL: PIOSCRAMBLE (Bitfield-Mask: 0x01)         */
#define MSPI0_CTRL_TXRX_Pos               (10UL)                    /*!< MSPI0 CTRL: TXRX (Bit 10)                             */
#define MSPI0_CTRL_TXRX_Msk               (0x400UL)                 /*!< MSPI0 CTRL: TXRX (Bitfield-Mask: 0x01)                */
#define MSPI0_CTRL_SENDI_Pos              (9UL)                     /*!< MSPI0 CTRL: SENDI (Bit 9)                             */
#define MSPI0_CTRL_SENDI_Msk              (0x200UL)                 /*!< MSPI0 CTRL: SENDI (Bitfield-Mask: 0x01)               */
#define MSPI0_CTRL_SENDA_Pos              (8UL)                     /*!< MSPI0 CTRL: SENDA (Bit 8)                             */
#define MSPI0_CTRL_SENDA_Msk              (0x100UL)                 /*!< MSPI0 CTRL: SENDA (Bitfield-Mask: 0x01)               */
#define MSPI0_CTRL_ENTURN_Pos             (7UL)                     /*!< MSPI0 CTRL: ENTURN (Bit 7)                            */
#define MSPI0_CTRL_ENTURN_Msk             (0x80UL)                  /*!< MSPI0 CTRL: ENTURN (Bitfield-Mask: 0x01)              */
#define MSPI0_CTRL_BIGENDIAN_Pos          (6UL)                     /*!< MSPI0 CTRL: BIGENDIAN (Bit 6)                         */
#define MSPI0_CTRL_BIGENDIAN_Msk          (0x40UL)                  /*!< MSPI0 CTRL: BIGENDIAN (Bitfield-Mask: 0x01)           */
#define MSPI0_CTRL_CONT_Pos               (5UL)                     /*!< MSPI0 CTRL: CONT (Bit 5)                              */
#define MSPI0_CTRL_CONT_Msk               (0x20UL)                  /*!< MSPI0 CTRL: CONT (Bitfield-Mask: 0x01)                */
#define MSPI0_CTRL_ENWLAT_Pos             (4UL)                     /*!< MSPI0 CTRL: ENWLAT (Bit 4)                            */
#define MSPI0_CTRL_ENWLAT_Msk             (0x10UL)                  /*!< MSPI0 CTRL: ENWLAT (Bitfield-Mask: 0x01)              */
#define MSPI0_CTRL_QUADCMD_Pos            (3UL)                     /*!< MSPI0 CTRL: QUADCMD (Bit 3)                           */
#define MSPI0_CTRL_QUADCMD_Msk            (0x8UL)                   /*!< MSPI0 CTRL: QUADCMD (Bitfield-Mask: 0x01)             */
#define MSPI0_CTRL_BUSY_Pos               (2UL)                     /*!< MSPI0 CTRL: BUSY (Bit 2)                              */
#define MSPI0_CTRL_BUSY_Msk               (0x4UL)                   /*!< MSPI0 CTRL: BUSY (Bitfield-Mask: 0x01)                */
#define MSPI0_CTRL_STATUS_Pos             (1UL)                     /*!< MSPI0 CTRL: STATUS (Bit 1)                            */
#define MSPI0_CTRL_STATUS_Msk             (0x2UL)                   /*!< MSPI0 CTRL: STATUS (Bitfield-Mask: 0x01)              */
#define MSPI0_CTRL_START_Pos              (0UL)                     /*!< MSPI0 CTRL: START (Bit 0)                             */
#define MSPI0_CTRL_START_Msk              (0x1UL)                   /*!< MSPI0 CTRL: START (Bitfield-Mask: 0x01)               */
/* ==========================================================  CFG  ========================================================== */
#define MSPI0_CFG_WRITELATENCY_Pos        (20UL)                    /*!< MSPI0 CFG: WRITELATENCY (Bit 20)                      */
#define MSPI0_CFG_WRITELATENCY_Msk        (0x3f00000UL)             /*!< MSPI0 CFG: WRITELATENCY (Bitfield-Mask: 0x3f)         */
#define MSPI0_CFG_CPOL_Pos                (17UL)                    /*!< MSPI0 CFG: CPOL (Bit 17)                              */
#define MSPI0_CFG_CPOL_Msk                (0x20000UL)               /*!< MSPI0 CFG: CPOL (Bitfield-Mask: 0x01)                 */
#define MSPI0_CFG_CPHA_Pos                (16UL)                    /*!< MSPI0 CFG: CPHA (Bit 16)                              */
#define MSPI0_CFG_CPHA_Msk                (0x10000UL)               /*!< MSPI0 CFG: CPHA (Bitfield-Mask: 0x01)                 */
#define MSPI0_CFG_TURNAROUND_Pos          (8UL)                     /*!< MSPI0 CFG: TURNAROUND (Bit 8)                         */
#define MSPI0_CFG_TURNAROUND_Msk          (0x3f00UL)                /*!< MSPI0 CFG: TURNAROUND (Bitfield-Mask: 0x3f)           */
#define MSPI0_CFG_SEPIO_Pos               (7UL)                     /*!< MSPI0 CFG: SEPIO (Bit 7)                              */
#define MSPI0_CFG_SEPIO_Msk               (0x80UL)                  /*!< MSPI0 CFG: SEPIO (Bitfield-Mask: 0x01)                */
#define MSPI0_CFG_ISIZE_Pos               (6UL)                     /*!< MSPI0 CFG: ISIZE (Bit 6)                              */
#define MSPI0_CFG_ISIZE_Msk               (0x40UL)                  /*!< MSPI0 CFG: ISIZE (Bitfield-Mask: 0x01)                */
#define MSPI0_CFG_ASIZE_Pos               (4UL)                     /*!< MSPI0 CFG: ASIZE (Bit 4)                              */
#define MSPI0_CFG_ASIZE_Msk               (0x30UL)                  /*!< MSPI0 CFG: ASIZE (Bitfield-Mask: 0x03)                */
#define MSPI0_CFG_DEVCFG_Pos              (0UL)                     /*!< MSPI0 CFG: DEVCFG (Bit 0)                             */
#define MSPI0_CFG_DEVCFG_Msk              (0xfUL)                   /*!< MSPI0 CFG: DEVCFG (Bitfield-Mask: 0x0f)               */
/* =========================================================  ADDR  ========================================================== */
#define MSPI0_ADDR_ADDR_Pos               (0UL)                     /*!< MSPI0 ADDR: ADDR (Bit 0)                              */
#define MSPI0_ADDR_ADDR_Msk               (0xffffffffUL)            /*!< MSPI0 ADDR: ADDR (Bitfield-Mask: 0xffffffff)          */
/* =========================================================  INSTR  ========================================================= */
#define MSPI0_INSTR_INSTR_Pos             (0UL)                     /*!< MSPI0 INSTR: INSTR (Bit 0)                            */
#define MSPI0_INSTR_INSTR_Msk             (0xffffUL)                /*!< MSPI0 INSTR: INSTR (Bitfield-Mask: 0xffff)            */
/* ========================================================  TXFIFO  ========================================================= */
#define MSPI0_TXFIFO_TXFIFO_Pos           (0UL)                     /*!< MSPI0 TXFIFO: TXFIFO (Bit 0)                          */
#define MSPI0_TXFIFO_TXFIFO_Msk           (0xffffffffUL)            /*!< MSPI0 TXFIFO: TXFIFO (Bitfield-Mask: 0xffffffff)      */
/* ========================================================  RXFIFO  ========================================================= */
#define MSPI0_RXFIFO_RXFIFO_Pos           (0UL)                     /*!< MSPI0 RXFIFO: RXFIFO (Bit 0)                          */
#define MSPI0_RXFIFO_RXFIFO_Msk           (0xffffffffUL)            /*!< MSPI0 RXFIFO: RXFIFO (Bitfield-Mask: 0xffffffff)      */
/* =======================================================  TXENTRIES  ======================================================= */
#define MSPI0_TXENTRIES_TXENTRIES_Pos     (0UL)                     /*!< MSPI0 TXENTRIES: TXENTRIES (Bit 0)                    */
#define MSPI0_TXENTRIES_TXENTRIES_Msk     (0x3fUL)                  /*!< MSPI0 TXENTRIES: TXENTRIES (Bitfield-Mask: 0x3f)      */
/* =======================================================  RXENTRIES  ======================================================= */
#define MSPI0_RXENTRIES_RXENTRIES_Pos     (0UL)                     /*!< MSPI0 RXENTRIES: RXENTRIES (Bit 0)                    */
#define MSPI0_RXENTRIES_RXENTRIES_Msk     (0x3fUL)                  /*!< MSPI0 RXENTRIES: RXENTRIES (Bitfield-Mask: 0x3f)      */
/* =======================================================  THRESHOLD  ======================================================= */
#define MSPI0_THRESHOLD_RXTHRESH_Pos      (8UL)                     /*!< MSPI0 THRESHOLD: RXTHRESH (Bit 8)                     */
#define MSPI0_THRESHOLD_RXTHRESH_Msk      (0x3f00UL)                /*!< MSPI0 THRESHOLD: RXTHRESH (Bitfield-Mask: 0x3f)       */
#define MSPI0_THRESHOLD_TXTHRESH_Pos      (0UL)                     /*!< MSPI0 THRESHOLD: TXTHRESH (Bit 0)                     */
#define MSPI0_THRESHOLD_TXTHRESH_Msk      (0x3fUL)                  /*!< MSPI0 THRESHOLD: TXTHRESH (Bitfield-Mask: 0x3f)       */
/* ========================================================  MSPICFG  ======================================================== */
#define MSPI0_MSPICFG_PRSTN_Pos           (31UL)                    /*!< MSPI0 MSPICFG: PRSTN (Bit 31)                         */
#define MSPI0_MSPICFG_PRSTN_Msk           (0x80000000UL)            /*!< MSPI0 MSPICFG: PRSTN (Bitfield-Mask: 0x01)            */
#define MSPI0_MSPICFG_IPRSTN_Pos          (30UL)                    /*!< MSPI0 MSPICFG: IPRSTN (Bit 30)                        */
#define MSPI0_MSPICFG_IPRSTN_Msk          (0x40000000UL)            /*!< MSPI0 MSPICFG: IPRSTN (Bitfield-Mask: 0x01)           */
#define MSPI0_MSPICFG_FIFORESET_Pos       (29UL)                    /*!< MSPI0 MSPICFG: FIFORESET (Bit 29)                     */
#define MSPI0_MSPICFG_FIFORESET_Msk       (0x20000000UL)            /*!< MSPI0 MSPICFG: FIFORESET (Bitfield-Mask: 0x01)        */
#define MSPI0_MSPICFG_CLKDIV_Pos          (8UL)                     /*!< MSPI0 MSPICFG: CLKDIV (Bit 8)                         */
#define MSPI0_MSPICFG_CLKDIV_Msk          (0x3f00UL)                /*!< MSPI0 MSPICFG: CLKDIV (Bitfield-Mask: 0x3f)           */
#define MSPI0_MSPICFG_IOMSEL_Pos          (4UL)                     /*!< MSPI0 MSPICFG: IOMSEL (Bit 4)                         */
#define MSPI0_MSPICFG_IOMSEL_Msk          (0xf0UL)                  /*!< MSPI0 MSPICFG: IOMSEL (Bitfield-Mask: 0x0f)           */
#define MSPI0_MSPICFG_TXNEG_Pos           (3UL)                     /*!< MSPI0 MSPICFG: TXNEG (Bit 3)                          */
#define MSPI0_MSPICFG_TXNEG_Msk           (0x8UL)                   /*!< MSPI0 MSPICFG: TXNEG (Bitfield-Mask: 0x01)            */
#define MSPI0_MSPICFG_RXNEG_Pos           (2UL)                     /*!< MSPI0 MSPICFG: RXNEG (Bit 2)                          */
#define MSPI0_MSPICFG_RXNEG_Msk           (0x4UL)                   /*!< MSPI0 MSPICFG: RXNEG (Bitfield-Mask: 0x01)            */
#define MSPI0_MSPICFG_RXCAP_Pos           (1UL)                     /*!< MSPI0 MSPICFG: RXCAP (Bit 1)                          */
#define MSPI0_MSPICFG_RXCAP_Msk           (0x2UL)                   /*!< MSPI0 MSPICFG: RXCAP (Bitfield-Mask: 0x01)            */
#define MSPI0_MSPICFG_APBCLK_Pos          (0UL)                     /*!< MSPI0 MSPICFG: APBCLK (Bit 0)                         */
#define MSPI0_MSPICFG_APBCLK_Msk          (0x1UL)                   /*!< MSPI0 MSPICFG: APBCLK (Bitfield-Mask: 0x01)           */
/* ========================================================  MSPIDDR  ======================================================== */
#define MSPI0_MSPIDDR_TXDQSDELAY_Pos      (16UL)                    /*!< MSPI0 MSPIDDR: TXDQSDELAY (Bit 16)                    */
#define MSPI0_MSPIDDR_TXDQSDELAY_Msk      (0x1f0000UL)              /*!< MSPI0 MSPIDDR: TXDQSDELAY (Bitfield-Mask: 0x1f)       */
#define MSPI0_MSPIDDR_RXDQSDELAY_Pos      (8UL)                     /*!< MSPI0 MSPIDDR: RXDQSDELAY (Bit 8)                     */
#define MSPI0_MSPIDDR_RXDQSDELAY_Msk      (0x1f00UL)                /*!< MSPI0 MSPIDDR: RXDQSDELAY (Bitfield-Mask: 0x1f)       */
#define MSPI0_MSPIDDR_ENABLEFINEDELAY_Pos (6UL)                     /*!< MSPI0 MSPIDDR: ENABLEFINEDELAY (Bit 6)                */
#define MSPI0_MSPIDDR_ENABLEFINEDELAY_Msk (0x40UL)                  /*!< MSPI0 MSPIDDR: ENABLEFINEDELAY (Bitfield-Mask: 0x01)  */
#define MSPI0_MSPIDDR_OVERRIDEDDRCLKOUTDELAY_Pos (5UL)              /*!< MSPI0 MSPIDDR: OVERRIDEDDRCLKOUTDELAY (Bit 5)         */
#define MSPI0_MSPIDDR_OVERRIDEDDRCLKOUTDELAY_Msk (0x20UL)           /*!< MSPI0 MSPIDDR: OVERRIDEDDRCLKOUTDELAY (Bitfield-Mask: 0x01) */
#define MSPI0_MSPIDDR_OVERRIDERXDQSDELAY_Pos (4UL)                  /*!< MSPI0 MSPIDDR: OVERRIDERXDQSDELAY (Bit 4)             */
#define MSPI0_MSPIDDR_OVERRIDERXDQSDELAY_Msk (0x10UL)               /*!< MSPI0 MSPIDDR: OVERRIDERXDQSDELAY (Bitfield-Mask: 0x01) */
#define MSPI0_MSPIDDR_DQSSYNCNEG_Pos      (3UL)                     /*!< MSPI0 MSPIDDR: DQSSYNCNEG (Bit 3)                     */
#define MSPI0_MSPIDDR_DQSSYNCNEG_Msk      (0x8UL)                   /*!< MSPI0 MSPIDDR: DQSSYNCNEG (Bitfield-Mask: 0x01)       */
#define MSPI0_MSPIDDR_ENABLEDQS_Pos       (2UL)                     /*!< MSPI0 MSPIDDR: ENABLEDQS (Bit 2)                      */
#define MSPI0_MSPIDDR_ENABLEDQS_Msk       (0x4UL)                   /*!< MSPI0 MSPIDDR: ENABLEDQS (Bitfield-Mask: 0x01)        */
#define MSPI0_MSPIDDR_QUADDDR_Pos         (1UL)                     /*!< MSPI0 MSPIDDR: QUADDDR (Bit 1)                        */
#define MSPI0_MSPIDDR_QUADDDR_Msk         (0x2UL)                   /*!< MSPI0 MSPIDDR: QUADDDR (Bitfield-Mask: 0x01)          */
#define MSPI0_MSPIDDR_EMULATEDDR_Pos      (0UL)                     /*!< MSPI0 MSPIDDR: EMULATEDDR (Bit 0)                     */
#define MSPI0_MSPIDDR_EMULATEDDR_Msk      (0x1UL)                   /*!< MSPI0 MSPIDDR: EMULATEDDR (Bitfield-Mask: 0x01)       */
/* ========================================================  PADCFG  ========================================================= */
#define MSPI0_PADCFG_REVCS_Pos            (21UL)                    /*!< MSPI0 PADCFG: REVCS (Bit 21)                          */
#define MSPI0_PADCFG_REVCS_Msk            (0x200000UL)              /*!< MSPI0 PADCFG: REVCS (Bitfield-Mask: 0x01)             */
#define MSPI0_PADCFG_IN3_Pos              (20UL)                    /*!< MSPI0 PADCFG: IN3 (Bit 20)                            */
#define MSPI0_PADCFG_IN3_Msk              (0x100000UL)              /*!< MSPI0 PADCFG: IN3 (Bitfield-Mask: 0x01)               */
#define MSPI0_PADCFG_IN2_Pos              (19UL)                    /*!< MSPI0 PADCFG: IN2 (Bit 19)                            */
#define MSPI0_PADCFG_IN2_Msk              (0x80000UL)               /*!< MSPI0 PADCFG: IN2 (Bitfield-Mask: 0x01)               */
#define MSPI0_PADCFG_IN1_Pos              (18UL)                    /*!< MSPI0 PADCFG: IN1 (Bit 18)                            */
#define MSPI0_PADCFG_IN1_Msk              (0x40000UL)               /*!< MSPI0 PADCFG: IN1 (Bitfield-Mask: 0x01)               */
#define MSPI0_PADCFG_IN0_Pos              (16UL)                    /*!< MSPI0 PADCFG: IN0 (Bit 16)                            */
#define MSPI0_PADCFG_IN0_Msk              (0x30000UL)               /*!< MSPI0 PADCFG: IN0 (Bitfield-Mask: 0x03)               */
#define MSPI0_PADCFG_OUT7_Pos             (4UL)                     /*!< MSPI0 PADCFG: OUT7 (Bit 4)                            */
#define MSPI0_PADCFG_OUT7_Msk             (0x10UL)                  /*!< MSPI0 PADCFG: OUT7 (Bitfield-Mask: 0x01)              */
#define MSPI0_PADCFG_OUT6_Pos             (3UL)                     /*!< MSPI0 PADCFG: OUT6 (Bit 3)                            */
#define MSPI0_PADCFG_OUT6_Msk             (0x8UL)                   /*!< MSPI0 PADCFG: OUT6 (Bitfield-Mask: 0x01)              */
#define MSPI0_PADCFG_OUT5_Pos             (2UL)                     /*!< MSPI0 PADCFG: OUT5 (Bit 2)                            */
#define MSPI0_PADCFG_OUT5_Msk             (0x4UL)                   /*!< MSPI0 PADCFG: OUT5 (Bitfield-Mask: 0x01)              */
#define MSPI0_PADCFG_OUT4_Pos             (1UL)                     /*!< MSPI0 PADCFG: OUT4 (Bit 1)                            */
#define MSPI0_PADCFG_OUT4_Msk             (0x2UL)                   /*!< MSPI0 PADCFG: OUT4 (Bitfield-Mask: 0x01)              */
#define MSPI0_PADCFG_OUT3_Pos             (0UL)                     /*!< MSPI0 PADCFG: OUT3 (Bit 0)                            */
#define MSPI0_PADCFG_OUT3_Msk             (0x1UL)                   /*!< MSPI0 PADCFG: OUT3 (Bitfield-Mask: 0x01)              */
/* =======================================================  PADOUTEN  ======================================================== */
#define MSPI0_PADOUTEN_OUTEN_Pos          (0UL)                     /*!< MSPI0 PADOUTEN: OUTEN (Bit 0)                         */
#define MSPI0_PADOUTEN_OUTEN_Msk          (0x3ffUL)                 /*!< MSPI0 PADOUTEN: OUTEN (Bitfield-Mask: 0x3ff)          */
/* =======================================================  PADOVEREN  ======================================================= */
#define MSPI0_PADOVEREN_OVERRIDEEN_Pos    (0UL)                     /*!< MSPI0 PADOVEREN: OVERRIDEEN (Bit 0)                   */
#define MSPI0_PADOVEREN_OVERRIDEEN_Msk    (0x3ffUL)                 /*!< MSPI0 PADOVEREN: OVERRIDEEN (Bitfield-Mask: 0x3ff)    */
/* ========================================================  PADOVER  ======================================================== */
#define MSPI0_PADOVER_OVERRIDE_Pos        (0UL)                     /*!< MSPI0 PADOVER: OVERRIDE (Bit 0)                       */
#define MSPI0_PADOVER_OVERRIDE_Msk        (0x3ffUL)                 /*!< MSPI0 PADOVER: OVERRIDE (Bitfield-Mask: 0x3ff)        */
/* =========================================================  FLASH  ========================================================= */
#define MSPI0_FLASH_XIPENWLAT_Pos         (11UL)                    /*!< MSPI0 FLASH: XIPENWLAT (Bit 11)                       */
#define MSPI0_FLASH_XIPENWLAT_Msk         (0x800UL)                 /*!< MSPI0 FLASH: XIPENWLAT (Bitfield-Mask: 0x01)          */
#define MSPI0_FLASH_XIPMIXED_Pos          (8UL)                     /*!< MSPI0 FLASH: XIPMIXED (Bit 8)                         */
#define MSPI0_FLASH_XIPMIXED_Msk          (0x700UL)                 /*!< MSPI0 FLASH: XIPMIXED (Bitfield-Mask: 0x07)           */
#define MSPI0_FLASH_XIPSENDI_Pos          (7UL)                     /*!< MSPI0 FLASH: XIPSENDI (Bit 7)                         */
#define MSPI0_FLASH_XIPSENDI_Msk          (0x80UL)                  /*!< MSPI0 FLASH: XIPSENDI (Bitfield-Mask: 0x01)           */
#define MSPI0_FLASH_XIPSENDA_Pos          (6UL)                     /*!< MSPI0 FLASH: XIPSENDA (Bit 6)                         */
#define MSPI0_FLASH_XIPSENDA_Msk          (0x40UL)                  /*!< MSPI0 FLASH: XIPSENDA (Bitfield-Mask: 0x01)           */
#define MSPI0_FLASH_XIPENTURN_Pos         (5UL)                     /*!< MSPI0 FLASH: XIPENTURN (Bit 5)                        */
#define MSPI0_FLASH_XIPENTURN_Msk         (0x20UL)                  /*!< MSPI0 FLASH: XIPENTURN (Bitfield-Mask: 0x01)          */
#define MSPI0_FLASH_XIPBIGENDIAN_Pos      (4UL)                     /*!< MSPI0 FLASH: XIPBIGENDIAN (Bit 4)                     */
#define MSPI0_FLASH_XIPBIGENDIAN_Msk      (0x10UL)                  /*!< MSPI0 FLASH: XIPBIGENDIAN (Bitfield-Mask: 0x01)       */
#define MSPI0_FLASH_XIPACK_Pos            (2UL)                     /*!< MSPI0 FLASH: XIPACK (Bit 2)                           */
#define MSPI0_FLASH_XIPACK_Msk            (0xcUL)                   /*!< MSPI0 FLASH: XIPACK (Bitfield-Mask: 0x03)             */
#define MSPI0_FLASH_XIPENDCX_Pos          (1UL)                     /*!< MSPI0 FLASH: XIPENDCX (Bit 1)                         */
#define MSPI0_FLASH_XIPENDCX_Msk          (0x2UL)                   /*!< MSPI0 FLASH: XIPENDCX (Bitfield-Mask: 0x01)           */
#define MSPI0_FLASH_XIPEN_Pos             (0UL)                     /*!< MSPI0 FLASH: XIPEN (Bit 0)                            */
#define MSPI0_FLASH_XIPEN_Msk             (0x1UL)                   /*!< MSPI0 FLASH: XIPEN (Bitfield-Mask: 0x01)              */
/* =======================================================  XIPINSTR  ======================================================== */
#define MSPI0_XIPINSTR_READINSTR_Pos      (16UL)                    /*!< MSPI0 XIPINSTR: READINSTR (Bit 16)                    */
#define MSPI0_XIPINSTR_READINSTR_Msk      (0xffff0000UL)            /*!< MSPI0 XIPINSTR: READINSTR (Bitfield-Mask: 0xffff)     */
#define MSPI0_XIPINSTR_WRITEINSTR_Pos     (0UL)                     /*!< MSPI0 XIPINSTR: WRITEINSTR (Bit 0)                    */
#define MSPI0_XIPINSTR_WRITEINSTR_Msk     (0xffffUL)                /*!< MSPI0 XIPINSTR: WRITEINSTR (Bitfield-Mask: 0xffff)    */
/* ======================================================  SCRAMBLING  ======================================================= */
#define MSPI0_SCRAMBLING_SCRENABLE_Pos    (31UL)                    /*!< MSPI0 SCRAMBLING: SCRENABLE (Bit 31)                  */
#define MSPI0_SCRAMBLING_SCRENABLE_Msk    (0x80000000UL)            /*!< MSPI0 SCRAMBLING: SCRENABLE (Bitfield-Mask: 0x01)     */
#define MSPI0_SCRAMBLING_SCREND_Pos       (16UL)                    /*!< MSPI0 SCRAMBLING: SCREND (Bit 16)                     */
#define MSPI0_SCRAMBLING_SCREND_Msk       (0x3ff0000UL)             /*!< MSPI0 SCRAMBLING: SCREND (Bitfield-Mask: 0x3ff)       */
#define MSPI0_SCRAMBLING_SCRSTART_Pos     (0UL)                     /*!< MSPI0 SCRAMBLING: SCRSTART (Bit 0)                    */
#define MSPI0_SCRAMBLING_SCRSTART_Msk     (0x3ffUL)                 /*!< MSPI0 SCRAMBLING: SCRSTART (Bitfield-Mask: 0x3ff)     */
/* =========================================================  INTEN  ========================================================= */
#define MSPI0_INTEN_SCRERR_Pos            (12UL)                    /*!< MSPI0 INTEN: SCRERR (Bit 12)                          */
#define MSPI0_INTEN_SCRERR_Msk            (0x1000UL)                /*!< MSPI0 INTEN: SCRERR (Bitfield-Mask: 0x01)             */
#define MSPI0_INTEN_CQERR_Pos             (11UL)                    /*!< MSPI0 INTEN: CQERR (Bit 11)                           */
#define MSPI0_INTEN_CQERR_Msk             (0x800UL)                 /*!< MSPI0 INTEN: CQERR (Bitfield-Mask: 0x01)              */
#define MSPI0_INTEN_CQPAUSED_Pos          (10UL)                    /*!< MSPI0 INTEN: CQPAUSED (Bit 10)                        */
#define MSPI0_INTEN_CQPAUSED_Msk          (0x400UL)                 /*!< MSPI0 INTEN: CQPAUSED (Bitfield-Mask: 0x01)           */
#define MSPI0_INTEN_CQUPD_Pos             (9UL)                     /*!< MSPI0 INTEN: CQUPD (Bit 9)                            */
#define MSPI0_INTEN_CQUPD_Msk             (0x200UL)                 /*!< MSPI0 INTEN: CQUPD (Bitfield-Mask: 0x01)              */
#define MSPI0_INTEN_CQCMP_Pos             (8UL)                     /*!< MSPI0 INTEN: CQCMP (Bit 8)                            */
#define MSPI0_INTEN_CQCMP_Msk             (0x100UL)                 /*!< MSPI0 INTEN: CQCMP (Bitfield-Mask: 0x01)              */
#define MSPI0_INTEN_DERR_Pos              (7UL)                     /*!< MSPI0 INTEN: DERR (Bit 7)                             */
#define MSPI0_INTEN_DERR_Msk              (0x80UL)                  /*!< MSPI0 INTEN: DERR (Bitfield-Mask: 0x01)               */
#define MSPI0_INTEN_DCMP_Pos              (6UL)                     /*!< MSPI0 INTEN: DCMP (Bit 6)                             */
#define MSPI0_INTEN_DCMP_Msk              (0x40UL)                  /*!< MSPI0 INTEN: DCMP (Bitfield-Mask: 0x01)               */
#define MSPI0_INTEN_RXF_Pos               (5UL)                     /*!< MSPI0 INTEN: RXF (Bit 5)                              */
