sparkfun/Arduino_Apollo3/cores/arduino/am_sdk_ap3/CMSIS/AmbiqMicro/Include/apollo3c.h
#define MSPI0_INTEN_RXF_Msk               (0x20UL)                  /*!< MSPI0 INTEN: RXF (Bitfield-Mask: 0x01)                */
#define MSPI0_INTEN_RXO_Pos               (4UL)                     /*!< MSPI0 INTEN: RXO (Bit 4)                              */
#define MSPI0_INTEN_RXO_Msk               (0x10UL)                  /*!< MSPI0 INTEN: RXO (Bitfield-Mask: 0x01)                */
#define MSPI0_INTEN_RXU_Pos               (3UL)                     /*!< MSPI0 INTEN: RXU (Bit 3)                              */
#define MSPI0_INTEN_RXU_Msk               (0x8UL)                   /*!< MSPI0 INTEN: RXU (Bitfield-Mask: 0x01)                */
#define MSPI0_INTEN_TXO_Pos               (2UL)                     /*!< MSPI0 INTEN: TXO (Bit 2)                              */
#define MSPI0_INTEN_TXO_Msk               (0x4UL)                   /*!< MSPI0 INTEN: TXO (Bitfield-Mask: 0x01)                */
#define MSPI0_INTEN_TXE_Pos               (1UL)                     /*!< MSPI0 INTEN: TXE (Bit 1)                              */
#define MSPI0_INTEN_TXE_Msk               (0x2UL)                   /*!< MSPI0 INTEN: TXE (Bitfield-Mask: 0x01)                */
#define MSPI0_INTEN_CMDCMP_Pos            (0UL)                     /*!< MSPI0 INTEN: CMDCMP (Bit 0)                           */
#define MSPI0_INTEN_CMDCMP_Msk            (0x1UL)                   /*!< MSPI0 INTEN: CMDCMP (Bitfield-Mask: 0x01)             */
/* ========================================================  INTSTAT  ======================================================== */
#define MSPI0_INTSTAT_SCRERR_Pos          (12UL)                    /*!< MSPI0 INTSTAT: SCRERR (Bit 12)                        */
#define MSPI0_INTSTAT_SCRERR_Msk          (0x1000UL)                /*!< MSPI0 INTSTAT: SCRERR (Bitfield-Mask: 0x01)           */
#define MSPI0_INTSTAT_CQERR_Pos           (11UL)                    /*!< MSPI0 INTSTAT: CQERR (Bit 11)                         */
#define MSPI0_INTSTAT_CQERR_Msk           (0x800UL)                 /*!< MSPI0 INTSTAT: CQERR (Bitfield-Mask: 0x01)            */
#define MSPI0_INTSTAT_CQPAUSED_Pos        (10UL)                    /*!< MSPI0 INTSTAT: CQPAUSED (Bit 10)                      */
#define MSPI0_INTSTAT_CQPAUSED_Msk        (0x400UL)                 /*!< MSPI0 INTSTAT: CQPAUSED (Bitfield-Mask: 0x01)         */
#define MSPI0_INTSTAT_CQUPD_Pos           (9UL)                     /*!< MSPI0 INTSTAT: CQUPD (Bit 9)                          */
#define MSPI0_INTSTAT_CQUPD_Msk           (0x200UL)                 /*!< MSPI0 INTSTAT: CQUPD (Bitfield-Mask: 0x01)            */
#define MSPI0_INTSTAT_CQCMP_Pos           (8UL)                     /*!< MSPI0 INTSTAT: CQCMP (Bit 8)                          */
#define MSPI0_INTSTAT_CQCMP_Msk           (0x100UL)                 /*!< MSPI0 INTSTAT: CQCMP (Bitfield-Mask: 0x01)            */
#define MSPI0_INTSTAT_DERR_Pos            (7UL)                     /*!< MSPI0 INTSTAT: DERR (Bit 7)                           */
#define MSPI0_INTSTAT_DERR_Msk            (0x80UL)                  /*!< MSPI0 INTSTAT: DERR (Bitfield-Mask: 0x01)             */
#define MSPI0_INTSTAT_DCMP_Pos            (6UL)                     /*!< MSPI0 INTSTAT: DCMP (Bit 6)                           */
#define MSPI0_INTSTAT_DCMP_Msk            (0x40UL)                  /*!< MSPI0 INTSTAT: DCMP (Bitfield-Mask: 0x01)             */
#define MSPI0_INTSTAT_RXF_Pos             (5UL)                     /*!< MSPI0 INTSTAT: RXF (Bit 5)                            */
#define MSPI0_INTSTAT_RXF_Msk             (0x20UL)                  /*!< MSPI0 INTSTAT: RXF (Bitfield-Mask: 0x01)              */
#define MSPI0_INTSTAT_RXO_Pos             (4UL)                     /*!< MSPI0 INTSTAT: RXO (Bit 4)                            */
#define MSPI0_INTSTAT_RXO_Msk             (0x10UL)                  /*!< MSPI0 INTSTAT: RXO (Bitfield-Mask: 0x01)              */
#define MSPI0_INTSTAT_RXU_Pos             (3UL)                     /*!< MSPI0 INTSTAT: RXU (Bit 3)                            */
#define MSPI0_INTSTAT_RXU_Msk             (0x8UL)                   /*!< MSPI0 INTSTAT: RXU (Bitfield-Mask: 0x01)              */
#define MSPI0_INTSTAT_TXO_Pos             (2UL)                     /*!< MSPI0 INTSTAT: TXO (Bit 2)                            */
#define MSPI0_INTSTAT_TXO_Msk             (0x4UL)                   /*!< MSPI0 INTSTAT: TXO (Bitfield-Mask: 0x01)              */
#define MSPI0_INTSTAT_TXE_Pos             (1UL)                     /*!< MSPI0 INTSTAT: TXE (Bit 1)                            */
#define MSPI0_INTSTAT_TXE_Msk             (0x2UL)                   /*!< MSPI0 INTSTAT: TXE (Bitfield-Mask: 0x01)              */
#define MSPI0_INTSTAT_CMDCMP_Pos          (0UL)                     /*!< MSPI0 INTSTAT: CMDCMP (Bit 0)                         */
#define MSPI0_INTSTAT_CMDCMP_Msk          (0x1UL)                   /*!< MSPI0 INTSTAT: CMDCMP (Bitfield-Mask: 0x01)           */
/* ========================================================  INTCLR  ========================================================= */
#define MSPI0_INTCLR_SCRERR_Pos           (12UL)                    /*!< MSPI0 INTCLR: SCRERR (Bit 12)                         */
#define MSPI0_INTCLR_SCRERR_Msk           (0x1000UL)                /*!< MSPI0 INTCLR: SCRERR (Bitfield-Mask: 0x01)            */
#define MSPI0_INTCLR_CQERR_Pos            (11UL)                    /*!< MSPI0 INTCLR: CQERR (Bit 11)                          */
#define MSPI0_INTCLR_CQERR_Msk            (0x800UL)                 /*!< MSPI0 INTCLR: CQERR (Bitfield-Mask: 0x01)             */
#define MSPI0_INTCLR_CQPAUSED_Pos         (10UL)                    /*!< MSPI0 INTCLR: CQPAUSED (Bit 10)                       */
#define MSPI0_INTCLR_CQPAUSED_Msk         (0x400UL)                 /*!< MSPI0 INTCLR: CQPAUSED (Bitfield-Mask: 0x01)          */
#define MSPI0_INTCLR_CQUPD_Pos            (9UL)                     /*!< MSPI0 INTCLR: CQUPD (Bit 9)                           */
#define MSPI0_INTCLR_CQUPD_Msk            (0x200UL)                 /*!< MSPI0 INTCLR: CQUPD (Bitfield-Mask: 0x01)             */
#define MSPI0_INTCLR_CQCMP_Pos            (8UL)                     /*!< MSPI0 INTCLR: CQCMP (Bit 8)                           */
#define MSPI0_INTCLR_CQCMP_Msk            (0x100UL)                 /*!< MSPI0 INTCLR: CQCMP (Bitfield-Mask: 0x01)             */
#define MSPI0_INTCLR_DERR_Pos             (7UL)                     /*!< MSPI0 INTCLR: DERR (Bit 7)                            */
#define MSPI0_INTCLR_DERR_Msk             (0x80UL)                  /*!< MSPI0 INTCLR: DERR (Bitfield-Mask: 0x01)              */
#define MSPI0_INTCLR_DCMP_Pos             (6UL)                     /*!< MSPI0 INTCLR: DCMP (Bit 6)                            */
#define MSPI0_INTCLR_DCMP_Msk             (0x40UL)                  /*!< MSPI0 INTCLR: DCMP (Bitfield-Mask: 0x01)              */
#define MSPI0_INTCLR_RXF_Pos              (5UL)                     /*!< MSPI0 INTCLR: RXF (Bit 5)                             */
#define MSPI0_INTCLR_RXF_Msk              (0x20UL)                  /*!< MSPI0 INTCLR: RXF (Bitfield-Mask: 0x01)               */
#define MSPI0_INTCLR_RXO_Pos              (4UL)                     /*!< MSPI0 INTCLR: RXO (Bit 4)                             */
#define MSPI0_INTCLR_RXO_Msk              (0x10UL)                  /*!< MSPI0 INTCLR: RXO (Bitfield-Mask: 0x01)               */
#define MSPI0_INTCLR_RXU_Pos              (3UL)                     /*!< MSPI0 INTCLR: RXU (Bit 3)                             */
#define MSPI0_INTCLR_RXU_Msk              (0x8UL)                   /*!< MSPI0 INTCLR: RXU (Bitfield-Mask: 0x01)               */
#define MSPI0_INTCLR_TXO_Pos              (2UL)                     /*!< MSPI0 INTCLR: TXO (Bit 2)                             */
#define MSPI0_INTCLR_TXO_Msk              (0x4UL)                   /*!< MSPI0 INTCLR: TXO (Bitfield-Mask: 0x01)               */
#define MSPI0_INTCLR_TXE_Pos              (1UL)                     /*!< MSPI0 INTCLR: TXE (Bit 1)                             */
#define MSPI0_INTCLR_TXE_Msk              (0x2UL)                   /*!< MSPI0 INTCLR: TXE (Bitfield-Mask: 0x01)               */
#define MSPI0_INTCLR_CMDCMP_Pos           (0UL)                     /*!< MSPI0 INTCLR: CMDCMP (Bit 0)                          */
#define MSPI0_INTCLR_CMDCMP_Msk           (0x1UL)                   /*!< MSPI0 INTCLR: CMDCMP (Bitfield-Mask: 0x01)            */
/* ========================================================  INTSET  ========================================================= */
#define MSPI0_INTSET_SCRERR_Pos           (12UL)                    /*!< MSPI0 INTSET: SCRERR (Bit 12)                         */
#define MSPI0_INTSET_SCRERR_Msk           (0x1000UL)                /*!< MSPI0 INTSET: SCRERR (Bitfield-Mask: 0x01)            */
#define MSPI0_INTSET_CQERR_Pos            (11UL)                    /*!< MSPI0 INTSET: CQERR (Bit 11)                          */
#define MSPI0_INTSET_CQERR_Msk            (0x800UL)                 /*!< MSPI0 INTSET: CQERR (Bitfield-Mask: 0x01)             */
#define MSPI0_INTSET_CQPAUSED_Pos         (10UL)                    /*!< MSPI0 INTSET: CQPAUSED (Bit 10)                       */
#define MSPI0_INTSET_CQPAUSED_Msk         (0x400UL)                 /*!< MSPI0 INTSET: CQPAUSED (Bitfield-Mask: 0x01)          */
#define MSPI0_INTSET_CQUPD_Pos            (9UL)                     /*!< MSPI0 INTSET: CQUPD (Bit 9)                           */
#define MSPI0_INTSET_CQUPD_Msk            (0x200UL)                 /*!< MSPI0 INTSET: CQUPD (Bitfield-Mask: 0x01)             */
#define MSPI0_INTSET_CQCMP_Pos            (8UL)                     /*!< MSPI0 INTSET: CQCMP (Bit 8)                           */
#define MSPI0_INTSET_CQCMP_Msk            (0x100UL)                 /*!< MSPI0 INTSET: CQCMP (Bitfield-Mask: 0x01)             */
#define MSPI0_INTSET_DERR_Pos             (7UL)                     /*!< MSPI0 INTSET: DERR (Bit 7)                            */
#define MSPI0_INTSET_DERR_Msk             (0x80UL)                  /*!< MSPI0 INTSET: DERR (Bitfield-Mask: 0x01)              */
#define MSPI0_INTSET_DCMP_Pos             (6UL)                     /*!< MSPI0 INTSET: DCMP (Bit 6)                            */
#define MSPI0_INTSET_DCMP_Msk             (0x40UL)                  /*!< MSPI0 INTSET: DCMP (Bitfield-Mask: 0x01)              */
#define MSPI0_INTSET_RXF_Pos              (5UL)                     /*!< MSPI0 INTSET: RXF (Bit 5)                             */
#define MSPI0_INTSET_RXF_Msk              (0x20UL)                  /*!< MSPI0 INTSET: RXF (Bitfield-Mask: 0x01)               */
#define MSPI0_INTSET_RXO_Pos              (4UL)                     /*!< MSPI0 INTSET: RXO (Bit 4)                             */
#define MSPI0_INTSET_RXO_Msk              (0x10UL)                  /*!< MSPI0 INTSET: RXO (Bitfield-Mask: 0x01)               */
#define MSPI0_INTSET_RXU_Pos              (3UL)                     /*!< MSPI0 INTSET: RXU (Bit 3)                             */
#define MSPI0_INTSET_RXU_Msk              (0x8UL)                   /*!< MSPI0 INTSET: RXU (Bitfield-Mask: 0x01)               */
#define MSPI0_INTSET_TXO_Pos              (2UL)                     /*!< MSPI0 INTSET: TXO (Bit 2)                             */
#define MSPI0_INTSET_TXO_Msk              (0x4UL)                   /*!< MSPI0 INTSET: TXO (Bitfield-Mask: 0x01)               */
#define MSPI0_INTSET_TXE_Pos              (1UL)                     /*!< MSPI0 INTSET: TXE (Bit 1)                             */
#define MSPI0_INTSET_TXE_Msk              (0x2UL)                   /*!< MSPI0 INTSET: TXE (Bitfield-Mask: 0x01)               */
#define MSPI0_INTSET_CMDCMP_Pos           (0UL)                     /*!< MSPI0 INTSET: CMDCMP (Bit 0)                          */
#define MSPI0_INTSET_CMDCMP_Msk           (0x1UL)                   /*!< MSPI0 INTSET: CMDCMP (Bitfield-Mask: 0x01)            */
/* ========================================================  DMACFG  ========================================================= */
#define MSPI0_DMACFG_DMAPWROFF_Pos        (18UL)                    /*!< MSPI0 DMACFG: DMAPWROFF (Bit 18)                      */
#define MSPI0_DMACFG_DMAPWROFF_Msk        (0x40000UL)               /*!< MSPI0 DMACFG: DMAPWROFF (Bitfield-Mask: 0x01)         */
#define MSPI0_DMACFG_DMAPRI_Pos           (3UL)                     /*!< MSPI0 DMACFG: DMAPRI (Bit 3)                          */
#define MSPI0_DMACFG_DMAPRI_Msk           (0x18UL)                  /*!< MSPI0 DMACFG: DMAPRI (Bitfield-Mask: 0x03)            */
#define MSPI0_DMACFG_DMADIR_Pos           (2UL)                     /*!< MSPI0 DMACFG: DMADIR (Bit 2)                          */
#define MSPI0_DMACFG_DMADIR_Msk           (0x4UL)                   /*!< MSPI0 DMACFG: DMADIR (Bitfield-Mask: 0x01)            */
#define MSPI0_DMACFG_DMAEN_Pos            (0UL)                     /*!< MSPI0 DMACFG: DMAEN (Bit 0)                           */
#define MSPI0_DMACFG_DMAEN_Msk            (0x3UL)                   /*!< MSPI0 DMACFG: DMAEN (Bitfield-Mask: 0x03)             */
/* ========================================================  DMASTAT  ======================================================== */
#define MSPI0_DMASTAT_SCRERR_Pos          (3UL)                     /*!< MSPI0 DMASTAT: SCRERR (Bit 3)                         */
#define MSPI0_DMASTAT_SCRERR_Msk          (0x8UL)                   /*!< MSPI0 DMASTAT: SCRERR (Bitfield-Mask: 0x01)           */
#define MSPI0_DMASTAT_DMAERR_Pos          (2UL)                     /*!< MSPI0 DMASTAT: DMAERR (Bit 2)                         */
#define MSPI0_DMASTAT_DMAERR_Msk          (0x4UL)                   /*!< MSPI0 DMASTAT: DMAERR (Bitfield-Mask: 0x01)           */
#define MSPI0_DMASTAT_DMACPL_Pos          (1UL)                     /*!< MSPI0 DMASTAT: DMACPL (Bit 1)                         */
#define MSPI0_DMASTAT_DMACPL_Msk          (0x2UL)                   /*!< MSPI0 DMASTAT: DMACPL (Bitfield-Mask: 0x01)           */
#define MSPI0_DMASTAT_DMATIP_Pos          (0UL)                     /*!< MSPI0 DMASTAT: DMATIP (Bit 0)                         */
#define MSPI0_DMASTAT_DMATIP_Msk          (0x1UL)                   /*!< MSPI0 DMASTAT: DMATIP (Bitfield-Mask: 0x01)           */
/* ======================================================  DMATARGADDR  ====================================================== */
#define MSPI0_DMATARGADDR_TARGADDR_Pos    (0UL)                     /*!< MSPI0 DMATARGADDR: TARGADDR (Bit 0)                   */
#define MSPI0_DMATARGADDR_TARGADDR_Msk    (0xffffffffUL)            /*!< MSPI0 DMATARGADDR: TARGADDR (Bitfield-Mask: 0xffffffff) */
/* ======================================================  DMADEVADDR  ======================================================= */
#define MSPI0_DMADEVADDR_DEVADDR_Pos      (0UL)                     /*!< MSPI0 DMADEVADDR: DEVADDR (Bit 0)                     */
#define MSPI0_DMADEVADDR_DEVADDR_Msk      (0xffffffffUL)            /*!< MSPI0 DMADEVADDR: DEVADDR (Bitfield-Mask: 0xffffffff) */
/* ======================================================  DMATOTCOUNT  ====================================================== */
#define MSPI0_DMATOTCOUNT_TOTCOUNT_Pos    (0UL)                     /*!< MSPI0 DMATOTCOUNT: TOTCOUNT (Bit 0)                   */
#define MSPI0_DMATOTCOUNT_TOTCOUNT_Msk    (0xffffffUL)              /*!< MSPI0 DMATOTCOUNT: TOTCOUNT (Bitfield-Mask: 0xffffff) */
/* =======================================================  DMABCOUNT  ======================================================= */
#define MSPI0_DMABCOUNT_BCOUNT_Pos        (0UL)                     /*!< MSPI0 DMABCOUNT: BCOUNT (Bit 0)                       */
#define MSPI0_DMABCOUNT_BCOUNT_Msk        (0xffUL)                  /*!< MSPI0 DMABCOUNT: BCOUNT (Bitfield-Mask: 0xff)         */
/* =======================================================  DMATHRESH  ======================================================= */
#define MSPI0_DMATHRESH_DMARXTHRESH_Pos   (8UL)                     /*!< MSPI0 DMATHRESH: DMARXTHRESH (Bit 8)                  */
#define MSPI0_DMATHRESH_DMARXTHRESH_Msk   (0x1f00UL)                /*!< MSPI0 DMATHRESH: DMARXTHRESH (Bitfield-Mask: 0x1f)    */
#define MSPI0_DMATHRESH_DMATXTHRESH_Pos   (0UL)                     /*!< MSPI0 DMATHRESH: DMATXTHRESH (Bit 0)                  */
#define MSPI0_DMATHRESH_DMATXTHRESH_Msk   (0x1fUL)                  /*!< MSPI0 DMATHRESH: DMATXTHRESH (Bitfield-Mask: 0x1f)    */
/* ======================================================  DMABOUNDARY  ====================================================== */
#define MSPI0_DMABOUNDARY_DMABOUND_Pos    (12UL)                    /*!< MSPI0 DMABOUNDARY: DMABOUND (Bit 12)                  */
#define MSPI0_DMABOUNDARY_DMABOUND_Msk    (0xf000UL)                /*!< MSPI0 DMABOUNDARY: DMABOUND (Bitfield-Mask: 0x0f)     */
#define MSPI0_DMABOUNDARY_DMATIMELIMIT_Pos (0UL)                    /*!< MSPI0 DMABOUNDARY: DMATIMELIMIT (Bit 0)               */
#define MSPI0_DMABOUNDARY_DMATIMELIMIT_Msk (0xfffUL)                /*!< MSPI0 DMABOUNDARY: DMATIMELIMIT (Bitfield-Mask: 0xfff) */
/* =========================================================  CQCFG  ========================================================= */
#define MSPI0_CQCFG_CQAUTOCLEARMASK_Pos   (3UL)                     /*!< MSPI0 CQCFG: CQAUTOCLEARMASK (Bit 3)                  */
#define MSPI0_CQCFG_CQAUTOCLEARMASK_Msk   (0x8UL)                   /*!< MSPI0 CQCFG: CQAUTOCLEARMASK (Bitfield-Mask: 0x01)    */
#define MSPI0_CQCFG_CQPWROFF_Pos          (2UL)                     /*!< MSPI0 CQCFG: CQPWROFF (Bit 2)                         */
#define MSPI0_CQCFG_CQPWROFF_Msk          (0x4UL)                   /*!< MSPI0 CQCFG: CQPWROFF (Bitfield-Mask: 0x01)           */
#define MSPI0_CQCFG_CQPRI_Pos             (1UL)                     /*!< MSPI0 CQCFG: CQPRI (Bit 1)                            */
#define MSPI0_CQCFG_CQPRI_Msk             (0x2UL)                   /*!< MSPI0 CQCFG: CQPRI (Bitfield-Mask: 0x01)              */
#define MSPI0_CQCFG_CQEN_Pos              (0UL)                     /*!< MSPI0 CQCFG: CQEN (Bit 0)                             */
#define MSPI0_CQCFG_CQEN_Msk              (0x1UL)                   /*!< MSPI0 CQCFG: CQEN (Bitfield-Mask: 0x01)               */
/* ========================================================  CQADDR  ========================================================= */
#define MSPI0_CQADDR_CQADDR_Pos           (0UL)                     /*!< MSPI0 CQADDR: CQADDR (Bit 0)                          */
#define MSPI0_CQADDR_CQADDR_Msk           (0x1fffffffUL)            /*!< MSPI0 CQADDR: CQADDR (Bitfield-Mask: 0x1fffffff)      */
/* ========================================================  CQSTAT  ========================================================= */
#define MSPI0_CQSTAT_CQPAUSED_Pos         (3UL)                     /*!< MSPI0 CQSTAT: CQPAUSED (Bit 3)                        */
#define MSPI0_CQSTAT_CQPAUSED_Msk         (0x8UL)                   /*!< MSPI0 CQSTAT: CQPAUSED (Bitfield-Mask: 0x01)          */
#define MSPI0_CQSTAT_CQERR_Pos            (2UL)                     /*!< MSPI0 CQSTAT: CQERR (Bit 2)                           */
#define MSPI0_CQSTAT_CQERR_Msk            (0x4UL)                   /*!< MSPI0 CQSTAT: CQERR (Bitfield-Mask: 0x01)             */
#define MSPI0_CQSTAT_CQCPL_Pos            (1UL)                     /*!< MSPI0 CQSTAT: CQCPL (Bit 1)                           */
#define MSPI0_CQSTAT_CQCPL_Msk            (0x2UL)                   /*!< MSPI0 CQSTAT: CQCPL (Bitfield-Mask: 0x01)             */
#define MSPI0_CQSTAT_CQTIP_Pos            (0UL)                     /*!< MSPI0 CQSTAT: CQTIP (Bit 0)                           */
#define MSPI0_CQSTAT_CQTIP_Msk            (0x1UL)                   /*!< MSPI0 CQSTAT: CQTIP (Bitfield-Mask: 0x01)             */
/* ========================================================  CQFLAGS  ======================================================== */
#define MSPI0_CQFLAGS_CQFLAGS_Pos         (0UL)                     /*!< MSPI0 CQFLAGS: CQFLAGS (Bit 0)                        */
#define MSPI0_CQFLAGS_CQFLAGS_Msk         (0xffffUL)                /*!< MSPI0 CQFLAGS: CQFLAGS (Bitfield-Mask: 0xffff)        */
/* ======================================================  CQSETCLEAR  ======================================================= */
#define MSPI0_CQSETCLEAR_CQFCLR_Pos       (16UL)                    /*!< MSPI0 CQSETCLEAR: CQFCLR (Bit 16)                     */
#define MSPI0_CQSETCLEAR_CQFCLR_Msk       (0xff0000UL)              /*!< MSPI0 CQSETCLEAR: CQFCLR (Bitfield-Mask: 0xff)        */
#define MSPI0_CQSETCLEAR_CQFTOGGLE_Pos    (8UL)                     /*!< MSPI0 CQSETCLEAR: CQFTOGGLE (Bit 8)                   */
#define MSPI0_CQSETCLEAR_CQFTOGGLE_Msk    (0xff00UL)                /*!< MSPI0 CQSETCLEAR: CQFTOGGLE (Bitfield-Mask: 0xff)     */
#define MSPI0_CQSETCLEAR_CQFSET_Pos       (0UL)                     /*!< MSPI0 CQSETCLEAR: CQFSET (Bit 0)                      */
#define MSPI0_CQSETCLEAR_CQFSET_Msk       (0xffUL)                  /*!< MSPI0 CQSETCLEAR: CQFSET (Bitfield-Mask: 0xff)        */
/* ========================================================  CQPAUSE  ======================================================== */
#define MSPI0_CQPAUSE_CQMASK_Pos          (0UL)                     /*!< MSPI0 CQPAUSE: CQMASK (Bit 0)                         */
#define MSPI0_CQPAUSE_CQMASK_Msk          (0xffffUL)                /*!< MSPI0 CQPAUSE: CQMASK (Bitfield-Mask: 0xffff)         */
/* =======================================================  CQCURIDX  ======================================================== */
#define MSPI0_CQCURIDX_CQCURIDX_Pos       (0UL)                     /*!< MSPI0 CQCURIDX: CQCURIDX (Bit 0)                      */
#define MSPI0_CQCURIDX_CQCURIDX_Msk       (0xffUL)                  /*!< MSPI0 CQCURIDX: CQCURIDX (Bitfield-Mask: 0xff)        */
/* =======================================================  CQENDIDX  ======================================================== */
#define MSPI0_CQENDIDX_CQENDIDX_Pos       (0UL)                     /*!< MSPI0 CQENDIDX: CQENDIDX (Bit 0)                      */
#define MSPI0_CQENDIDX_CQENDIDX_Msk       (0xffUL)                  /*!< MSPI0 CQENDIDX: CQENDIDX (Bitfield-Mask: 0xff)        */


/* =========================================================================================================================== */
/* ================                                            PDM                                            ================ */
/* =========================================================================================================================== */

