sparkfun/Arduino_Apollo3/cores/arduino/am_sdk_ap3/CMSIS/AmbiqMicro/Include/apollo3c.h
/* =========================================================  PCFG  ========================================================== */
#define PDM_PCFG_LRSWAP_Pos               (31UL)                    /*!< PDM PCFG: LRSWAP (Bit 31)                             */
#define PDM_PCFG_LRSWAP_Msk               (0x80000000UL)            /*!< PDM PCFG: LRSWAP (Bitfield-Mask: 0x01)                */
#define PDM_PCFG_PGARIGHT_Pos             (26UL)                    /*!< PDM PCFG: PGARIGHT (Bit 26)                           */
#define PDM_PCFG_PGARIGHT_Msk             (0x7c000000UL)            /*!< PDM PCFG: PGARIGHT (Bitfield-Mask: 0x1f)              */
#define PDM_PCFG_PGALEFT_Pos              (21UL)                    /*!< PDM PCFG: PGALEFT (Bit 21)                            */
#define PDM_PCFG_PGALEFT_Msk              (0x3e00000UL)             /*!< PDM PCFG: PGALEFT (Bitfield-Mask: 0x1f)               */
#define PDM_PCFG_MCLKDIV_Pos              (17UL)                    /*!< PDM PCFG: MCLKDIV (Bit 17)                            */
#define PDM_PCFG_MCLKDIV_Msk              (0x60000UL)               /*!< PDM PCFG: MCLKDIV (Bitfield-Mask: 0x03)               */
#define PDM_PCFG_SINCRATE_Pos             (10UL)                    /*!< PDM PCFG: SINCRATE (Bit 10)                           */
#define PDM_PCFG_SINCRATE_Msk             (0x1fc00UL)               /*!< PDM PCFG: SINCRATE (Bitfield-Mask: 0x7f)              */
#define PDM_PCFG_ADCHPD_Pos               (9UL)                     /*!< PDM PCFG: ADCHPD (Bit 9)                              */
#define PDM_PCFG_ADCHPD_Msk               (0x200UL)                 /*!< PDM PCFG: ADCHPD (Bitfield-Mask: 0x01)                */
#define PDM_PCFG_HPCUTOFF_Pos             (5UL)                     /*!< PDM PCFG: HPCUTOFF (Bit 5)                            */
#define PDM_PCFG_HPCUTOFF_Msk             (0x1e0UL)                 /*!< PDM PCFG: HPCUTOFF (Bitfield-Mask: 0x0f)              */
#define PDM_PCFG_CYCLES_Pos               (2UL)                     /*!< PDM PCFG: CYCLES (Bit 2)                              */
#define PDM_PCFG_CYCLES_Msk               (0x1cUL)                  /*!< PDM PCFG: CYCLES (Bitfield-Mask: 0x07)                */
#define PDM_PCFG_SOFTMUTE_Pos             (1UL)                     /*!< PDM PCFG: SOFTMUTE (Bit 1)                            */
#define PDM_PCFG_SOFTMUTE_Msk             (0x2UL)                   /*!< PDM PCFG: SOFTMUTE (Bitfield-Mask: 0x01)              */
#define PDM_PCFG_PDMCOREEN_Pos            (0UL)                     /*!< PDM PCFG: PDMCOREEN (Bit 0)                           */
#define PDM_PCFG_PDMCOREEN_Msk            (0x1UL)                   /*!< PDM PCFG: PDMCOREEN (Bitfield-Mask: 0x01)             */
/* =========================================================  VCFG  ========================================================== */
#define PDM_VCFG_IOCLKEN_Pos              (31UL)                    /*!< PDM VCFG: IOCLKEN (Bit 31)                            */
#define PDM_VCFG_IOCLKEN_Msk              (0x80000000UL)            /*!< PDM VCFG: IOCLKEN (Bitfield-Mask: 0x01)               */
#define PDM_VCFG_RSTB_Pos                 (30UL)                    /*!< PDM VCFG: RSTB (Bit 30)                               */
#define PDM_VCFG_RSTB_Msk                 (0x40000000UL)            /*!< PDM VCFG: RSTB (Bitfield-Mask: 0x01)                  */
#define PDM_VCFG_PDMCLKSEL_Pos            (27UL)                    /*!< PDM VCFG: PDMCLKSEL (Bit 27)                          */
#define PDM_VCFG_PDMCLKSEL_Msk            (0x38000000UL)            /*!< PDM VCFG: PDMCLKSEL (Bitfield-Mask: 0x07)             */
#define PDM_VCFG_PDMCLKEN_Pos             (26UL)                    /*!< PDM VCFG: PDMCLKEN (Bit 26)                           */
#define PDM_VCFG_PDMCLKEN_Msk             (0x4000000UL)             /*!< PDM VCFG: PDMCLKEN (Bitfield-Mask: 0x01)              */
#define PDM_VCFG_I2SEN_Pos                (20UL)                    /*!< PDM VCFG: I2SEN (Bit 20)                              */
#define PDM_VCFG_I2SEN_Msk                (0x100000UL)              /*!< PDM VCFG: I2SEN (Bitfield-Mask: 0x01)                 */
#define PDM_VCFG_BCLKINV_Pos              (19UL)                    /*!< PDM VCFG: BCLKINV (Bit 19)                            */
#define PDM_VCFG_BCLKINV_Msk              (0x80000UL)               /*!< PDM VCFG: BCLKINV (Bitfield-Mask: 0x01)               */
#define PDM_VCFG_DMICKDEL_Pos             (17UL)                    /*!< PDM VCFG: DMICKDEL (Bit 17)                           */
#define PDM_VCFG_DMICKDEL_Msk             (0x20000UL)               /*!< PDM VCFG: DMICKDEL (Bitfield-Mask: 0x01)              */
#define PDM_VCFG_SELAP_Pos                (16UL)                    /*!< PDM VCFG: SELAP (Bit 16)                              */
#define PDM_VCFG_SELAP_Msk                (0x10000UL)               /*!< PDM VCFG: SELAP (Bitfield-Mask: 0x01)                 */
#define PDM_VCFG_PCMPACK_Pos              (8UL)                     /*!< PDM VCFG: PCMPACK (Bit 8)                             */
#define PDM_VCFG_PCMPACK_Msk              (0x100UL)                 /*!< PDM VCFG: PCMPACK (Bitfield-Mask: 0x01)               */
#define PDM_VCFG_CHSET_Pos                (3UL)                     /*!< PDM VCFG: CHSET (Bit 3)                               */
#define PDM_VCFG_CHSET_Msk                (0x18UL)                  /*!< PDM VCFG: CHSET (Bitfield-Mask: 0x03)                 */
/* =======================================================  VOICESTAT  ======================================================= */
#define PDM_VOICESTAT_FIFOCNT_Pos         (0UL)                     /*!< PDM VOICESTAT: FIFOCNT (Bit 0)                        */
#define PDM_VOICESTAT_FIFOCNT_Msk         (0x3fUL)                  /*!< PDM VOICESTAT: FIFOCNT (Bitfield-Mask: 0x3f)          */
/* =======================================================  FIFOREAD  ======================================================== */
#define PDM_FIFOREAD_FIFOREAD_Pos         (0UL)                     /*!< PDM FIFOREAD: FIFOREAD (Bit 0)                        */
#define PDM_FIFOREAD_FIFOREAD_Msk         (0xffffffffUL)            /*!< PDM FIFOREAD: FIFOREAD (Bitfield-Mask: 0xffffffff)    */
/* =======================================================  FIFOFLUSH  ======================================================= */
#define PDM_FIFOFLUSH_FIFOFLUSH_Pos       (0UL)                     /*!< PDM FIFOFLUSH: FIFOFLUSH (Bit 0)                      */
#define PDM_FIFOFLUSH_FIFOFLUSH_Msk       (0x1UL)                   /*!< PDM FIFOFLUSH: FIFOFLUSH (Bitfield-Mask: 0x01)        */
/* ========================================================  FIFOTHR  ======================================================== */
#define PDM_FIFOTHR_FIFOTHR_Pos           (0UL)                     /*!< PDM FIFOTHR: FIFOTHR (Bit 0)                          */
#define PDM_FIFOTHR_FIFOTHR_Msk           (0x1fUL)                  /*!< PDM FIFOTHR: FIFOTHR (Bitfield-Mask: 0x1f)            */
/* =========================================================  INTEN  ========================================================= */
#define PDM_INTEN_DERR_Pos                (4UL)                     /*!< PDM INTEN: DERR (Bit 4)                               */
#define PDM_INTEN_DERR_Msk                (0x10UL)                  /*!< PDM INTEN: DERR (Bitfield-Mask: 0x01)                 */
#define PDM_INTEN_DCMP_Pos                (3UL)                     /*!< PDM INTEN: DCMP (Bit 3)                               */
#define PDM_INTEN_DCMP_Msk                (0x8UL)                   /*!< PDM INTEN: DCMP (Bitfield-Mask: 0x01)                 */
#define PDM_INTEN_UNDFL_Pos               (2UL)                     /*!< PDM INTEN: UNDFL (Bit 2)                              */
#define PDM_INTEN_UNDFL_Msk               (0x4UL)                   /*!< PDM INTEN: UNDFL (Bitfield-Mask: 0x01)                */
#define PDM_INTEN_OVF_Pos                 (1UL)                     /*!< PDM INTEN: OVF (Bit 1)                                */
#define PDM_INTEN_OVF_Msk                 (0x2UL)                   /*!< PDM INTEN: OVF (Bitfield-Mask: 0x01)                  */
#define PDM_INTEN_THR_Pos                 (0UL)                     /*!< PDM INTEN: THR (Bit 0)                                */
#define PDM_INTEN_THR_Msk                 (0x1UL)                   /*!< PDM INTEN: THR (Bitfield-Mask: 0x01)                  */
/* ========================================================  INTSTAT  ======================================================== */
#define PDM_INTSTAT_DERR_Pos              (4UL)                     /*!< PDM INTSTAT: DERR (Bit 4)                             */
#define PDM_INTSTAT_DERR_Msk              (0x10UL)                  /*!< PDM INTSTAT: DERR (Bitfield-Mask: 0x01)               */
#define PDM_INTSTAT_DCMP_Pos              (3UL)                     /*!< PDM INTSTAT: DCMP (Bit 3)                             */
#define PDM_INTSTAT_DCMP_Msk              (0x8UL)                   /*!< PDM INTSTAT: DCMP (Bitfield-Mask: 0x01)               */
#define PDM_INTSTAT_UNDFL_Pos             (2UL)                     /*!< PDM INTSTAT: UNDFL (Bit 2)                            */
#define PDM_INTSTAT_UNDFL_Msk             (0x4UL)                   /*!< PDM INTSTAT: UNDFL (Bitfield-Mask: 0x01)              */
#define PDM_INTSTAT_OVF_Pos               (1UL)                     /*!< PDM INTSTAT: OVF (Bit 1)                              */
#define PDM_INTSTAT_OVF_Msk               (0x2UL)                   /*!< PDM INTSTAT: OVF (Bitfield-Mask: 0x01)                */
#define PDM_INTSTAT_THR_Pos               (0UL)                     /*!< PDM INTSTAT: THR (Bit 0)                              */
#define PDM_INTSTAT_THR_Msk               (0x1UL)                   /*!< PDM INTSTAT: THR (Bitfield-Mask: 0x01)                */
/* ========================================================  INTCLR  ========================================================= */
#define PDM_INTCLR_DERR_Pos               (4UL)                     /*!< PDM INTCLR: DERR (Bit 4)                              */
#define PDM_INTCLR_DERR_Msk               (0x10UL)                  /*!< PDM INTCLR: DERR (Bitfield-Mask: 0x01)                */
#define PDM_INTCLR_DCMP_Pos               (3UL)                     /*!< PDM INTCLR: DCMP (Bit 3)                              */
#define PDM_INTCLR_DCMP_Msk               (0x8UL)                   /*!< PDM INTCLR: DCMP (Bitfield-Mask: 0x01)                */
#define PDM_INTCLR_UNDFL_Pos              (2UL)                     /*!< PDM INTCLR: UNDFL (Bit 2)                             */
#define PDM_INTCLR_UNDFL_Msk              (0x4UL)                   /*!< PDM INTCLR: UNDFL (Bitfield-Mask: 0x01)               */
#define PDM_INTCLR_OVF_Pos                (1UL)                     /*!< PDM INTCLR: OVF (Bit 1)                               */
#define PDM_INTCLR_OVF_Msk                (0x2UL)                   /*!< PDM INTCLR: OVF (Bitfield-Mask: 0x01)                 */
#define PDM_INTCLR_THR_Pos                (0UL)                     /*!< PDM INTCLR: THR (Bit 0)                               */
#define PDM_INTCLR_THR_Msk                (0x1UL)                   /*!< PDM INTCLR: THR (Bitfield-Mask: 0x01)                 */
/* ========================================================  INTSET  ========================================================= */
#define PDM_INTSET_DERR_Pos               (4UL)                     /*!< PDM INTSET: DERR (Bit 4)                              */
#define PDM_INTSET_DERR_Msk               (0x10UL)                  /*!< PDM INTSET: DERR (Bitfield-Mask: 0x01)                */
#define PDM_INTSET_DCMP_Pos               (3UL)                     /*!< PDM INTSET: DCMP (Bit 3)                              */
#define PDM_INTSET_DCMP_Msk               (0x8UL)                   /*!< PDM INTSET: DCMP (Bitfield-Mask: 0x01)                */
#define PDM_INTSET_UNDFL_Pos              (2UL)                     /*!< PDM INTSET: UNDFL (Bit 2)                             */
#define PDM_INTSET_UNDFL_Msk              (0x4UL)                   /*!< PDM INTSET: UNDFL (Bitfield-Mask: 0x01)               */
#define PDM_INTSET_OVF_Pos                (1UL)                     /*!< PDM INTSET: OVF (Bit 1)                               */
#define PDM_INTSET_OVF_Msk                (0x2UL)                   /*!< PDM INTSET: OVF (Bitfield-Mask: 0x01)                 */
#define PDM_INTSET_THR_Pos                (0UL)                     /*!< PDM INTSET: THR (Bit 0)                               */
#define PDM_INTSET_THR_Msk                (0x1UL)                   /*!< PDM INTSET: THR (Bitfield-Mask: 0x01)                 */
/* =======================================================  DMATRIGEN  ======================================================= */
#define PDM_DMATRIGEN_DTHR90_Pos          (1UL)                     /*!< PDM DMATRIGEN: DTHR90 (Bit 1)                         */
#define PDM_DMATRIGEN_DTHR90_Msk          (0x2UL)                   /*!< PDM DMATRIGEN: DTHR90 (Bitfield-Mask: 0x01)           */
#define PDM_DMATRIGEN_DTHR_Pos            (0UL)                     /*!< PDM DMATRIGEN: DTHR (Bit 0)                           */
#define PDM_DMATRIGEN_DTHR_Msk            (0x1UL)                   /*!< PDM DMATRIGEN: DTHR (Bitfield-Mask: 0x01)             */
/* ======================================================  DMATRIGSTAT  ====================================================== */
#define PDM_DMATRIGSTAT_DTHR90STAT_Pos    (1UL)                     /*!< PDM DMATRIGSTAT: DTHR90STAT (Bit 1)                   */
#define PDM_DMATRIGSTAT_DTHR90STAT_Msk    (0x2UL)                   /*!< PDM DMATRIGSTAT: DTHR90STAT (Bitfield-Mask: 0x01)     */
#define PDM_DMATRIGSTAT_DTHRSTAT_Pos      (0UL)                     /*!< PDM DMATRIGSTAT: DTHRSTAT (Bit 0)                     */
#define PDM_DMATRIGSTAT_DTHRSTAT_Msk      (0x1UL)                   /*!< PDM DMATRIGSTAT: DTHRSTAT (Bitfield-Mask: 0x01)       */
/* ========================================================  DMACFG  ========================================================= */
#define PDM_DMACFG_DPWROFF_Pos            (10UL)                    /*!< PDM DMACFG: DPWROFF (Bit 10)                          */
#define PDM_DMACFG_DPWROFF_Msk            (0x400UL)                 /*!< PDM DMACFG: DPWROFF (Bitfield-Mask: 0x01)             */
#define PDM_DMACFG_DAUTOHIP_Pos           (9UL)                     /*!< PDM DMACFG: DAUTOHIP (Bit 9)                          */
#define PDM_DMACFG_DAUTOHIP_Msk           (0x200UL)                 /*!< PDM DMACFG: DAUTOHIP (Bitfield-Mask: 0x01)            */
#define PDM_DMACFG_DMAPRI_Pos             (8UL)                     /*!< PDM DMACFG: DMAPRI (Bit 8)                            */
#define PDM_DMACFG_DMAPRI_Msk             (0x100UL)                 /*!< PDM DMACFG: DMAPRI (Bitfield-Mask: 0x01)              */
#define PDM_DMACFG_DMADIR_Pos             (2UL)                     /*!< PDM DMACFG: DMADIR (Bit 2)                            */
#define PDM_DMACFG_DMADIR_Msk             (0x4UL)                   /*!< PDM DMACFG: DMADIR (Bitfield-Mask: 0x01)              */
#define PDM_DMACFG_DMAEN_Pos              (0UL)                     /*!< PDM DMACFG: DMAEN (Bit 0)                             */
#define PDM_DMACFG_DMAEN_Msk              (0x1UL)                   /*!< PDM DMACFG: DMAEN (Bitfield-Mask: 0x01)               */
/* ======================================================  DMATOTCOUNT  ====================================================== */
#define PDM_DMATOTCOUNT_TOTCOUNT_Pos      (0UL)                     /*!< PDM DMATOTCOUNT: TOTCOUNT (Bit 0)                     */
#define PDM_DMATOTCOUNT_TOTCOUNT_Msk      (0xfffffUL)               /*!< PDM DMATOTCOUNT: TOTCOUNT (Bitfield-Mask: 0xfffff)    */
/* ======================================================  DMATARGADDR  ====================================================== */
#define PDM_DMATARGADDR_UTARGADDR_Pos     (21UL)                    /*!< PDM DMATARGADDR: UTARGADDR (Bit 21)                   */
#define PDM_DMATARGADDR_UTARGADDR_Msk     (0xffe00000UL)            /*!< PDM DMATARGADDR: UTARGADDR (Bitfield-Mask: 0x7ff)     */
#define PDM_DMATARGADDR_LTARGADDR_Pos     (0UL)                     /*!< PDM DMATARGADDR: LTARGADDR (Bit 0)                    */
#define PDM_DMATARGADDR_LTARGADDR_Msk     (0x1fffffUL)              /*!< PDM DMATARGADDR: LTARGADDR (Bitfield-Mask: 0x1fffff)  */
/* ========================================================  DMASTAT  ======================================================== */
#define PDM_DMASTAT_DMAERR_Pos            (2UL)                     /*!< PDM DMASTAT: DMAERR (Bit 2)                           */
#define PDM_DMASTAT_DMAERR_Msk            (0x4UL)                   /*!< PDM DMASTAT: DMAERR (Bitfield-Mask: 0x01)             */
#define PDM_DMASTAT_DMACPL_Pos            (1UL)                     /*!< PDM DMASTAT: DMACPL (Bit 1)                           */
#define PDM_DMASTAT_DMACPL_Msk            (0x2UL)                   /*!< PDM DMASTAT: DMACPL (Bitfield-Mask: 0x01)             */
#define PDM_DMASTAT_DMATIP_Pos            (0UL)                     /*!< PDM DMASTAT: DMATIP (Bit 0)                           */
#define PDM_DMASTAT_DMATIP_Msk            (0x1UL)                   /*!< PDM DMASTAT: DMATIP (Bitfield-Mask: 0x01)             */


/* =========================================================================================================================== */
/* ================                                          PWRCTRL                                          ================ */
/* =========================================================================================================================== */

