sparkfun/Arduino_Apollo3/cores/arduino/am_sdk_ap3/CMSIS/AmbiqMicro/Include/apollo3c.h
/* ==========================================================  SR  =========================================================== */
#define SCARD_SR_FHF_Pos                  (6UL)                     /*!< SCARD SR: FHF (Bit 6)                                 */
#define SCARD_SR_FHF_Msk                  (0x40UL)                  /*!< SCARD SR: FHF (Bitfield-Mask: 0x01)                   */
#define SCARD_SR_FT2REND_Pos              (5UL)                     /*!< SCARD SR: FT2REND (Bit 5)                             */
#define SCARD_SR_FT2REND_Msk              (0x20UL)                  /*!< SCARD SR: FT2REND (Bitfield-Mask: 0x01)               */
#define SCARD_SR_PE_Pos                   (4UL)                     /*!< SCARD SR: PE (Bit 4)                                  */
#define SCARD_SR_PE_Msk                   (0x10UL)                  /*!< SCARD SR: PE (Bitfield-Mask: 0x01)                    */
#define SCARD_SR_OVR_Pos                  (3UL)                     /*!< SCARD SR: OVR (Bit 3)                                 */
#define SCARD_SR_OVR_Msk                  (0x8UL)                   /*!< SCARD SR: OVR (Bitfield-Mask: 0x01)                   */
#define SCARD_SR_FER_Pos                  (2UL)                     /*!< SCARD SR: FER (Bit 2)                                 */
#define SCARD_SR_FER_Msk                  (0x4UL)                   /*!< SCARD SR: FER (Bitfield-Mask: 0x01)                   */
#define SCARD_SR_TBERBF_Pos               (1UL)                     /*!< SCARD SR: TBERBF (Bit 1)                              */
#define SCARD_SR_TBERBF_Msk               (0x2UL)                   /*!< SCARD SR: TBERBF (Bitfield-Mask: 0x01)                */
#define SCARD_SR_FNE_Pos                  (0UL)                     /*!< SCARD SR: FNE (Bit 0)                                 */
#define SCARD_SR_FNE_Msk                  (0x1UL)                   /*!< SCARD SR: FNE (Bitfield-Mask: 0x01)                   */
/* ==========================================================  IER  ========================================================== */
#define SCARD_IER_FHFEN_Pos               (6UL)                     /*!< SCARD IER: FHFEN (Bit 6)                              */
#define SCARD_IER_FHFEN_Msk               (0x40UL)                  /*!< SCARD IER: FHFEN (Bitfield-Mask: 0x01)                */
#define SCARD_IER_FT2RENDEN_Pos           (5UL)                     /*!< SCARD IER: FT2RENDEN (Bit 5)                          */
#define SCARD_IER_FT2RENDEN_Msk           (0x20UL)                  /*!< SCARD IER: FT2RENDEN (Bitfield-Mask: 0x01)            */
#define SCARD_IER_PEEN_Pos                (4UL)                     /*!< SCARD IER: PEEN (Bit 4)                               */
#define SCARD_IER_PEEN_Msk                (0x10UL)                  /*!< SCARD IER: PEEN (Bitfield-Mask: 0x01)                 */
#define SCARD_IER_OVREN_Pos               (3UL)                     /*!< SCARD IER: OVREN (Bit 3)                              */
#define SCARD_IER_OVREN_Msk               (0x8UL)                   /*!< SCARD IER: OVREN (Bitfield-Mask: 0x01)                */
#define SCARD_IER_FEREN_Pos               (2UL)                     /*!< SCARD IER: FEREN (Bit 2)                              */
#define SCARD_IER_FEREN_Msk               (0x4UL)                   /*!< SCARD IER: FEREN (Bitfield-Mask: 0x01)                */
#define SCARD_IER_TBERBFEN_Pos            (1UL)                     /*!< SCARD IER: TBERBFEN (Bit 1)                           */
#define SCARD_IER_TBERBFEN_Msk            (0x2UL)                   /*!< SCARD IER: TBERBFEN (Bitfield-Mask: 0x01)             */
#define SCARD_IER_FNEEN_Pos               (0UL)                     /*!< SCARD IER: FNEEN (Bit 0)                              */
#define SCARD_IER_FNEEN_Msk               (0x1UL)                   /*!< SCARD IER: FNEEN (Bitfield-Mask: 0x01)                */
/* ==========================================================  TCR  ========================================================== */
#define SCARD_TCR_DMAMD_Pos               (7UL)                     /*!< SCARD TCR: DMAMD (Bit 7)                              */
#define SCARD_TCR_DMAMD_Msk               (0x80UL)                  /*!< SCARD TCR: DMAMD (Bitfield-Mask: 0x01)                */
#define SCARD_TCR_FIP_Pos                 (6UL)                     /*!< SCARD TCR: FIP (Bit 6)                                */
#define SCARD_TCR_FIP_Msk                 (0x40UL)                  /*!< SCARD TCR: FIP (Bitfield-Mask: 0x01)                  */
#define SCARD_TCR_AUTOCONV_Pos            (5UL)                     /*!< SCARD TCR: AUTOCONV (Bit 5)                           */
#define SCARD_TCR_AUTOCONV_Msk            (0x20UL)                  /*!< SCARD TCR: AUTOCONV (Bitfield-Mask: 0x01)             */
#define SCARD_TCR_PROT_Pos                (4UL)                     /*!< SCARD TCR: PROT (Bit 4)                               */
#define SCARD_TCR_PROT_Msk                (0x10UL)                  /*!< SCARD TCR: PROT (Bitfield-Mask: 0x01)                 */
#define SCARD_TCR_TR_Pos                  (3UL)                     /*!< SCARD TCR: TR (Bit 3)                                 */
#define SCARD_TCR_TR_Msk                  (0x8UL)                   /*!< SCARD TCR: TR (Bitfield-Mask: 0x01)                   */
#define SCARD_TCR_LCT_Pos                 (2UL)                     /*!< SCARD TCR: LCT (Bit 2)                                */
#define SCARD_TCR_LCT_Msk                 (0x4UL)                   /*!< SCARD TCR: LCT (Bitfield-Mask: 0x01)                  */
#define SCARD_TCR_SS_Pos                  (1UL)                     /*!< SCARD TCR: SS (Bit 1)                                 */
#define SCARD_TCR_SS_Msk                  (0x2UL)                   /*!< SCARD TCR: SS (Bitfield-Mask: 0x01)                   */
#define SCARD_TCR_CONV_Pos                (0UL)                     /*!< SCARD TCR: CONV (Bit 0)                               */
#define SCARD_TCR_CONV_Msk                (0x1UL)                   /*!< SCARD TCR: CONV (Bitfield-Mask: 0x01)                 */
/* ==========================================================  UCR  ========================================================== */
#define SCARD_UCR_RETXEN_Pos              (3UL)                     /*!< SCARD UCR: RETXEN (Bit 3)                             */
#define SCARD_UCR_RETXEN_Msk              (0x8UL)                   /*!< SCARD UCR: RETXEN (Bitfield-Mask: 0x01)               */
#define SCARD_UCR_RSTIN_Pos               (2UL)                     /*!< SCARD UCR: RSTIN (Bit 2)                              */
#define SCARD_UCR_RSTIN_Msk               (0x4UL)                   /*!< SCARD UCR: RSTIN (Bitfield-Mask: 0x01)                */
#define SCARD_UCR_RIU_Pos                 (1UL)                     /*!< SCARD UCR: RIU (Bit 1)                                */
#define SCARD_UCR_RIU_Msk                 (0x2UL)                   /*!< SCARD UCR: RIU (Bitfield-Mask: 0x01)                  */
#define SCARD_UCR_CST_Pos                 (0UL)                     /*!< SCARD UCR: CST (Bit 0)                                */
#define SCARD_UCR_CST_Msk                 (0x1UL)                   /*!< SCARD UCR: CST (Bitfield-Mask: 0x01)                  */
/* ==========================================================  DR  =========================================================== */
#define SCARD_DR_DR_Pos                   (0UL)                     /*!< SCARD DR: DR (Bit 0)                                  */
#define SCARD_DR_DR_Msk                   (0xffUL)                  /*!< SCARD DR: DR (Bitfield-Mask: 0xff)                    */
/* =========================================================  BPRL  ========================================================== */
#define SCARD_BPRL_BPRL_Pos               (0UL)                     /*!< SCARD BPRL: BPRL (Bit 0)                              */
#define SCARD_BPRL_BPRL_Msk               (0xffUL)                  /*!< SCARD BPRL: BPRL (Bitfield-Mask: 0xff)                */
/* =========================================================  BPRH  ========================================================== */
#define SCARD_BPRH_BPRH_Pos               (0UL)                     /*!< SCARD BPRH: BPRH (Bit 0)                              */
#define SCARD_BPRH_BPRH_Msk               (0xfUL)                   /*!< SCARD BPRH: BPRH (Bitfield-Mask: 0x0f)                */
/* =========================================================  UCR1  ========================================================== */
#define SCARD_UCR1_ENLASTB_Pos            (5UL)                     /*!< SCARD UCR1: ENLASTB (Bit 5)                           */
#define SCARD_UCR1_ENLASTB_Msk            (0x20UL)                  /*!< SCARD UCR1: ENLASTB (Bitfield-Mask: 0x01)             */
#define SCARD_UCR1_CLKIOV_Pos             (4UL)                     /*!< SCARD UCR1: CLKIOV (Bit 4)                            */
#define SCARD_UCR1_CLKIOV_Msk             (0x10UL)                  /*!< SCARD UCR1: CLKIOV (Bitfield-Mask: 0x01)              */
#define SCARD_UCR1_T1PAREN_Pos            (3UL)                     /*!< SCARD UCR1: T1PAREN (Bit 3)                           */
#define SCARD_UCR1_T1PAREN_Msk            (0x8UL)                   /*!< SCARD UCR1: T1PAREN (Bitfield-Mask: 0x01)             */
#define SCARD_UCR1_STSP_Pos               (2UL)                     /*!< SCARD UCR1: STSP (Bit 2)                              */
#define SCARD_UCR1_STSP_Msk               (0x4UL)                   /*!< SCARD UCR1: STSP (Bitfield-Mask: 0x01)                */
#define SCARD_UCR1_PR_Pos                 (0UL)                     /*!< SCARD UCR1: PR (Bit 0)                                */
#define SCARD_UCR1_PR_Msk                 (0x1UL)                   /*!< SCARD UCR1: PR (Bitfield-Mask: 0x01)                  */
/* ==========================================================  SR1  ========================================================== */
#define SCARD_SR1_IDLE_Pos                (3UL)                     /*!< SCARD SR1: IDLE (Bit 3)                               */
#define SCARD_SR1_IDLE_Msk                (0x8UL)                   /*!< SCARD SR1: IDLE (Bitfield-Mask: 0x01)                 */
#define SCARD_SR1_SYNCEND_Pos             (2UL)                     /*!< SCARD SR1: SYNCEND (Bit 2)                            */
#define SCARD_SR1_SYNCEND_Msk             (0x4UL)                   /*!< SCARD SR1: SYNCEND (Bitfield-Mask: 0x01)              */
#define SCARD_SR1_PRL_Pos                 (1UL)                     /*!< SCARD SR1: PRL (Bit 1)                                */
#define SCARD_SR1_PRL_Msk                 (0x2UL)                   /*!< SCARD SR1: PRL (Bitfield-Mask: 0x01)                  */
#define SCARD_SR1_ECNTOVER_Pos            (0UL)                     /*!< SCARD SR1: ECNTOVER (Bit 0)                           */
#define SCARD_SR1_ECNTOVER_Msk            (0x1UL)                   /*!< SCARD SR1: ECNTOVER (Bitfield-Mask: 0x01)             */
/* =========================================================  IER1  ========================================================== */
#define SCARD_IER1_SYNCENDEN_Pos          (2UL)                     /*!< SCARD IER1: SYNCENDEN (Bit 2)                         */
#define SCARD_IER1_SYNCENDEN_Msk          (0x4UL)                   /*!< SCARD IER1: SYNCENDEN (Bitfield-Mask: 0x01)           */
#define SCARD_IER1_PRLEN_Pos              (1UL)                     /*!< SCARD IER1: PRLEN (Bit 1)                             */
#define SCARD_IER1_PRLEN_Msk              (0x2UL)                   /*!< SCARD IER1: PRLEN (Bitfield-Mask: 0x01)               */
#define SCARD_IER1_ECNTOVEREN_Pos         (0UL)                     /*!< SCARD IER1: ECNTOVEREN (Bit 0)                        */
#define SCARD_IER1_ECNTOVEREN_Msk         (0x1UL)                   /*!< SCARD IER1: ECNTOVEREN (Bitfield-Mask: 0x01)          */
/* =========================================================  ECNTL  ========================================================= */
#define SCARD_ECNTL_ECNTL_Pos             (0UL)                     /*!< SCARD ECNTL: ECNTL (Bit 0)                            */
#define SCARD_ECNTL_ECNTL_Msk             (0xffUL)                  /*!< SCARD ECNTL: ECNTL (Bitfield-Mask: 0xff)              */
/* =========================================================  ECNTH  ========================================================= */
#define SCARD_ECNTH_ECNTH_Pos             (0UL)                     /*!< SCARD ECNTH: ECNTH (Bit 0)                            */
#define SCARD_ECNTH_ECNTH_Msk             (0xffUL)                  /*!< SCARD ECNTH: ECNTH (Bitfield-Mask: 0xff)              */
/* ==========================================================  GTR  ========================================================== */
#define SCARD_GTR_GTR_Pos                 (0UL)                     /*!< SCARD GTR: GTR (Bit 0)                                */
#define SCARD_GTR_GTR_Msk                 (0xffUL)                  /*!< SCARD GTR: GTR (Bitfield-Mask: 0xff)                  */
/* ========================================================  RETXCNT  ======================================================== */
#define SCARD_RETXCNT_RETXCNT_Pos         (0UL)                     /*!< SCARD RETXCNT: RETXCNT (Bit 0)                        */
#define SCARD_RETXCNT_RETXCNT_Msk         (0xfUL)                   /*!< SCARD RETXCNT: RETXCNT (Bitfield-Mask: 0x0f)          */
/* ======================================================  RETXCNTRMI  ======================================================= */
#define SCARD_RETXCNTRMI_RETXCNTRMI_Pos   (0UL)                     /*!< SCARD RETXCNTRMI: RETXCNTRMI (Bit 0)                  */
#define SCARD_RETXCNTRMI_RETXCNTRMI_Msk   (0xfUL)                   /*!< SCARD RETXCNTRMI: RETXCNTRMI (Bitfield-Mask: 0x0f)    */
/* ========================================================  CLKCTRL  ======================================================== */
#define SCARD_CLKCTRL_APBCLKEN_Pos        (1UL)                     /*!< SCARD CLKCTRL: APBCLKEN (Bit 1)                       */
#define SCARD_CLKCTRL_APBCLKEN_Msk        (0x2UL)                   /*!< SCARD CLKCTRL: APBCLKEN (Bitfield-Mask: 0x01)         */
#define SCARD_CLKCTRL_CLKEN_Pos           (0UL)                     /*!< SCARD CLKCTRL: CLKEN (Bit 0)                          */
#define SCARD_CLKCTRL_CLKEN_Msk           (0x1UL)                   /*!< SCARD CLKCTRL: CLKEN (Bitfield-Mask: 0x01)            */


/* =========================================================================================================================== */
/* ================                                         SECURITY                                          ================ */
/* =========================================================================================================================== */

/* =========================================================  CTRL  ========================================================== */
#define SECURITY_CTRL_CRCERROR_Pos        (31UL)                    /*!< SECURITY CTRL: CRCERROR (Bit 31)                      */
#define SECURITY_CTRL_CRCERROR_Msk        (0x80000000UL)            /*!< SECURITY CTRL: CRCERROR (Bitfield-Mask: 0x01)         */
#define SECURITY_CTRL_FUNCTION_Pos        (4UL)                     /*!< SECURITY CTRL: FUNCTION (Bit 4)                       */
#define SECURITY_CTRL_FUNCTION_Msk        (0xf0UL)                  /*!< SECURITY CTRL: FUNCTION (Bitfield-Mask: 0x0f)         */
#define SECURITY_CTRL_ENABLE_Pos          (0UL)                     /*!< SECURITY CTRL: ENABLE (Bit 0)                         */
#define SECURITY_CTRL_ENABLE_Msk          (0x1UL)                   /*!< SECURITY CTRL: ENABLE (Bitfield-Mask: 0x01)           */
/* ========================================================  SRCADDR  ======================================================== */
#define SECURITY_SRCADDR_ADDR_Pos         (0UL)                     /*!< SECURITY SRCADDR: ADDR (Bit 0)                        */
#define SECURITY_SRCADDR_ADDR_Msk         (0xffffffffUL)            /*!< SECURITY SRCADDR: ADDR (Bitfield-Mask: 0xffffffff)    */
/* ==========================================================  LEN  ========================================================== */
#define SECURITY_LEN_LEN_Pos              (2UL)                     /*!< SECURITY LEN: LEN (Bit 2)                             */
#define SECURITY_LEN_LEN_Msk              (0xfffffcUL)              /*!< SECURITY LEN: LEN (Bitfield-Mask: 0x3fffff)           */
/* ========================================================  RESULT  ========================================================= */
#define SECURITY_RESULT_CRC_Pos           (0UL)                     /*!< SECURITY RESULT: CRC (Bit 0)                          */
#define SECURITY_RESULT_CRC_Msk           (0xffffffffUL)            /*!< SECURITY RESULT: CRC (Bitfield-Mask: 0xffffffff)      */
/* =======================================================  LOCKCTRL  ======================================================== */
#define SECURITY_LOCKCTRL_SELECT_Pos      (0UL)                     /*!< SECURITY LOCKCTRL: SELECT (Bit 0)                     */
#define SECURITY_LOCKCTRL_SELECT_Msk      (0xffUL)                  /*!< SECURITY LOCKCTRL: SELECT (Bitfield-Mask: 0xff)       */
/* =======================================================  LOCKSTAT  ======================================================== */
#define SECURITY_LOCKSTAT_STATUS_Pos      (0UL)                     /*!< SECURITY LOCKSTAT: STATUS (Bit 0)                     */
#define SECURITY_LOCKSTAT_STATUS_Msk      (0xffffffffUL)            /*!< SECURITY LOCKSTAT: STATUS (Bitfield-Mask: 0xffffffff) */
/* =========================================================  KEY0  ========================================================== */
#define SECURITY_KEY0_KEY0_Pos            (0UL)                     /*!< SECURITY KEY0: KEY0 (Bit 0)                           */
#define SECURITY_KEY0_KEY0_Msk            (0xffffffffUL)            /*!< SECURITY KEY0: KEY0 (Bitfield-Mask: 0xffffffff)       */
/* =========================================================  KEY1  ========================================================== */
#define SECURITY_KEY1_KEY1_Pos            (0UL)                     /*!< SECURITY KEY1: KEY1 (Bit 0)                           */
#define SECURITY_KEY1_KEY1_Msk            (0xffffffffUL)            /*!< SECURITY KEY1: KEY1 (Bitfield-Mask: 0xffffffff)       */
/* =========================================================  KEY2  ========================================================== */
#define SECURITY_KEY2_KEY2_Pos            (0UL)                     /*!< SECURITY KEY2: KEY2 (Bit 0)                           */
#define SECURITY_KEY2_KEY2_Msk            (0xffffffffUL)            /*!< SECURITY KEY2: KEY2 (Bitfield-Mask: 0xffffffff)       */
/* =========================================================  KEY3  ========================================================== */
#define SECURITY_KEY3_KEY3_Pos            (0UL)                     /*!< SECURITY KEY3: KEY3 (Bit 0)                           */
#define SECURITY_KEY3_KEY3_Msk            (0xffffffffUL)            /*!< SECURITY KEY3: KEY3 (Bitfield-Mask: 0xffffffff)       */


/* =========================================================================================================================== */
/* ================                                           UART0                                           ================ */
/* =========================================================================================================================== */

