sparkfun/Arduino_Apollo3/cores/arduino/am_sdk_ap3/CMSIS/AmbiqMicro/Include/apollo3c.h
/* ===============================================  BLEIF MSPICFG SPOL [0..0]  =============================================== */
typedef enum {                                  /*!< BLEIF_MSPICFG_SPOL                                                        */
  BLEIF_MSPICFG_SPOL_CLK_BASE_0        = 0,     /*!< CLK_BASE_0 : The initial value of the clock is 0.                         */
  BLEIF_MSPICFG_SPOL_CLK_BASE_1        = 1,     /*!< CLK_BASE_1 : The initial value of the clock is 1.                         */
} BLEIF_MSPICFG_SPOL_Enum;

/* ========================================================  BLECFG  ========================================================= */
/* ============================================  BLEIF BLECFG SPIISOCTL [14..15]  ============================================ */
typedef enum {                                  /*!< BLEIF_BLECFG_SPIISOCTL                                                    */
  BLEIF_BLECFG_SPIISOCTL_ON            = 3,     /*!< ON : SPI signals from BLE Core to/from MCU Core are isolated.             */
  BLEIF_BLECFG_SPIISOCTL_OFF           = 2,     /*!< OFF : SPI signals from BLE Core to/from MCU Core are not isolated.        */
  BLEIF_BLECFG_SPIISOCTL_AUTO          = 0,     /*!< AUTO : SPI signals from BLE Core to/from MCU Core are automatically
                                                     isolated by the logic                                                     */
} BLEIF_BLECFG_SPIISOCTL_Enum;

/* ============================================  BLEIF BLECFG PWRISOCTL [12..13]  ============================================ */
typedef enum {                                  /*!< BLEIF_BLECFG_PWRISOCTL                                                    */
  BLEIF_BLECFG_PWRISOCTL_ON            = 3,     /*!< ON : BLEH power signal isolation to on (isolated).                        */
  BLEIF_BLECFG_PWRISOCTL_OFF           = 2,     /*!< OFF : BLEH power signal isolation to off (not isolated).                  */
  BLEIF_BLECFG_PWRISOCTL_AUTO          = 0,     /*!< AUTO : BLEH Power signal isolation is controlled automatically
                                                     through the interface logic                                               */
} BLEIF_BLECFG_PWRISOCTL_Enum;

/* ============================================  BLEIF BLECFG BLEHREQCTL [6..7]  ============================================= */
typedef enum {                                  /*!< BLEIF_BLECFG_BLEHREQCTL                                                   */
  BLEIF_BLECFG_BLEHREQCTL_ON           = 3,     /*!< ON : BLEH Power-on reg signal is set to on (1).                           */
  BLEIF_BLECFG_BLEHREQCTL_OFF          = 2,     /*!< OFF : BLEH Power-on signal is set to off (0).                             */
  BLEIF_BLECFG_BLEHREQCTL_AUTO         = 0,     /*!< AUTO : BLEH Power-on signal is controlled by the PWRSM logic
                                                     and automatically controlled                                              */
} BLEIF_BLECFG_BLEHREQCTL_Enum;

/* ============================================  BLEIF BLECFG DCDCFLGCTL [4..5]  ============================================= */
typedef enum {                                  /*!< BLEIF_BLECFG_DCDCFLGCTL                                                   */
  BLEIF_BLECFG_DCDCFLGCTL_ON           = 3,     /*!< ON : DCDC Flag signal is set to on (1).                                   */
  BLEIF_BLECFG_DCDCFLGCTL_OFF          = 2,     /*!< OFF : DCDC Flag signal is set to off (0).                                 */
  BLEIF_BLECFG_DCDCFLGCTL_AUTO         = 0,     /*!< AUTO : DCDC Flag signal is controlled by the PWRSM logic and
                                                     automatically controlled                                                  */
} BLEIF_BLECFG_DCDCFLGCTL_Enum;

/* =============================================  BLEIF BLECFG WAKEUPCTL [2..3]  ============================================= */
typedef enum {                                  /*!< BLEIF_BLECFG_WAKEUPCTL                                                    */
  BLEIF_BLECFG_WAKEUPCTL_ON            = 3,     /*!< ON : Wake signal is set to on (1).                                        */
  BLEIF_BLECFG_WAKEUPCTL_OFF           = 2,     /*!< OFF : Wake signal is set to off (0).                                      */
  BLEIF_BLECFG_WAKEUPCTL_AUTO          = 0,     /*!< AUTO : Wake signal is controlled by the PWRSM logic and automatically
                                                     controlled                                                                */
} BLEIF_BLECFG_WAKEUPCTL_Enum;

/* ==============================================  BLEIF BLECFG BLERSTN [1..1]  ============================================== */
typedef enum {                                  /*!< BLEIF_BLECFG_BLERSTN                                                      */
  BLEIF_BLECFG_BLERSTN_ACTIVE          = 1,     /*!< ACTIVE : The reset signal is active (0)                                   */
  BLEIF_BLECFG_BLERSTN_INACTIVE        = 0,     /*!< INACTIVE : The reset signal is inactive (1)                               */
} BLEIF_BLECFG_BLERSTN_Enum;

/* ==============================================  BLEIF BLECFG PWRSMEN [0..0]  ============================================== */
typedef enum {                                  /*!< BLEIF_BLECFG_PWRSMEN                                                      */
  BLEIF_BLECFG_PWRSMEN_ON              = 1,     /*!< ON : Internal power state machine is enabled and will sequence
                                                     the BLEH power domain as indicated in the design document.
                                                     Overrides for the power signals are not enabled.                          */
  BLEIF_BLECFG_PWRSMEN_OFF             = 0,     /*!< OFF : Internal power state machine is disabled and will not
                                                     sequence the BLEH power domain. The values of the overrides
                                                     will be used to drive the output sequencing signals                       */
} BLEIF_BLECFG_PWRSMEN_Enum;

/* ========================================================  PWRCMD  ========================================================= */
/* ========================================================  BSTATUS  ======================================================== */
/* ==============================================  BLEIF BSTATUS PWRST [8..10]  ============================================== */
typedef enum {                                  /*!< BLEIF_BSTATUS_PWRST                                                       */
  BLEIF_BSTATUS_PWRST_OFF              = 0,     /*!< OFF : Internal power state machine is disabled and will not
                                                     sequence the BLEH power domain. The values of the overrides
                                                     will be used to drive the output sequencing signals                       */
  BLEIF_BSTATUS_PWRST_INIT             = 1,     /*!< INIT : Initialization state. BLEH not powered                             */
  BLEIF_BSTATUS_PWRST_PWRON            = 2,     /*!< PWRON : Waiting for the powerup of the BLEH                               */
  BLEIF_BSTATUS_PWRST_ACTIVE           = 3,     /*!< ACTIVE : The BLE Core is powered and active                               */
  BLEIF_BSTATUS_PWRST_SLEEP            = 6,     /*!< SLEEP : The BLE Core has entered sleep mode and the power request
                                                     is inactive                                                               */
  BLEIF_BSTATUS_PWRST_SHUTDOWN         = 4,     /*!< SHUTDOWN : The BLE Core is in shutdown mode                               */
} BLEIF_BSTATUS_PWRST_Enum;

/* =============================================  BLEIF BSTATUS B2MSTATE [0..2]  ============================================= */
typedef enum {                                  /*!< BLEIF_BSTATUS_B2MSTATE                                                    */
  BLEIF_BSTATUS_B2MSTATE_RESET         = 0,     /*!< RESET : Reset State                                                       */
  BLEIF_BSTATUS_B2MSTATE_Sleep         = 1,     /*!< Sleep : Sleep state.                                                      */
  BLEIF_BSTATUS_B2MSTATE_Standby       = 2,     /*!< Standby : Standby State                                                   */
  BLEIF_BSTATUS_B2MSTATE_Idle          = 3,     /*!< Idle : Idle state                                                         */
  BLEIF_BSTATUS_B2MSTATE_Active        = 4,     /*!< Active : Active state.                                                    */
} BLEIF_BSTATUS_B2MSTATE_Enum;

/* ========================================================  BLEDBG  ========================================================= */


/* =========================================================================================================================== */
/* ================                                         CACHECTRL                                         ================ */
/* =========================================================================================================================== */

