sparkfun/Arduino_Apollo3/cores/arduino/am_sdk_ap3/CMSIS/AmbiqMicro/Include/apollo3c.h
/* =======================================================  CACHECFG  ======================================================== */
/* ===========================================  CACHECTRL CACHECFG CONFIG [4..7]  ============================================ */
typedef enum {                                  /*!< CACHECTRL_CACHECFG_CONFIG                                                 */
  CACHECTRL_CACHECFG_CONFIG_W1_128B_512E = 4,   /*!< W1_128B_512E : Direct mapped, 128-bit linesize, 512 entries
                                                     (4 SRAMs active)                                                          */
  CACHECTRL_CACHECFG_CONFIG_W2_128B_512E = 5,   /*!< W2_128B_512E : Two-way set associative, 128-bit linesize, 512
                                                     entries (8 SRAMs active)                                                  */
  CACHECTRL_CACHECFG_CONFIG_W1_128B_1024E = 8,  /*!< W1_128B_1024E : Direct mapped, 128-bit linesize, 1024 entries
                                                     (8 SRAMs active)                                                          */
} CACHECTRL_CACHECFG_CONFIG_Enum;

/* =========================================================  CTRL  ========================================================== */
/* ===========================================  CACHECTRL CTRL RESET_STAT [1..1]  ============================================ */
typedef enum {                                  /*!< CACHECTRL_CTRL_RESET_STAT                                                 */
  CACHECTRL_CTRL_RESET_STAT_CLEAR      = 1,     /*!< CLEAR : Clear Cache Stats                                                 */
} CACHECTRL_CTRL_RESET_STAT_Enum;

/* =======================================================  NCR0START  ======================================================= */
/* ========================================================  NCR0END  ======================================================== */
/* =======================================================  NCR1START  ======================================================= */
/* ========================================================  NCR1END  ======================================================== */
/* =========================================================  DMON0  ========================================================= */
/* =========================================================  DMON1  ========================================================= */
/* =========================================================  DMON2  ========================================================= */
/* =========================================================  DMON3  ========================================================= */
/* =========================================================  IMON0  ========================================================= */
/* =========================================================  IMON1  ========================================================= */
/* =========================================================  IMON2  ========================================================= */
/* =========================================================  IMON3  ========================================================= */
/* =======================================================  FLASH0CFG  ======================================================= */
/* =========================================  CACHECTRL FLASH0CFG LPMMODE0 [12..13]  ========================================= */
typedef enum {                                  /*!< CACHECTRL_FLASH0CFG_LPMMODE0                                              */
  CACHECTRL_FLASH0CFG_LPMMODE0_NEVER   = 0,     /*!< NEVER : High power mode (LPM not used).                                   */
  CACHECTRL_FLASH0CFG_LPMMODE0_STANDBY = 1,     /*!< STANDBY : Fast Standby mode. LPM deasserted for read operations,
                                                     but asserted while flash IDLE.                                            */
  CACHECTRL_FLASH0CFG_LPMMODE0_ALWAYS  = 2,     /*!< ALWAYS : Low Power mode. LPM always asserted for reads. LPM_RD_WAIT
                                                     must be programmed to accomodate longer read access times.                */
} CACHECTRL_FLASH0CFG_LPMMODE0_Enum;

/* =======================================================  FLASH1CFG  ======================================================= */
/* =========================================  CACHECTRL FLASH1CFG LPMMODE1 [12..13]  ========================================= */
typedef enum {                                  /*!< CACHECTRL_FLASH1CFG_LPMMODE1                                              */
  CACHECTRL_FLASH1CFG_LPMMODE1_NEVER   = 0,     /*!< NEVER : High power mode (LPM not used).                                   */
  CACHECTRL_FLASH1CFG_LPMMODE1_STANDBY = 1,     /*!< STANDBY : Fast Standby mode. LPM deasserted for read operations,
                                                     but asserted while flash IDLE.                                            */
  CACHECTRL_FLASH1CFG_LPMMODE1_ALWAYS  = 2,     /*!< ALWAYS : Low Power mode. LPM always asserted for reads. LPM_RD_WAIT
                                                     must be programmed to accomodate longer read access times.                */
} CACHECTRL_FLASH1CFG_LPMMODE1_Enum;

/* =======================================================  FLASH2CFG  ======================================================= */
/* =========================================  CACHECTRL FLASH2CFG LPMMODE2 [12..13]  ========================================= */
typedef enum {                                  /*!< CACHECTRL_FLASH2CFG_LPMMODE2                                              */
  CACHECTRL_FLASH2CFG_LPMMODE2_NEVER   = 0,     /*!< NEVER : High power mode (LPM not used).                                   */
  CACHECTRL_FLASH2CFG_LPMMODE2_STANDBY = 1,     /*!< STANDBY : Fast Standby mode. LPM deasserted for read operations,
                                                     but asserted while flash IDLE.                                            */
  CACHECTRL_FLASH2CFG_LPMMODE2_ALWAYS  = 2,     /*!< ALWAYS : Low Power mode. LPM always asserted for reads. LPM_RD_WAIT
                                                     must be programmed to accomodate longer read access times.                */
} CACHECTRL_FLASH2CFG_LPMMODE2_Enum;

