sparkfun/Arduino_Apollo3/cores/arduino/am_sdk_ap3/CMSIS/AmbiqMicro/Include/apollo3c.h
/* ============================================  CTIMER AUX3 TMRA3POL23 [13..13]  ============================================ */
typedef enum {                                  /*!< CTIMER_AUX3_TMRA3POL23                                                    */
  CTIMER_AUX3_TMRA3POL23_NORM          = 0,     /*!< NORM : Upper output normal polarity                                       */
  CTIMER_AUX3_TMRA3POL23_INV           = 1,     /*!< INV : Upper output inverted polarity.                                     */
} CTIMER_AUX3_TMRA3POL23_Enum;

/* ============================================  CTIMER AUX3 TMRA3TINV [12..12]  ============================================= */
typedef enum {                                  /*!< CTIMER_AUX3_TMRA3TINV                                                     */
  CTIMER_AUX3_TMRA3TINV_DIS            = 0,     /*!< DIS : Disable invert on trigger                                           */
  CTIMER_AUX3_TMRA3TINV_EN             = 1,     /*!< EN : Enable invert on trigger                                             */
} CTIMER_AUX3_TMRA3TINV_Enum;

/* ===========================================  CTIMER AUX3 TMRA3NOSYNC [11..11]  ============================================ */
typedef enum {                                  /*!< CTIMER_AUX3_TMRA3NOSYNC                                                   */
  CTIMER_AUX3_TMRA3NOSYNC_DIS          = 0,     /*!< DIS : Synchronization on source clock                                     */
  CTIMER_AUX3_TMRA3NOSYNC_NOSYNC       = 1,     /*!< NOSYNC : No synchronization on source clock                               */
} CTIMER_AUX3_TMRA3NOSYNC_Enum;

/* =============================================  CTIMER AUX3 TMRA3TRIG [7..10]  ============================================= */
typedef enum {                                  /*!< CTIMER_AUX3_TMRA3TRIG                                                     */
  CTIMER_AUX3_TMRA3TRIG_DIS            = 0,     /*!< DIS : Trigger source is disabled.                                         */
  CTIMER_AUX3_TMRA3TRIG_B3OUT          = 1,     /*!< B3OUT : Trigger source is CTIMERB3 OUT.                                   */
  CTIMER_AUX3_TMRA3TRIG_B2OUT          = 2,     /*!< B2OUT : Trigger source is CTIMERB2 OUT.                                   */
  CTIMER_AUX3_TMRA3TRIG_A2OUT          = 3,     /*!< A2OUT : Trigger source is CTIMERA2 OUT.                                   */
  CTIMER_AUX3_TMRA3TRIG_A4OUT          = 4,     /*!< A4OUT : Trigger source is CTIMERA4 OUT.                                   */
  CTIMER_AUX3_TMRA3TRIG_B4OUT          = 5,     /*!< B4OUT : Trigger source is CTIMERB4 OUT.                                   */
  CTIMER_AUX3_TMRA3TRIG_A7OUT          = 6,     /*!< A7OUT : Trigger source is CTIMERA7 OUT.                                   */
  CTIMER_AUX3_TMRA3TRIG_B7OUT          = 7,     /*!< B7OUT : Trigger source is CTIMERB7 OUT.                                   */
  CTIMER_AUX3_TMRA3TRIG_B5OUT2         = 8,     /*!< B5OUT2 : Trigger source is CTIMERB5 OUT2.                                 */
  CTIMER_AUX3_TMRA3TRIG_A5OUT2         = 9,     /*!< A5OUT2 : Trigger source is CTIMERA5 OUT2.                                 */
  CTIMER_AUX3_TMRA3TRIG_A1OUT2         = 10,    /*!< A1OUT2 : Trigger source is CTIMERA1 OUT2.                                 */
  CTIMER_AUX3_TMRA3TRIG_B1OUT2         = 11,    /*!< B1OUT2 : Trigger source is CTIMERB1 OUT2.                                 */
  CTIMER_AUX3_TMRA3TRIG_A6OUT2DUAL     = 12,    /*!< A6OUT2DUAL : Trigger source is CTIMERA6 OUT2, dual edge.                  */
  CTIMER_AUX3_TMRA3TRIG_A7OUT2DUAL     = 13,    /*!< A7OUT2DUAL : Trigger source is CTIMERA7 OUT2, dual edge.                  */
  CTIMER_AUX3_TMRA3TRIG_B2OUT2DUAL     = 14,    /*!< B2OUT2DUAL : Trigger source is CTIMERB2 OUT2, dual edge.                  */
  CTIMER_AUX3_TMRA3TRIG_A2OUT2DUAL     = 15,    /*!< A2OUT2DUAL : Trigger source is CTIMERA2 OUT2, dual edge.                  */
} CTIMER_AUX3_TMRA3TRIG_Enum;

/* =========================================================  TMR4  ========================================================== */
/* ========================================================  CMPRA4  ========================================================= */
/* ========================================================  CMPRB4  ========================================================= */
/* =========================================================  CTRL4  ========================================================= */
/* =============================================  CTIMER CTRL4 CTLINK4 [31..31]  ============================================= */
typedef enum {                                  /*!< CTIMER_CTRL4_CTLINK4                                                      */
  CTIMER_CTRL4_CTLINK4_TWO_16BIT_TIMERS = 0,    /*!< TWO_16BIT_TIMERS : Use A4/B4 timers as two independent 16-bit
                                                     timers (default).                                                         */
  CTIMER_CTRL4_CTLINK4_32BIT_TIMER     = 1,     /*!< 32BIT_TIMER : Link A4/B4 timers into a single 32-bit timer.               */
} CTIMER_CTRL4_CTLINK4_Enum;

/* ============================================  CTIMER CTRL4 TMRB4POL [28..28]  ============================================= */
typedef enum {                                  /*!< CTIMER_CTRL4_TMRB4POL                                                     */
  CTIMER_CTRL4_TMRB4POL_NORMAL         = 0,     /*!< NORMAL : The polarity of the TMRPINB4 pin is the same as the
                                                     timer output.                                                             */
  CTIMER_CTRL4_TMRB4POL_INVERTED       = 1,     /*!< INVERTED : The polarity of the TMRPINB4 pin is the inverse of
                                                     the timer output.                                                         */
} CTIMER_CTRL4_TMRB4POL_Enum;

/* ============================================  CTIMER CTRL4 TMRB4CLR [27..27]  ============================================= */
typedef enum {                                  /*!< CTIMER_CTRL4_TMRB4CLR                                                     */
  CTIMER_CTRL4_TMRB4CLR_RUN            = 0,     /*!< RUN : Allow counter/timer B4 to run                                       */
  CTIMER_CTRL4_TMRB4CLR_CLEAR          = 1,     /*!< CLEAR : Holds counter/timer B4 at 0x0000.                                 */
} CTIMER_CTRL4_TMRB4CLR_Enum;

