sparkfun/Arduino_Apollo3/cores/arduino/am_sdk_ap3/CMSIS/AmbiqMicro/Include/apollo3c.h
/* ===============================================  CTIMER GLOBEN ENA4 [8..8]  =============================================== */
typedef enum {                                  /*!< CTIMER_GLOBEN_ENA4                                                        */
  CTIMER_GLOBEN_ENA4_LCO               = 1,     /*!< LCO : Use local enable.                                                   */
  CTIMER_GLOBEN_ENA4_DIS               = 0,     /*!< DIS : Disable CTIMER.                                                     */
} CTIMER_GLOBEN_ENA4_Enum;

/* ===============================================  CTIMER GLOBEN ENB3 [7..7]  =============================================== */
typedef enum {                                  /*!< CTIMER_GLOBEN_ENB3                                                        */
  CTIMER_GLOBEN_ENB3_LCO               = 1,     /*!< LCO : Use local enable.                                                   */
  CTIMER_GLOBEN_ENB3_DIS               = 0,     /*!< DIS : Disable CTIMER.                                                     */
} CTIMER_GLOBEN_ENB3_Enum;

/* ===============================================  CTIMER GLOBEN ENA3 [6..6]  =============================================== */
typedef enum {                                  /*!< CTIMER_GLOBEN_ENA3                                                        */
  CTIMER_GLOBEN_ENA3_LCO               = 1,     /*!< LCO : Use local enable.                                                   */
  CTIMER_GLOBEN_ENA3_DIS               = 0,     /*!< DIS : Disable CTIMER.                                                     */
} CTIMER_GLOBEN_ENA3_Enum;

/* ===============================================  CTIMER GLOBEN ENB2 [5..5]  =============================================== */
typedef enum {                                  /*!< CTIMER_GLOBEN_ENB2                                                        */
  CTIMER_GLOBEN_ENB2_LCO               = 1,     /*!< LCO : Use local enable.                                                   */
  CTIMER_GLOBEN_ENB2_DIS               = 0,     /*!< DIS : Disable CTIMER.                                                     */
} CTIMER_GLOBEN_ENB2_Enum;

/* ===============================================  CTIMER GLOBEN ENA2 [4..4]  =============================================== */
typedef enum {                                  /*!< CTIMER_GLOBEN_ENA2                                                        */
  CTIMER_GLOBEN_ENA2_LCO               = 1,     /*!< LCO : Use local enable.                                                   */
  CTIMER_GLOBEN_ENA2_DIS               = 0,     /*!< DIS : Disable CTIMER.                                                     */
} CTIMER_GLOBEN_ENA2_Enum;

/* ===============================================  CTIMER GLOBEN ENB1 [3..3]  =============================================== */
typedef enum {                                  /*!< CTIMER_GLOBEN_ENB1                                                        */
  CTIMER_GLOBEN_ENB1_LCO               = 1,     /*!< LCO : Use local enable.                                                   */
  CTIMER_GLOBEN_ENB1_DIS               = 0,     /*!< DIS : Disable CTIMER.                                                     */
} CTIMER_GLOBEN_ENB1_Enum;

/* ===============================================  CTIMER GLOBEN ENA1 [2..2]  =============================================== */
typedef enum {                                  /*!< CTIMER_GLOBEN_ENA1                                                        */
  CTIMER_GLOBEN_ENA1_LCO               = 1,     /*!< LCO : Use local enable.                                                   */
  CTIMER_GLOBEN_ENA1_DIS               = 0,     /*!< DIS : Disable CTIMER.                                                     */
} CTIMER_GLOBEN_ENA1_Enum;

/* ===============================================  CTIMER GLOBEN ENB0 [1..1]  =============================================== */
typedef enum {                                  /*!< CTIMER_GLOBEN_ENB0                                                        */
  CTIMER_GLOBEN_ENB0_LCO               = 1,     /*!< LCO : Use local enable.                                                   */
  CTIMER_GLOBEN_ENB0_DIS               = 0,     /*!< DIS : Disable CTIMER.                                                     */
} CTIMER_GLOBEN_ENB0_Enum;

/* ===============================================  CTIMER GLOBEN ENA0 [0..0]  =============================================== */
typedef enum {                                  /*!< CTIMER_GLOBEN_ENA0                                                        */
  CTIMER_GLOBEN_ENA0_LCO               = 1,     /*!< LCO : Use local enable.                                                   */
  CTIMER_GLOBEN_ENA0_DIS               = 0,     /*!< DIS : Disable CTIMER.                                                     */
} CTIMER_GLOBEN_ENA0_Enum;

/* ========================================================  OUTCFG0  ======================================================== */
/* =============================================  CTIMER OUTCFG0 CFG9 [28..30]  ============================================== */
typedef enum {                                  /*!< CTIMER_OUTCFG0_CFG9                                                       */
  CTIMER_OUTCFG0_CFG9_A7OUT2           = 7,     /*!< A7OUT2 : Output is A7OUT2.                                                */
  CTIMER_OUTCFG0_CFG9_A6OUT2           = 6,     /*!< A6OUT2 : Output is A6OUT2.                                                */
  CTIMER_OUTCFG0_CFG9_B0OUT            = 5,     /*!< B0OUT : Output is B0OUT.                                                  */
  CTIMER_OUTCFG0_CFG9_A4OUT            = 4,     /*!< A4OUT : Output is A4OUT.                                                  */
  CTIMER_OUTCFG0_CFG9_A2OUT            = 3,     /*!< A2OUT : Output is A2OUT.                                                  */
  CTIMER_OUTCFG0_CFG9_A2OUT2           = 2,     /*!< A2OUT2 : Output is A2OUT2                                                 */
  CTIMER_OUTCFG0_CFG9_ONE              = 1,     /*!< ONE : Force output to 1.                                                  */
  CTIMER_OUTCFG0_CFG9_ZERO             = 0,     /*!< ZERO : Force output to 0                                                  */
} CTIMER_OUTCFG0_CFG9_Enum;

/* =============================================  CTIMER OUTCFG0 CFG8 [25..27]  ============================================== */
typedef enum {                                  /*!< CTIMER_OUTCFG0_CFG8                                                       */
  CTIMER_OUTCFG0_CFG8_A7OUT2           = 7,     /*!< A7OUT2 : Output is A7OUT2.                                                */
  CTIMER_OUTCFG0_CFG8_A6OUT2           = 6,     /*!< A6OUT2 : Output is A6OUT2.                                                */
  CTIMER_OUTCFG0_CFG8_B6OUT            = 5,     /*!< B6OUT : Output is B6OUT.                                                  */
  CTIMER_OUTCFG0_CFG8_A4OUT2           = 4,     /*!< A4OUT2 : Output is A4OUT2.                                                */
  CTIMER_OUTCFG0_CFG8_A3OUT2           = 3,     /*!< A3OUT2 : Output is A3OUT.                                                 */
  CTIMER_OUTCFG0_CFG8_A2OUT            = 2,     /*!< A2OUT : Output is A2OUT                                                   */
  CTIMER_OUTCFG0_CFG8_ONE              = 1,     /*!< ONE : Force output to 1.                                                  */
  CTIMER_OUTCFG0_CFG8_ZERO             = 0,     /*!< ZERO : Force output to 0                                                  */
} CTIMER_OUTCFG0_CFG8_Enum;

