sparkfun/Arduino_Apollo3/cores/arduino/am_sdk_ap3/CMSIS/AmbiqMicro/Include/apollo3c.h
/* ========================================================  OUTCFG3  ======================================================== */
/* ==============================================  CTIMER OUTCFG3 CFG31 [3..5]  ============================================== */
typedef enum {                                  /*!< CTIMER_OUTCFG3_CFG31                                                      */
  CTIMER_OUTCFG3_CFG31_A7OUT2          = 7,     /*!< A7OUT2 : Output is A7OUT2.                                                */
  CTIMER_OUTCFG3_CFG31_A6OUT2          = 6,     /*!< A6OUT2 : Output is A6OUT2.                                                */
  CTIMER_OUTCFG3_CFG31_B3OUT2          = 5,     /*!< B3OUT2 : Output is B3OUT2.                                                */
  CTIMER_OUTCFG3_CFG31_B7OUT           = 4,     /*!< B7OUT : Output is B7OUT.                                                  */
  CTIMER_OUTCFG3_CFG31_A6OUT           = 3,     /*!< A6OUT : Output is A6OUT.                                                  */
  CTIMER_OUTCFG3_CFG31_B7OUT2          = 2,     /*!< B7OUT2 : Output is B7OUT2                                                 */
  CTIMER_OUTCFG3_CFG31_ONE             = 1,     /*!< ONE : Force output to 1.                                                  */
  CTIMER_OUTCFG3_CFG31_ZERO            = 0,     /*!< ZERO : Force output to 0                                                  */
} CTIMER_OUTCFG3_CFG31_Enum;

/* ==============================================  CTIMER OUTCFG3 CFG30 [0..2]  ============================================== */
typedef enum {                                  /*!< CTIMER_OUTCFG3_CFG30                                                      */
  CTIMER_OUTCFG3_CFG30_A7OUT2          = 7,     /*!< A7OUT2 : Output is A7OUT2.                                                */
  CTIMER_OUTCFG3_CFG30_A6OUT2          = 6,     /*!< A6OUT2 : Output is A6OUT2.                                                */
  CTIMER_OUTCFG3_CFG30_A0OUT2          = 5,     /*!< A0OUT2 : Output is A0OUT2.                                                */
  CTIMER_OUTCFG3_CFG30_A4OUT2          = 4,     /*!< A4OUT2 : Output is A4OUT2.                                                */
  CTIMER_OUTCFG3_CFG30_B3OUT           = 3,     /*!< B3OUT : Output is B3OUT.                                                  */
  CTIMER_OUTCFG3_CFG30_B7OUT           = 2,     /*!< B7OUT : Output is B7OUT                                                   */
  CTIMER_OUTCFG3_CFG30_ONE             = 1,     /*!< ONE : Force output to 1.                                                  */
  CTIMER_OUTCFG3_CFG30_ZERO            = 0,     /*!< ZERO : Force output to 0                                                  */
} CTIMER_OUTCFG3_CFG30_Enum;

/* =========================================================  INCFG  ========================================================= */
/* ==============================================  CTIMER INCFG CFGB7 [15..15]  ============================================== */
typedef enum {                                  /*!< CTIMER_INCFG_CFGB7                                                        */
  CTIMER_INCFG_CFGB7_CT31              = 1,     /*!< CT31 : Input is CT31                                                      */
  CTIMER_INCFG_CFGB7_CT30              = 0,     /*!< CT30 : Input is CT30                                                      */
} CTIMER_INCFG_CFGB7_Enum;

/* ==============================================  CTIMER INCFG CFGA7 [14..14]  ============================================== */
typedef enum {                                  /*!< CTIMER_INCFG_CFGA7                                                        */
  CTIMER_INCFG_CFGA7_CT29              = 1,     /*!< CT29 : Input is CT29                                                      */
  CTIMER_INCFG_CFGA7_CT28              = 0,     /*!< CT28 : Input is CT28                                                      */
} CTIMER_INCFG_CFGA7_Enum;

/* ==============================================  CTIMER INCFG CFGB6 [13..13]  ============================================== */
typedef enum {                                  /*!< CTIMER_INCFG_CFGB6                                                        */
  CTIMER_INCFG_CFGB6_CT27              = 1,     /*!< CT27 : Input is CT27                                                      */
  CTIMER_INCFG_CFGB6_CT26              = 0,     /*!< CT26 : Input is CT26                                                      */
} CTIMER_INCFG_CFGB6_Enum;

/* ==============================================  CTIMER INCFG CFGA6 [12..12]  ============================================== */
typedef enum {                                  /*!< CTIMER_INCFG_CFGA6                                                        */
  CTIMER_INCFG_CFGA6_CT25              = 1,     /*!< CT25 : Input is CT25                                                      */
  CTIMER_INCFG_CFGA6_CT24              = 0,     /*!< CT24 : Input is CT24                                                      */
} CTIMER_INCFG_CFGA6_Enum;

/* ==============================================  CTIMER INCFG CFGB5 [11..11]  ============================================== */
typedef enum {                                  /*!< CTIMER_INCFG_CFGB5                                                        */
  CTIMER_INCFG_CFGB5_CT23              = 1,     /*!< CT23 : Input is CT23                                                      */
  CTIMER_INCFG_CFGB5_CT22              = 0,     /*!< CT22 : Input is CT22                                                      */
} CTIMER_INCFG_CFGB5_Enum;

/* ==============================================  CTIMER INCFG CFGA5 [10..10]  ============================================== */
typedef enum {                                  /*!< CTIMER_INCFG_CFGA5                                                        */
  CTIMER_INCFG_CFGA5_CT21              = 1,     /*!< CT21 : Input is CT21                                                      */
  CTIMER_INCFG_CFGA5_CT20              = 0,     /*!< CT20 : Input is CT20                                                      */
} CTIMER_INCFG_CFGA5_Enum;

/* ===============================================  CTIMER INCFG CFGB4 [9..9]  =============================================== */
typedef enum {                                  /*!< CTIMER_INCFG_CFGB4                                                        */
  CTIMER_INCFG_CFGB4_CT19              = 1,     /*!< CT19 : Input is CT19                                                      */
  CTIMER_INCFG_CFGB4_CT18              = 0,     /*!< CT18 : Input is CT18                                                      */
} CTIMER_INCFG_CFGB4_Enum;

/* ===============================================  CTIMER INCFG CFGA4 [8..8]  =============================================== */
typedef enum {                                  /*!< CTIMER_INCFG_CFGA4                                                        */
  CTIMER_INCFG_CFGA4_CT17              = 1,     /*!< CT17 : Input is CT17                                                      */
  CTIMER_INCFG_CFGA4_CT16              = 0,     /*!< CT16 : Input is CT16                                                      */
} CTIMER_INCFG_CFGA4_Enum;

