sparkfun/Arduino_Apollo3/cores/arduino/am_sdk_ap3/CMSIS/AmbiqMicro/Include/apollo3c.h
/* ===========================================  GPIO PADREGN PAD55STRNG [26..26]  ============================================ */
typedef enum {                                  /*!< GPIO_PADREGN_PAD55STRNG                                                   */
  GPIO_PADREGN_PAD55STRNG_LOW          = 0,     /*!< LOW : Low drive strength                                                  */
  GPIO_PADREGN_PAD55STRNG_HIGH         = 1,     /*!< HIGH : High drive strength                                                */
} GPIO_PADREGN_PAD55STRNG_Enum;

/* ===========================================  GPIO PADREGN PAD55INPEN [25..25]  ============================================ */
typedef enum {                                  /*!< GPIO_PADREGN_PAD55INPEN                                                   */
  GPIO_PADREGN_PAD55INPEN_DIS          = 0,     /*!< DIS : Pad input disabled                                                  */
  GPIO_PADREGN_PAD55INPEN_EN           = 1,     /*!< EN : Pad input enabled                                                    */
} GPIO_PADREGN_PAD55INPEN_Enum;

/* ============================================  GPIO PADREGN PAD55PULL [24..24]  ============================================ */
typedef enum {                                  /*!< GPIO_PADREGN_PAD55PULL                                                    */
  GPIO_PADREGN_PAD55PULL_DIS           = 0,     /*!< DIS : Pullup disabled                                                     */
  GPIO_PADREGN_PAD55PULL_EN            = 1,     /*!< EN : Pullup enabled                                                       */
} GPIO_PADREGN_PAD55PULL_Enum;

/* ===========================================  GPIO PADREGN PAD54FNCSEL [19..21]  =========================================== */
typedef enum {                                  /*!< GPIO_PADREGN_PAD54FNCSEL                                                  */
  GPIO_PADREGN_PAD54FNCSEL_MSPI1_3     = 0,     /*!< MSPI1_3 : Configure as the MSPI1 3 signal                                 */
  GPIO_PADREGN_PAD54FNCSEL_NCE54       = 1,     /*!< NCE54 : IOM/MSPI nCE group 54                                             */
  GPIO_PADREGN_PAD54FNCSEL_CT4         = 2,     /*!< CT4 : CTIMER connection 4                                                 */
  GPIO_PADREGN_PAD54FNCSEL_GPIO54      = 3,     /*!< GPIO54 : Configure as GPIO54                                              */
} GPIO_PADREGN_PAD54FNCSEL_Enum;

/* ===========================================  GPIO PADREGN PAD54STRNG [18..18]  ============================================ */
typedef enum {                                  /*!< GPIO_PADREGN_PAD54STRNG                                                   */
  GPIO_PADREGN_PAD54STRNG_LOW          = 0,     /*!< LOW : Low drive strength                                                  */
  GPIO_PADREGN_PAD54STRNG_HIGH         = 1,     /*!< HIGH : High drive strength                                                */
} GPIO_PADREGN_PAD54STRNG_Enum;

/* ===========================================  GPIO PADREGN PAD54INPEN [17..17]  ============================================ */
typedef enum {                                  /*!< GPIO_PADREGN_PAD54INPEN                                                   */
  GPIO_PADREGN_PAD54INPEN_DIS          = 0,     /*!< DIS : Pad input disabled                                                  */
  GPIO_PADREGN_PAD54INPEN_EN           = 1,     /*!< EN : Pad input enabled                                                    */
} GPIO_PADREGN_PAD54INPEN_Enum;

/* ============================================  GPIO PADREGN PAD54PULL [16..16]  ============================================ */
typedef enum {                                  /*!< GPIO_PADREGN_PAD54PULL                                                    */
  GPIO_PADREGN_PAD54PULL_DIS           = 0,     /*!< DIS : Pullup disabled                                                     */
  GPIO_PADREGN_PAD54PULL_EN            = 1,     /*!< EN : Pullup enabled                                                       */
} GPIO_PADREGN_PAD54PULL_Enum;

/* ===========================================  GPIO PADREGN PAD53FNCSEL [11..13]  =========================================== */
typedef enum {                                  /*!< GPIO_PADREGN_PAD53FNCSEL                                                  */
  GPIO_PADREGN_PAD53FNCSEL_MSPI1_2     = 0,     /*!< MSPI1_2 : Configure as the MSPI1 2 signal                                 */
  GPIO_PADREGN_PAD53FNCSEL_NCE53       = 1,     /*!< NCE53 : IOM/MSPI nCE group 53                                             */
  GPIO_PADREGN_PAD53FNCSEL_CT3         = 2,     /*!< CT3 : CTIMER connection 3                                                 */
  GPIO_PADREGN_PAD53FNCSEL_GPIO53      = 3,     /*!< GPIO53 : Configure as GPIO53                                              */
} GPIO_PADREGN_PAD53FNCSEL_Enum;

/* ===========================================  GPIO PADREGN PAD53STRNG [10..10]  ============================================ */
typedef enum {                                  /*!< GPIO_PADREGN_PAD53STRNG                                                   */
  GPIO_PADREGN_PAD53STRNG_LOW          = 0,     /*!< LOW : Low drive strength                                                  */
  GPIO_PADREGN_PAD53STRNG_HIGH         = 1,     /*!< HIGH : High drive strength                                                */
} GPIO_PADREGN_PAD53STRNG_Enum;

/* ============================================  GPIO PADREGN PAD53INPEN [9..9]  ============================================= */
typedef enum {                                  /*!< GPIO_PADREGN_PAD53INPEN                                                   */
  GPIO_PADREGN_PAD53INPEN_DIS          = 0,     /*!< DIS : Pad input disabled                                                  */
  GPIO_PADREGN_PAD53INPEN_EN           = 1,     /*!< EN : Pad input enabled                                                    */
} GPIO_PADREGN_PAD53INPEN_Enum;

/* =============================================  GPIO PADREGN PAD53PULL [8..8]  ============================================= */
typedef enum {                                  /*!< GPIO_PADREGN_PAD53PULL                                                    */
  GPIO_PADREGN_PAD53PULL_DIS           = 0,     /*!< DIS : Pullup disabled                                                     */
  GPIO_PADREGN_PAD53PULL_EN            = 1,     /*!< EN : Pullup enabled                                                       */
} GPIO_PADREGN_PAD53PULL_Enum;

