sparkfun/Arduino_Apollo3/cores/arduino/am_sdk_ap3/CMSIS/AmbiqMicro/Include/apollo3c.h
/* =============================================  GPIO PADREGO PAD57PULL [8..8]  ============================================= */
typedef enum {                                  /*!< GPIO_PADREGO_PAD57PULL                                                    */
  GPIO_PADREGO_PAD57PULL_DIS           = 0,     /*!< DIS : Pullup disabled                                                     */
  GPIO_PADREGO_PAD57PULL_EN            = 1,     /*!< EN : Pullup enabled                                                       */
} GPIO_PADREGO_PAD57PULL_Enum;

/* ============================================  GPIO PADREGO PAD56FNCSEL [3..5]  ============================================ */
typedef enum {                                  /*!< GPIO_PADREGO_PAD56FNCSEL                                                  */
  GPIO_PADREGO_PAD56FNCSEL_MSPI1_5     = 0,     /*!< MSPI1_5 : Configure as the MSPI1 5 signal                                 */
  GPIO_PADREGO_PAD56FNCSEL_NCE56       = 1,     /*!< NCE56 : IOM/MSPI nCE group 56                                             */
  GPIO_PADREGO_PAD56FNCSEL_CT6         = 2,     /*!< CT6 : CTIMER connection 6                                                 */
  GPIO_PADREGO_PAD56FNCSEL_GPIO56      = 3,     /*!< GPIO56 : Configure as GPIO56                                              */
} GPIO_PADREGO_PAD56FNCSEL_Enum;

/* ============================================  GPIO PADREGO PAD56STRNG [2..2]  ============================================= */
typedef enum {                                  /*!< GPIO_PADREGO_PAD56STRNG                                                   */
  GPIO_PADREGO_PAD56STRNG_LOW          = 0,     /*!< LOW : Low drive strength                                                  */
  GPIO_PADREGO_PAD56STRNG_HIGH         = 1,     /*!< HIGH : High drive strength                                                */
} GPIO_PADREGO_PAD56STRNG_Enum;

/* ============================================  GPIO PADREGO PAD56INPEN [1..1]  ============================================= */
typedef enum {                                  /*!< GPIO_PADREGO_PAD56INPEN                                                   */
  GPIO_PADREGO_PAD56INPEN_DIS          = 0,     /*!< DIS : Pad input disabled                                                  */
  GPIO_PADREGO_PAD56INPEN_EN           = 1,     /*!< EN : Pad input enabled                                                    */
} GPIO_PADREGO_PAD56INPEN_Enum;

/* =============================================  GPIO PADREGO PAD56PULL [0..0]  ============================================= */
typedef enum {                                  /*!< GPIO_PADREGO_PAD56PULL                                                    */
  GPIO_PADREGO_PAD56PULL_DIS           = 0,     /*!< DIS : Pullup disabled                                                     */
  GPIO_PADREGO_PAD56PULL_EN            = 1,     /*!< EN : Pullup enabled                                                       */
} GPIO_PADREGO_PAD56PULL_Enum;

/* ========================================================  PADREGP  ======================================================== */
/* ===========================================  GPIO PADREGP PAD63FNCSEL [27..29]  =========================================== */
typedef enum {                                  /*!< GPIO_PADREGP_PAD63FNCSEL                                                  */
  GPIO_PADREGP_PAD63FNCSEL_SWO         = 0,     /*!< SWO : Configure as the SWO output                                         */
  GPIO_PADREGP_PAD63FNCSEL_NCE63       = 1,     /*!< NCE63 : IOM/MSPI nCE group 63                                             */
  GPIO_PADREGP_PAD63FNCSEL_CT13        = 2,     /*!< CT13 : CTIMER connection 13                                               */
  GPIO_PADREGP_PAD63FNCSEL_GPIO63      = 3,     /*!< GPIO63 : Configure as GPIO63                                              */
  GPIO_PADREGP_PAD63FNCSEL_UART0TX     = 4,     /*!< UART0TX : Configure as the UART0 TX output                                */
  GPIO_PADREGP_PAD63FNCSEL_UART0RX     = 5,     /*!< UART0RX : Configure as the UART0 RX input                                 */
  GPIO_PADREGP_PAD63FNCSEL_UART1TX     = 6,     /*!< UART1TX : Configure as the UART1 TX output                                */
  GPIO_PADREGP_PAD63FNCSEL_UART1RX     = 7,     /*!< UART1RX : Configure as the UART1 RX input                                 */
} GPIO_PADREGP_PAD63FNCSEL_Enum;

/* ===========================================  GPIO PADREGP PAD63STRNG [26..26]  ============================================ */
typedef enum {                                  /*!< GPIO_PADREGP_PAD63STRNG                                                   */
  GPIO_PADREGP_PAD63STRNG_LOW          = 0,     /*!< LOW : Low drive strength                                                  */
  GPIO_PADREGP_PAD63STRNG_HIGH         = 1,     /*!< HIGH : High drive strength                                                */
} GPIO_PADREGP_PAD63STRNG_Enum;

/* ===========================================  GPIO PADREGP PAD63INPEN [25..25]  ============================================ */
typedef enum {                                  /*!< GPIO_PADREGP_PAD63INPEN                                                   */
  GPIO_PADREGP_PAD63INPEN_DIS          = 0,     /*!< DIS : Pad input disabled                                                  */
  GPIO_PADREGP_PAD63INPEN_EN           = 1,     /*!< EN : Pad input enabled                                                    */
} GPIO_PADREGP_PAD63INPEN_Enum;

/* ============================================  GPIO PADREGP PAD63PULL [24..24]  ============================================ */
typedef enum {                                  /*!< GPIO_PADREGP_PAD63PULL                                                    */
  GPIO_PADREGP_PAD63PULL_DIS           = 0,     /*!< DIS : Pullup disabled                                                     */
  GPIO_PADREGP_PAD63PULL_EN            = 1,     /*!< EN : Pullup enabled                                                       */
} GPIO_PADREGP_PAD63PULL_Enum;

/* ===========================================  GPIO PADREGP PAD62FNCSEL [19..21]  =========================================== */
typedef enum {                                  /*!< GPIO_PADREGP_PAD62FNCSEL                                                  */
  GPIO_PADREGP_PAD62FNCSEL_SWO         = 0,     /*!< SWO : Configure as the SWO output                                         */
  GPIO_PADREGP_PAD62FNCSEL_NCE62       = 1,     /*!< NCE62 : IOM/MSPI nCE group 62                                             */
  GPIO_PADREGP_PAD62FNCSEL_CT12        = 2,     /*!< CT12 : CTIMER connection 12                                               */
  GPIO_PADREGP_PAD62FNCSEL_GPIO62      = 3,     /*!< GPIO62 : Configure as GPIO62                                              */
  GPIO_PADREGP_PAD62FNCSEL_UA0CTS      = 4,     /*!< UA0CTS : Configure as the UART0 CTS input                                 */
  GPIO_PADREGP_PAD62FNCSEL_UA0RTS      = 5,     /*!< UA0RTS : Configure as the UART0 RTS output                                */
  GPIO_PADREGP_PAD62FNCSEL_UA1CTS      = 6,     /*!< UA1CTS : Configure as the UART1 CTS input                                 */
  GPIO_PADREGP_PAD62FNCSEL_UA1RTS      = 7,     /*!< UA1RTS : Configure as the UART1 RTS output                                */
} GPIO_PADREGP_PAD62FNCSEL_Enum;

/* ===========================================  GPIO PADREGP PAD62STRNG [18..18]  ============================================ */
typedef enum {                                  /*!< GPIO_PADREGP_PAD62STRNG                                                   */
  GPIO_PADREGP_PAD62STRNG_LOW          = 0,     /*!< LOW : Low drive strength                                                  */
  GPIO_PADREGP_PAD62STRNG_HIGH         = 1,     /*!< HIGH : High drive strength                                                */
} GPIO_PADREGP_PAD62STRNG_Enum;

/* ===========================================  GPIO PADREGP PAD62INPEN [17..17]  ============================================ */
typedef enum {                                  /*!< GPIO_PADREGP_PAD62INPEN                                                   */
  GPIO_PADREGP_PAD62INPEN_DIS          = 0,     /*!< DIS : Pad input disabled                                                  */
  GPIO_PADREGP_PAD62INPEN_EN           = 1,     /*!< EN : Pad input enabled                                                    */
} GPIO_PADREGP_PAD62INPEN_Enum;

/* ============================================  GPIO PADREGP PAD62PULL [16..16]  ============================================ */
typedef enum {                                  /*!< GPIO_PADREGP_PAD62PULL                                                    */
  GPIO_PADREGP_PAD62PULL_DIS           = 0,     /*!< DIS : Pullup disabled                                                     */
  GPIO_PADREGP_PAD62PULL_EN            = 1,     /*!< EN : Pullup enabled                                                       */
} GPIO_PADREGP_PAD62PULL_Enum;

