sparkfun/Arduino_Apollo3/cores/arduino/am_sdk_ap3/CMSIS/AmbiqMicro/Include/apollo3c.h
/* =============================================  GPIO PADREGQ PAD64PULL [0..0]  ============================================= */
typedef enum {                                  /*!< GPIO_PADREGQ_PAD64PULL                                                    */
  GPIO_PADREGQ_PAD64PULL_DIS           = 0,     /*!< DIS : Pullup disabled                                                     */
  GPIO_PADREGQ_PAD64PULL_EN            = 1,     /*!< EN : Pullup enabled                                                       */
} GPIO_PADREGQ_PAD64PULL_Enum;

/* ========================================================  PADREGR  ======================================================== */
/* ===========================================  GPIO PADREGR PAD71FNCSEL [27..29]  =========================================== */
typedef enum {                                  /*!< GPIO_PADREGR_PAD71FNCSEL                                                  */
  GPIO_PADREGR_PAD71FNCSEL_SWO         = 0,     /*!< SWO : Configure as the SWO output                                         */
  GPIO_PADREGR_PAD71FNCSEL_NCE71       = 1,     /*!< NCE71 : IOM/MSPI nCE group 71                                             */
  GPIO_PADREGR_PAD71FNCSEL_CT21        = 2,     /*!< CT21 : CTIMER connection 21                                               */
  GPIO_PADREGR_PAD71FNCSEL_GPIO71      = 3,     /*!< GPIO71 : Configure as GPIO71                                              */
  GPIO_PADREGR_PAD71FNCSEL_UART0TX     = 4,     /*!< UART0TX : Configure as the UART0 TX output                                */
  GPIO_PADREGR_PAD71FNCSEL_UART0RX     = 5,     /*!< UART0RX : Configure as the UART0 RX input                                 */
  GPIO_PADREGR_PAD71FNCSEL_UART1TX     = 6,     /*!< UART1TX : Configure as the UART1 TX output                                */
  GPIO_PADREGR_PAD71FNCSEL_UART1RX     = 7,     /*!< UART1RX : Configure as the UART1 RX input                                 */
} GPIO_PADREGR_PAD71FNCSEL_Enum;

/* ===========================================  GPIO PADREGR PAD71STRNG [26..26]  ============================================ */
typedef enum {                                  /*!< GPIO_PADREGR_PAD71STRNG                                                   */
  GPIO_PADREGR_PAD71STRNG_LOW          = 0,     /*!< LOW : Low drive strength                                                  */
  GPIO_PADREGR_PAD71STRNG_HIGH         = 1,     /*!< HIGH : High drive strength                                                */
} GPIO_PADREGR_PAD71STRNG_Enum;

/* ===========================================  GPIO PADREGR PAD71INPEN [25..25]  ============================================ */
typedef enum {                                  /*!< GPIO_PADREGR_PAD71INPEN                                                   */
  GPIO_PADREGR_PAD71INPEN_DIS          = 0,     /*!< DIS : Pad input disabled                                                  */
  GPIO_PADREGR_PAD71INPEN_EN           = 1,     /*!< EN : Pad input enabled                                                    */
} GPIO_PADREGR_PAD71INPEN_Enum;

/* ============================================  GPIO PADREGR PAD71PULL [24..24]  ============================================ */
typedef enum {                                  /*!< GPIO_PADREGR_PAD71PULL                                                    */
  GPIO_PADREGR_PAD71PULL_DIS           = 0,     /*!< DIS : Pullup disabled                                                     */
  GPIO_PADREGR_PAD71PULL_EN            = 1,     /*!< EN : Pullup enabled                                                       */
} GPIO_PADREGR_PAD71PULL_Enum;

/* ===========================================  GPIO PADREGR PAD70FNCSEL [19..21]  =========================================== */
typedef enum {                                  /*!< GPIO_PADREGR_PAD70FNCSEL                                                  */
  GPIO_PADREGR_PAD70FNCSEL_SWO         = 0,     /*!< SWO : Configure as the SWO output                                         */
  GPIO_PADREGR_PAD70FNCSEL_NCE70       = 1,     /*!< NCE70 : IOM/MSPI nCE group 70                                             */
  GPIO_PADREGR_PAD70FNCSEL_CT20        = 2,     /*!< CT20 : CTIMER connection 20                                               */
  GPIO_PADREGR_PAD70FNCSEL_GPIO70      = 3,     /*!< GPIO70 : Configure as GPIO70                                              */
  GPIO_PADREGR_PAD70FNCSEL_UART0TX     = 4,     /*!< UART0TX : Configure as the UART0 TX output                                */
  GPIO_PADREGR_PAD70FNCSEL_UART0RX     = 5,     /*!< UART0RX : Configure as the UART0 RX input                                 */
  GPIO_PADREGR_PAD70FNCSEL_UART1TX     = 6,     /*!< UART1TX : Configure as the UART1 TX output                                */
  GPIO_PADREGR_PAD70FNCSEL_UART1RX     = 7,     /*!< UART1RX : Configure as the UART1 RX input                                 */
} GPIO_PADREGR_PAD70FNCSEL_Enum;

/* ===========================================  GPIO PADREGR PAD70STRNG [18..18]  ============================================ */
typedef enum {                                  /*!< GPIO_PADREGR_PAD70STRNG                                                   */
  GPIO_PADREGR_PAD70STRNG_LOW          = 0,     /*!< LOW : Low drive strength                                                  */
  GPIO_PADREGR_PAD70STRNG_HIGH         = 1,     /*!< HIGH : High drive strength                                                */
} GPIO_PADREGR_PAD70STRNG_Enum;

/* ===========================================  GPIO PADREGR PAD70INPEN [17..17]  ============================================ */
typedef enum {                                  /*!< GPIO_PADREGR_PAD70INPEN                                                   */
  GPIO_PADREGR_PAD70INPEN_DIS          = 0,     /*!< DIS : Pad input disabled                                                  */
  GPIO_PADREGR_PAD70INPEN_EN           = 1,     /*!< EN : Pad input enabled                                                    */
} GPIO_PADREGR_PAD70INPEN_Enum;

/* ============================================  GPIO PADREGR PAD70PULL [16..16]  ============================================ */
typedef enum {                                  /*!< GPIO_PADREGR_PAD70PULL                                                    */
  GPIO_PADREGR_PAD70PULL_DIS           = 0,     /*!< DIS : Pullup disabled                                                     */
  GPIO_PADREGR_PAD70PULL_EN            = 1,     /*!< EN : Pullup enabled                                                       */
} GPIO_PADREGR_PAD70PULL_Enum;

