sparkfun/Arduino_Apollo3/cores/arduino/am_sdk_ap3/CMSIS/AmbiqMicro/Include/apollo3c.h
/* ===========================================  GPIO PADREGS PAD73STRNG [10..10]  ============================================ */
typedef enum {                                  /*!< GPIO_PADREGS_PAD73STRNG                                                   */
  GPIO_PADREGS_PAD73STRNG_LOW          = 0,     /*!< LOW : Low drive strength                                                  */
  GPIO_PADREGS_PAD73STRNG_HIGH         = 1,     /*!< HIGH : High drive strength                                                */
} GPIO_PADREGS_PAD73STRNG_Enum;

/* ============================================  GPIO PADREGS PAD73INPEN [9..9]  ============================================= */
typedef enum {                                  /*!< GPIO_PADREGS_PAD73INPEN                                                   */
  GPIO_PADREGS_PAD73INPEN_DIS          = 0,     /*!< DIS : Pad input disabled                                                  */
  GPIO_PADREGS_PAD73INPEN_EN           = 1,     /*!< EN : Pad input enabled                                                    */
} GPIO_PADREGS_PAD73INPEN_Enum;

/* =============================================  GPIO PADREGS PAD73PULL [8..8]  ============================================= */
typedef enum {                                  /*!< GPIO_PADREGS_PAD73PULL                                                    */
  GPIO_PADREGS_PAD73PULL_DIS           = 0,     /*!< DIS : Pullup disabled                                                     */
  GPIO_PADREGS_PAD73PULL_EN            = 1,     /*!< EN : Pullup enabled                                                       */
} GPIO_PADREGS_PAD73PULL_Enum;

/* ============================================  GPIO PADREGS PAD72FNCSEL [3..5]  ============================================ */
typedef enum {                                  /*!< GPIO_PADREGS_PAD72FNCSEL                                                  */
  GPIO_PADREGS_PAD72FNCSEL_SWO         = 0,     /*!< SWO : Configure as the SWO output                                         */
  GPIO_PADREGS_PAD72FNCSEL_NCE72       = 1,     /*!< NCE72 : IOM/MSPI nCE group 72                                             */
  GPIO_PADREGS_PAD72FNCSEL_CT22        = 2,     /*!< CT22 : CTIMER connection 22                                               */
  GPIO_PADREGS_PAD72FNCSEL_GPIO72      = 3,     /*!< GPIO72 : Configure as GPIO72                                              */
  GPIO_PADREGS_PAD72FNCSEL_UART0TX     = 4,     /*!< UART0TX : Configure as the UART0 TX output                                */
  GPIO_PADREGS_PAD72FNCSEL_UART0RX     = 5,     /*!< UART0RX : Configure as the UART0 RX input                                 */
  GPIO_PADREGS_PAD72FNCSEL_UART1TX     = 6,     /*!< UART1TX : Configure as the UART1 TX output                                */
  GPIO_PADREGS_PAD72FNCSEL_UART1RX     = 7,     /*!< UART1RX : Configure as the UART1 RX input                                 */
} GPIO_PADREGS_PAD72FNCSEL_Enum;

/* ============================================  GPIO PADREGS PAD72STRNG [2..2]  ============================================= */
typedef enum {                                  /*!< GPIO_PADREGS_PAD72STRNG                                                   */
  GPIO_PADREGS_PAD72STRNG_LOW          = 0,     /*!< LOW : Low drive strength                                                  */
  GPIO_PADREGS_PAD72STRNG_HIGH         = 1,     /*!< HIGH : High drive strength                                                */
} GPIO_PADREGS_PAD72STRNG_Enum;

/* ============================================  GPIO PADREGS PAD72INPEN [1..1]  ============================================= */
typedef enum {                                  /*!< GPIO_PADREGS_PAD72INPEN                                                   */
  GPIO_PADREGS_PAD72INPEN_DIS          = 0,     /*!< DIS : Pad input disabled                                                  */
  GPIO_PADREGS_PAD72INPEN_EN           = 1,     /*!< EN : Pad input enabled                                                    */
} GPIO_PADREGS_PAD72INPEN_Enum;

/* =============================================  GPIO PADREGS PAD72PULL [0..0]  ============================================= */
typedef enum {                                  /*!< GPIO_PADREGS_PAD72PULL                                                    */
  GPIO_PADREGS_PAD72PULL_DIS           = 0,     /*!< DIS : Pullup disabled                                                     */
  GPIO_PADREGS_PAD72PULL_EN            = 1,     /*!< EN : Pullup enabled                                                       */
} GPIO_PADREGS_PAD72PULL_Enum;

/* =========================================================  CFGA  ========================================================== */
/* =============================================  GPIO CFGA GPIO7INTD [31..31]  ============================================== */
typedef enum {                                  /*!< GPIO_CFGA_GPIO7INTD                                                       */
  GPIO_CFGA_GPIO7INTD_nCELOW           = 0,     /*!< nCELOW : Applies when PAD7FNCSEL = NCE7 - nCE polarity active
                                                     low                                                                       */
  GPIO_CFGA_GPIO7INTD_nCEHIGH          = 1,     /*!< nCEHIGH : Applies when PAD7FNCSEL = NCE7 - nCE polarity active
                                                     high                                                                      */
} GPIO_CFGA_GPIO7INTD_Enum;

/* ============================================  GPIO CFGA GPIO7OUTCFG [29..30]  ============================================= */
typedef enum {                                  /*!< GPIO_CFGA_GPIO7OUTCFG                                                     */
  GPIO_CFGA_GPIO7OUTCFG_DIS            = 0,     /*!< DIS : Applies when PAD7FNCSEL = GPIO - Output disabled                    */
  GPIO_CFGA_GPIO7OUTCFG_PUSHPULL       = 1,     /*!< PUSHPULL : Applies when PAD7FNCSEL = GPIO - Output is push-pull           */
  GPIO_CFGA_GPIO7OUTCFG_OD             = 2,     /*!< OD : Applies when PAD7FNCSEL = GPIO - Output is open drain                */
  GPIO_CFGA_GPIO7OUTCFG_TS             = 3,     /*!< TS : Applies when PAD7FNCSEL = GPIO - Output is tri-state                 */
} GPIO_CFGA_GPIO7OUTCFG_Enum;

/* =============================================  GPIO CFGA GPIO7INCFG [28..28]  ============================================= */
typedef enum {                                  /*!< GPIO_CFGA_GPIO7INCFG                                                      */
  GPIO_CFGA_GPIO7INCFG_READ            = 0,     /*!< READ : Read the GPIO pin data                                             */
  GPIO_CFGA_GPIO7INCFG_RDZERO          = 1,     /*!< RDZERO : INTD = 0 - Readback will always be zero                          */
} GPIO_CFGA_GPIO7INCFG_Enum;

/* =============================================  GPIO CFGA GPIO6INTD [27..27]  ============================================== */
typedef enum {                                  /*!< GPIO_CFGA_GPIO6INTD                                                       */
  GPIO_CFGA_GPIO6INTD_INTDIS           = 0,     /*!< INTDIS : Applies when GPIO6INCFG = 1 - No interrupt on GPIO
                                                     transition                                                                */
  GPIO_CFGA_GPIO6INTD_INTBOTH          = 1,     /*!< INTBOTH : Applies when GPIO6INCFG = 1 - Interrupt on either
                                                     low to high or high to low GPIO transition                                */
} GPIO_CFGA_GPIO6INTD_Enum;

/* ============================================  GPIO CFGA GPIO6OUTCFG [25..26]  ============================================= */
typedef enum {                                  /*!< GPIO_CFGA_GPIO6OUTCFG                                                     */
  GPIO_CFGA_GPIO6OUTCFG_DIS            = 0,     /*!< DIS : Applies when PAD6FNCSEL = GPIO - Output disabled                    */
  GPIO_CFGA_GPIO6OUTCFG_PUSHPULL       = 1,     /*!< PUSHPULL : Applies when PAD6FNCSEL = GPIO - Output is push-pull           */
  GPIO_CFGA_GPIO6OUTCFG_OD             = 2,     /*!< OD : Applies when PAD6FNCSEL = GPIO - Output is open drain                */
  GPIO_CFGA_GPIO6OUTCFG_TS             = 3,     /*!< TS : Applies when PAD6FNCSEL = GPIO - Output is tri-state                 */
} GPIO_CFGA_GPIO6OUTCFG_Enum;

/* =============================================  GPIO CFGA GPIO6INCFG [24..24]  ============================================= */
typedef enum {                                  /*!< GPIO_CFGA_GPIO6INCFG                                                      */
  GPIO_CFGA_GPIO6INCFG_READ            = 0,     /*!< READ : Read the GPIO pin data                                             */
  GPIO_CFGA_GPIO6INCFG_RDZERO          = 1,     /*!< RDZERO : INTD = 0 - Readback will always be zero                          */
} GPIO_CFGA_GPIO6INCFG_Enum;

/* =============================================  GPIO CFGA GPIO5INTD [23..23]  ============================================== */
typedef enum {                                  /*!< GPIO_CFGA_GPIO5INTD                                                       */
  GPIO_CFGA_GPIO5INTD_INTDIS           = 0,     /*!< INTDIS : Applies when GPIO5INCFG = 1 - No interrupt on GPIO
                                                     transition                                                                */
  GPIO_CFGA_GPIO5INTD_INTBOTH          = 1,     /*!< INTBOTH : Applies when GPIO5INCFG = 1 - Interrupt on either
                                                     low to high or high to low GPIO transition                                */
} GPIO_CFGA_GPIO5INTD_Enum;

/* ============================================  GPIO CFGA GPIO5OUTCFG [21..22]  ============================================= */
typedef enum {                                  /*!< GPIO_CFGA_GPIO5OUTCFG                                                     */
  GPIO_CFGA_GPIO5OUTCFG_DIS            = 0,     /*!< DIS : Applies when PAD5FNCSEL = GPIO - Output disabled                    */
  GPIO_CFGA_GPIO5OUTCFG_PUSHPULL       = 1,     /*!< PUSHPULL : Applies when PAD5FNCSEL = GPIO - Output is push-pull           */
  GPIO_CFGA_GPIO5OUTCFG_OD             = 2,     /*!< OD : Applies when PAD5FNCSEL = GPIO - Output is open drain                */
  GPIO_CFGA_GPIO5OUTCFG_TS             = 3,     /*!< TS : Applies when PAD5FNCSEL = GPIO - Output is tri-state                 */
} GPIO_CFGA_GPIO5OUTCFG_Enum;

/* =============================================  GPIO CFGA GPIO5INCFG [20..20]  ============================================= */
typedef enum {                                  /*!< GPIO_CFGA_GPIO5INCFG                                                      */
  GPIO_CFGA_GPIO5INCFG_READ            = 0,     /*!< READ : Read the GPIO pin data                                             */
  GPIO_CFGA_GPIO5INCFG_RDZERO          = 1,     /*!< RDZERO : INTD = 0 - Readback will always be zero                          */
} GPIO_CFGA_GPIO5INCFG_Enum;

