sparkfun/Arduino_Apollo3/cores/arduino/am_sdk_ap3/CMSIS/AmbiqMicro/Include/apollo3c.h
/* ============================================  GPIO CFGD GPIO31INCFG [28..28]  ============================================= */
typedef enum {                                  /*!< GPIO_CFGD_GPIO31INCFG                                                     */
  GPIO_CFGD_GPIO31INCFG_READ           = 0,     /*!< READ : Read the GPIO pin data                                             */
  GPIO_CFGD_GPIO31INCFG_RDZERO         = 1,     /*!< RDZERO : INTD = 0 - Readback will always be zero                          */
} GPIO_CFGD_GPIO31INCFG_Enum;

/* =============================================  GPIO CFGD GPIO30INTD [27..27]  ============================================= */
typedef enum {                                  /*!< GPIO_CFGD_GPIO30INTD                                                      */
  GPIO_CFGD_GPIO30INTD_nCELOW          = 0,     /*!< nCELOW : Applies when PAD30FNCSEL = NCE30 - nCE polarity active
                                                     low                                                                       */
  GPIO_CFGD_GPIO30INTD_nCEHIGH         = 1,     /*!< nCEHIGH : Applies when PAD30FNCSEL = NCE30 - nCE polarity active
                                                     high                                                                      */
} GPIO_CFGD_GPIO30INTD_Enum;

/* ============================================  GPIO CFGD GPIO30OUTCFG [25..26]  ============================================ */
typedef enum {                                  /*!< GPIO_CFGD_GPIO30OUTCFG                                                    */
  GPIO_CFGD_GPIO30OUTCFG_DIS           = 0,     /*!< DIS : Applies when PAD30FNCSEL = GPIO - Output disabled                   */
  GPIO_CFGD_GPIO30OUTCFG_PUSHPULL      = 1,     /*!< PUSHPULL : Applies when PAD30FNCSEL = GPIO - Output is push-pull          */
  GPIO_CFGD_GPIO30OUTCFG_OD            = 2,     /*!< OD : Applies when PAD30FNCSEL = GPIO - Output is open drain               */
  GPIO_CFGD_GPIO30OUTCFG_TS            = 3,     /*!< TS : Applies when PAD30FNCSEL = GPIO - Output is tri-state                */
} GPIO_CFGD_GPIO30OUTCFG_Enum;

/* ============================================  GPIO CFGD GPIO30INCFG [24..24]  ============================================= */
typedef enum {                                  /*!< GPIO_CFGD_GPIO30INCFG                                                     */
  GPIO_CFGD_GPIO30INCFG_READ           = 0,     /*!< READ : Read the GPIO pin data                                             */
  GPIO_CFGD_GPIO30INCFG_RDZERO         = 1,     /*!< RDZERO : INTD = 0 - Readback will always be zero                          */
} GPIO_CFGD_GPIO30INCFG_Enum;

/* =============================================  GPIO CFGD GPIO29INTD [23..23]  ============================================= */
typedef enum {                                  /*!< GPIO_CFGD_GPIO29INTD                                                      */
  GPIO_CFGD_GPIO29INTD_nCELOW          = 0,     /*!< nCELOW : Applies when PAD29FNCSEL = NCE29 - nCE polarity active
                                                     low                                                                       */
  GPIO_CFGD_GPIO29INTD_nCEHIGH         = 1,     /*!< nCEHIGH : Applies when PAD29FNCSEL = NCE29 - nCE polarity active
                                                     high                                                                      */
} GPIO_CFGD_GPIO29INTD_Enum;

/* ============================================  GPIO CFGD GPIO29OUTCFG [21..22]  ============================================ */
typedef enum {                                  /*!< GPIO_CFGD_GPIO29OUTCFG                                                    */
  GPIO_CFGD_GPIO29OUTCFG_DIS           = 0,     /*!< DIS : Applies when PAD29FNCSEL = GPIO - Output disabled                   */
  GPIO_CFGD_GPIO29OUTCFG_PUSHPULL      = 1,     /*!< PUSHPULL : Applies when PAD29FNCSEL = GPIO - Output is push-pull          */
  GPIO_CFGD_GPIO29OUTCFG_OD            = 2,     /*!< OD : Applies when PAD29FNCSEL = GPIO - Output is open drain               */
  GPIO_CFGD_GPIO29OUTCFG_TS            = 3,     /*!< TS : Applies when PAD29FNCSEL = GPIO - Output is tri-state                */
} GPIO_CFGD_GPIO29OUTCFG_Enum;

/* ============================================  GPIO CFGD GPIO29INCFG [20..20]  ============================================= */
typedef enum {                                  /*!< GPIO_CFGD_GPIO29INCFG                                                     */
  GPIO_CFGD_GPIO29INCFG_READ           = 0,     /*!< READ : Read the GPIO pin data                                             */
  GPIO_CFGD_GPIO29INCFG_RDZERO         = 1,     /*!< RDZERO : INTD = 0 - Readback will always be zero                          */
} GPIO_CFGD_GPIO29INCFG_Enum;

/* =============================================  GPIO CFGD GPIO28INTD [19..19]  ============================================= */
typedef enum {                                  /*!< GPIO_CFGD_GPIO28INTD                                                      */
  GPIO_CFGD_GPIO28INTD_nCELOW          = 0,     /*!< nCELOW : Applies when PAD28FNCSEL = NCE28 - nCE polarity active
                                                     low                                                                       */
  GPIO_CFGD_GPIO28INTD_nCEHIGH         = 1,     /*!< nCEHIGH : Applies when PAD28FNCSEL = NCE28 - nCE polarity active
                                                     high                                                                      */
} GPIO_CFGD_GPIO28INTD_Enum;

/* ============================================  GPIO CFGD GPIO28OUTCFG [17..18]  ============================================ */
typedef enum {                                  /*!< GPIO_CFGD_GPIO28OUTCFG                                                    */
  GPIO_CFGD_GPIO28OUTCFG_DIS           = 0,     /*!< DIS : Applies when PAD28FNCSEL = GPIO - Output disabled                   */
  GPIO_CFGD_GPIO28OUTCFG_PUSHPULL      = 1,     /*!< PUSHPULL : Applies when PAD28FNCSEL = GPIO - Output is push-pull          */
  GPIO_CFGD_GPIO28OUTCFG_OD            = 2,     /*!< OD : Applies when PAD28FNCSEL = GPIO - Output is open drain               */
  GPIO_CFGD_GPIO28OUTCFG_TS            = 3,     /*!< TS : Applies when PAD28FNCSEL = GPIO - Output is tri-state                */
} GPIO_CFGD_GPIO28OUTCFG_Enum;

/* ============================================  GPIO CFGD GPIO28INCFG [16..16]  ============================================= */
typedef enum {                                  /*!< GPIO_CFGD_GPIO28INCFG                                                     */
  GPIO_CFGD_GPIO28INCFG_READ           = 0,     /*!< READ : Read the GPIO pin data                                             */
  GPIO_CFGD_GPIO28INCFG_RDZERO         = 1,     /*!< RDZERO : INTD = 0 - Readback will always be zero                          */
} GPIO_CFGD_GPIO28INCFG_Enum;

/* =============================================  GPIO CFGD GPIO27INTD [15..15]  ============================================= */
typedef enum {                                  /*!< GPIO_CFGD_GPIO27INTD                                                      */
  GPIO_CFGD_GPIO27INTD_nCELOW          = 0,     /*!< nCELOW : Applies when PAD27FNCSEL = NCE27 - nCE polarity active
                                                     low                                                                       */
  GPIO_CFGD_GPIO27INTD_nCEHIGH         = 1,     /*!< nCEHIGH : Applies when PAD27FNCSEL = NCE27 - nCE polarity active
                                                     high                                                                      */
} GPIO_CFGD_GPIO27INTD_Enum;

/* ============================================  GPIO CFGD GPIO27OUTCFG [13..14]  ============================================ */
typedef enum {                                  /*!< GPIO_CFGD_GPIO27OUTCFG                                                    */
  GPIO_CFGD_GPIO27OUTCFG_DIS           = 0,     /*!< DIS : Applies when PAD27FNCSEL = GPIO - Output disabled                   */
  GPIO_CFGD_GPIO27OUTCFG_PUSHPULL      = 1,     /*!< PUSHPULL : Applies when PAD27FNCSEL = GPIO - Output is push-pull          */
  GPIO_CFGD_GPIO27OUTCFG_OD            = 2,     /*!< OD : Applies when PAD27FNCSEL = GPIO - Output is open drain               */
  GPIO_CFGD_GPIO27OUTCFG_TS            = 3,     /*!< TS : Applies when PAD27FNCSEL = GPIO - Output is tri-state                */
} GPIO_CFGD_GPIO27OUTCFG_Enum;

