sparkfun/Arduino_Apollo3/cores/arduino/am_sdk_ap3/CMSIS/AmbiqMicro/Include/apollo3c.h
/* ============================================  GPIO CFGF GPIO45INCFG [20..20]  ============================================= */
typedef enum {                                  /*!< GPIO_CFGF_GPIO45INCFG                                                     */
  GPIO_CFGF_GPIO45INCFG_READ           = 0,     /*!< READ : Read the GPIO pin data                                             */
  GPIO_CFGF_GPIO45INCFG_RDZERO         = 1,     /*!< RDZERO : INTD = 0 - Readback will always be zero                          */
} GPIO_CFGF_GPIO45INCFG_Enum;

/* =============================================  GPIO CFGF GPIO44INTD [19..19]  ============================================= */
typedef enum {                                  /*!< GPIO_CFGF_GPIO44INTD                                                      */
  GPIO_CFGF_GPIO44INTD_nCELOW          = 0,     /*!< nCELOW : Applies when PAD44FNCSEL = NCE44 - nCE polarity active
                                                     low                                                                       */
  GPIO_CFGF_GPIO44INTD_nCEHIGH         = 1,     /*!< nCEHIGH : Applies when PAD44FNCSEL = NCE44 - nCE polarity active
                                                     high                                                                      */
} GPIO_CFGF_GPIO44INTD_Enum;

/* ============================================  GPIO CFGF GPIO44OUTCFG [17..18]  ============================================ */
typedef enum {                                  /*!< GPIO_CFGF_GPIO44OUTCFG                                                    */
  GPIO_CFGF_GPIO44OUTCFG_DIS           = 0,     /*!< DIS : Applies when PAD44FNCSEL = GPIO - Output disabled                   */
  GPIO_CFGF_GPIO44OUTCFG_PUSHPULL      = 1,     /*!< PUSHPULL : Applies when PAD44FNCSEL = GPIO - Output is push-pull          */
  GPIO_CFGF_GPIO44OUTCFG_OD            = 2,     /*!< OD : Applies when PAD44FNCSEL = GPIO - Output is open drain               */
  GPIO_CFGF_GPIO44OUTCFG_TS            = 3,     /*!< TS : Applies when PAD44FNCSEL = GPIO - Output is tri-state                */
} GPIO_CFGF_GPIO44OUTCFG_Enum;

/* ============================================  GPIO CFGF GPIO44INCFG [16..16]  ============================================= */
typedef enum {                                  /*!< GPIO_CFGF_GPIO44INCFG                                                     */
  GPIO_CFGF_GPIO44INCFG_READ           = 0,     /*!< READ : Read the GPIO pin data                                             */
  GPIO_CFGF_GPIO44INCFG_RDZERO         = 1,     /*!< RDZERO : INTD = 0 - Readback will always be zero                          */
} GPIO_CFGF_GPIO44INCFG_Enum;

/* =============================================  GPIO CFGF GPIO43INTD [15..15]  ============================================= */
typedef enum {                                  /*!< GPIO_CFGF_GPIO43INTD                                                      */
  GPIO_CFGF_GPIO43INTD_nCELOW          = 0,     /*!< nCELOW : Applies when PAD43FNCSEL = NCE43 - nCE polarity active
                                                     low                                                                       */
  GPIO_CFGF_GPIO43INTD_nCEHIGH         = 1,     /*!< nCEHIGH : Applies when PAD43FNCSEL = NCE43 - nCE polarity active
                                                     high                                                                      */
} GPIO_CFGF_GPIO43INTD_Enum;

/* ============================================  GPIO CFGF GPIO43OUTCFG [13..14]  ============================================ */
typedef enum {                                  /*!< GPIO_CFGF_GPIO43OUTCFG                                                    */
  GPIO_CFGF_GPIO43OUTCFG_DIS           = 0,     /*!< DIS : Applies when PAD43FNCSEL = GPIO - Output disabled                   */
  GPIO_CFGF_GPIO43OUTCFG_PUSHPULL      = 1,     /*!< PUSHPULL : Applies when PAD43FNCSEL = GPIO - Output is push-pull          */
  GPIO_CFGF_GPIO43OUTCFG_OD            = 2,     /*!< OD : Applies when PAD43FNCSEL = GPIO - Output is open drain               */
  GPIO_CFGF_GPIO43OUTCFG_TS            = 3,     /*!< TS : Applies when PAD43FNCSEL = GPIO - Output is tri-state                */
} GPIO_CFGF_GPIO43OUTCFG_Enum;

/* ============================================  GPIO CFGF GPIO43INCFG [12..12]  ============================================= */
typedef enum {                                  /*!< GPIO_CFGF_GPIO43INCFG                                                     */
  GPIO_CFGF_GPIO43INCFG_READ           = 0,     /*!< READ : Read the GPIO pin data                                             */
  GPIO_CFGF_GPIO43INCFG_RDZERO         = 1,     /*!< RDZERO : INTD = 0 - Readback will always be zero                          */
} GPIO_CFGF_GPIO43INCFG_Enum;

/* =============================================  GPIO CFGF GPIO42INTD [11..11]  ============================================= */
typedef enum {                                  /*!< GPIO_CFGF_GPIO42INTD                                                      */
  GPIO_CFGF_GPIO42INTD_nCELOW          = 0,     /*!< nCELOW : Applies when PAD42FNCSEL = NCE42 - nCE polarity active
                                                     low                                                                       */
  GPIO_CFGF_GPIO42INTD_nCEHIGH         = 1,     /*!< nCEHIGH : Applies when PAD42FNCSEL = NCE42 - nCE polarity active
                                                     high                                                                      */
} GPIO_CFGF_GPIO42INTD_Enum;

/* ============================================  GPIO CFGF GPIO42OUTCFG [9..10]  ============================================= */
typedef enum {                                  /*!< GPIO_CFGF_GPIO42OUTCFG                                                    */
  GPIO_CFGF_GPIO42OUTCFG_DIS           = 0,     /*!< DIS : Applies when PAD42FNCSEL = GPIO - Output disabled                   */
  GPIO_CFGF_GPIO42OUTCFG_PUSHPULL      = 1,     /*!< PUSHPULL : Applies when PAD42FNCSEL = GPIO - Output is push-pull          */
  GPIO_CFGF_GPIO42OUTCFG_OD            = 2,     /*!< OD : Applies when PAD42FNCSEL = GPIO - Output is open drain               */
  GPIO_CFGF_GPIO42OUTCFG_TS            = 3,     /*!< TS : Applies when PAD42FNCSEL = GPIO - Output is tri-state                */
} GPIO_CFGF_GPIO42OUTCFG_Enum;

/* =============================================  GPIO CFGF GPIO42INCFG [8..8]  ============================================== */
typedef enum {                                  /*!< GPIO_CFGF_GPIO42INCFG                                                     */
  GPIO_CFGF_GPIO42INCFG_READ           = 0,     /*!< READ : Read the GPIO pin data                                             */
  GPIO_CFGF_GPIO42INCFG_RDZERO         = 1,     /*!< RDZERO : INTD = 0 - Readback will always be zero                          */
} GPIO_CFGF_GPIO42INCFG_Enum;

