sparkfun/Arduino_Apollo3/cores/arduino/am_sdk_ap3/CMSIS/AmbiqMicro/Include/apollo3c.h
/* ==============================================  GPIO CFGF GPIO41INTD [7..7]  ============================================== */
typedef enum {                                  /*!< GPIO_CFGF_GPIO41INTD                                                      */
  GPIO_CFGF_GPIO41INTD_nCELOW          = 0,     /*!< nCELOW : Applies when PAD41FNCSEL = NCE41 - nCE polarity active
                                                     low                                                                       */
  GPIO_CFGF_GPIO41INTD_nCEHIGH         = 1,     /*!< nCEHIGH : Applies when PAD41FNCSEL = NCE41 - nCE polarity active
                                                     high                                                                      */
} GPIO_CFGF_GPIO41INTD_Enum;

/* =============================================  GPIO CFGF GPIO41OUTCFG [5..6]  ============================================= */
typedef enum {                                  /*!< GPIO_CFGF_GPIO41OUTCFG                                                    */
  GPIO_CFGF_GPIO41OUTCFG_DIS           = 0,     /*!< DIS : Applies when PAD41FNCSEL = GPIO - Output disabled                   */
  GPIO_CFGF_GPIO41OUTCFG_PUSHPULL      = 1,     /*!< PUSHPULL : Applies when PAD41FNCSEL = GPIO - Output is push-pull          */
  GPIO_CFGF_GPIO41OUTCFG_OD            = 2,     /*!< OD : Applies when PAD41FNCSEL = GPIO - Output is open drain               */
  GPIO_CFGF_GPIO41OUTCFG_TS            = 3,     /*!< TS : Applies when PAD41FNCSEL = GPIO - Output is tri-state                */
} GPIO_CFGF_GPIO41OUTCFG_Enum;

/* =============================================  GPIO CFGF GPIO41INCFG [4..4]  ============================================== */
typedef enum {                                  /*!< GPIO_CFGF_GPIO41INCFG                                                     */
  GPIO_CFGF_GPIO41INCFG_READ           = 0,     /*!< READ : Read the GPIO pin data                                             */
  GPIO_CFGF_GPIO41INCFG_RDZERO         = 1,     /*!< RDZERO : INTD = 0 - Readback will always be zero                          */
} GPIO_CFGF_GPIO41INCFG_Enum;

/* ==============================================  GPIO CFGF GPIO40INTD [3..3]  ============================================== */
typedef enum {                                  /*!< GPIO_CFGF_GPIO40INTD                                                      */
  GPIO_CFGF_GPIO40INTD_INTDIS          = 0,     /*!< INTDIS : Applies when GPIO40INCFG = 1 - No interrupt on GPIO
                                                     transition                                                                */
  GPIO_CFGF_GPIO40INTD_INTBOTH         = 1,     /*!< INTBOTH : Applies when GPIO40INCFG = 1 - Interrupt on either
                                                     low to high or high to low GPIO transition                                */
} GPIO_CFGF_GPIO40INTD_Enum;

/* =============================================  GPIO CFGF GPIO40OUTCFG [1..2]  ============================================= */
typedef enum {                                  /*!< GPIO_CFGF_GPIO40OUTCFG                                                    */
  GPIO_CFGF_GPIO40OUTCFG_DIS           = 0,     /*!< DIS : Applies when PAD40FNCSEL = GPIO - Output disabled                   */
  GPIO_CFGF_GPIO40OUTCFG_PUSHPULL      = 1,     /*!< PUSHPULL : Applies when PAD40FNCSEL = GPIO - Output is push-pull          */
  GPIO_CFGF_GPIO40OUTCFG_OD            = 2,     /*!< OD : Applies when PAD40FNCSEL = GPIO - Output is open drain               */
  GPIO_CFGF_GPIO40OUTCFG_TS            = 3,     /*!< TS : Applies when PAD40FNCSEL = GPIO - Output is tri-state                */
} GPIO_CFGF_GPIO40OUTCFG_Enum;

/* =============================================  GPIO CFGF GPIO40INCFG [0..0]  ============================================== */
typedef enum {                                  /*!< GPIO_CFGF_GPIO40INCFG                                                     */
  GPIO_CFGF_GPIO40INCFG_READ           = 0,     /*!< READ : Read the GPIO pin data                                             */
  GPIO_CFGF_GPIO40INCFG_RDZERO         = 1,     /*!< RDZERO : INTD = 0 - Readback will always be zero                          */
} GPIO_CFGF_GPIO40INCFG_Enum;

/* =========================================================  CFGG  ========================================================== */
/* =============================================  GPIO CFGG GPIO55INTD [31..31]  ============================================= */
typedef enum {                                  /*!< GPIO_CFGG_GPIO55INTD                                                      */
  GPIO_CFGG_GPIO55INTD_nCELOW          = 0,     /*!< nCELOW : Applies when PAD55FNCSEL = NCE55 - nCE polarity active
                                                     low                                                                       */
  GPIO_CFGG_GPIO55INTD_nCEHIGH         = 1,     /*!< nCEHIGH : Applies when PAD55FNCSEL = NCE55 - nCE polarity active
                                                     high                                                                      */
} GPIO_CFGG_GPIO55INTD_Enum;

/* ============================================  GPIO CFGG GPIO55OUTCFG [29..30]  ============================================ */
typedef enum {                                  /*!< GPIO_CFGG_GPIO55OUTCFG                                                    */
  GPIO_CFGG_GPIO55OUTCFG_DIS           = 0,     /*!< DIS : Applies when PAD55FNCSEL = GPIO - Output disabled                   */
  GPIO_CFGG_GPIO55OUTCFG_PUSHPULL      = 1,     /*!< PUSHPULL : Applies when PAD55FNCSEL = GPIO - Output is push-pull          */
  GPIO_CFGG_GPIO55OUTCFG_OD            = 2,     /*!< OD : Applies when PAD55FNCSEL = GPIO - Output is open drain               */
  GPIO_CFGG_GPIO55OUTCFG_TS            = 3,     /*!< TS : Applies when PAD55FNCSEL = GPIO - Output is tri-state                */
} GPIO_CFGG_GPIO55OUTCFG_Enum;

/* ============================================  GPIO CFGG GPIO55INCFG [28..28]  ============================================= */
typedef enum {                                  /*!< GPIO_CFGG_GPIO55INCFG                                                     */
  GPIO_CFGG_GPIO55INCFG_READ           = 0,     /*!< READ : Read the GPIO pin data                                             */
  GPIO_CFGG_GPIO55INCFG_RDZERO         = 1,     /*!< RDZERO : INTD = 0 - Readback will always be zero                          */
} GPIO_CFGG_GPIO55INCFG_Enum;

/* =============================================  GPIO CFGG GPIO54INTD [27..27]  ============================================= */
typedef enum {                                  /*!< GPIO_CFGG_GPIO54INTD                                                      */
  GPIO_CFGG_GPIO54INTD_nCELOW          = 0,     /*!< nCELOW : Applies when PAD54FNCSEL = NCE54 - nCE polarity active
                                                     low                                                                       */
  GPIO_CFGG_GPIO54INTD_nCEHIGH         = 1,     /*!< nCEHIGH : Applies when PAD54FNCSEL = NCE54 - nCE polarity active
                                                     high                                                                      */
} GPIO_CFGG_GPIO54INTD_Enum;

/* ============================================  GPIO CFGG GPIO54OUTCFG [25..26]  ============================================ */
typedef enum {                                  /*!< GPIO_CFGG_GPIO54OUTCFG                                                    */
  GPIO_CFGG_GPIO54OUTCFG_DIS           = 0,     /*!< DIS : Applies when PAD54FNCSEL = GPIO - Output disabled                   */
  GPIO_CFGG_GPIO54OUTCFG_PUSHPULL      = 1,     /*!< PUSHPULL : Applies when PAD54FNCSEL = GPIO - Output is push-pull          */
  GPIO_CFGG_GPIO54OUTCFG_OD            = 2,     /*!< OD : Applies when PAD54FNCSEL = GPIO - Output is open drain               */
  GPIO_CFGG_GPIO54OUTCFG_TS            = 3,     /*!< TS : Applies when PAD54FNCSEL = GPIO - Output is tri-state                */
} GPIO_CFGG_GPIO54OUTCFG_Enum;

