sparkfun/Arduino_Apollo3/cores/arduino/am_sdk_ap3/CMSIS/AmbiqMicro/Include/apollo3c.h
/* ============================================  GPIO CFGG GPIO50OUTCFG [9..10]  ============================================= */
typedef enum {                                  /*!< GPIO_CFGG_GPIO50OUTCFG                                                    */
  GPIO_CFGG_GPIO50OUTCFG_DIS           = 0,     /*!< DIS : Applies when PAD50FNCSEL = GPIO - Output disabled                   */
  GPIO_CFGG_GPIO50OUTCFG_PUSHPULL      = 1,     /*!< PUSHPULL : Applies when PAD50FNCSEL = GPIO - Output is push-pull          */
  GPIO_CFGG_GPIO50OUTCFG_OD            = 2,     /*!< OD : Applies when PAD50FNCSEL = GPIO - Output is open drain               */
  GPIO_CFGG_GPIO50OUTCFG_TS            = 3,     /*!< TS : Applies when PAD50FNCSEL = GPIO - Output is tri-state                */
} GPIO_CFGG_GPIO50OUTCFG_Enum;

/* =============================================  GPIO CFGG GPIO50INCFG [8..8]  ============================================== */
typedef enum {                                  /*!< GPIO_CFGG_GPIO50INCFG                                                     */
  GPIO_CFGG_GPIO50INCFG_READ           = 0,     /*!< READ : Read the GPIO pin data                                             */
  GPIO_CFGG_GPIO50INCFG_RDZERO         = 1,     /*!< RDZERO : INTD = 0 - Readback will always be zero                          */
} GPIO_CFGG_GPIO50INCFG_Enum;

/* ==============================================  GPIO CFGG GPIO49INTD [7..7]  ============================================== */
typedef enum {                                  /*!< GPIO_CFGG_GPIO49INTD                                                      */
  GPIO_CFGG_GPIO49INTD_nCELOW          = 0,     /*!< nCELOW : Applies when PAD49FNCSEL = NCE49 - nCE polarity active
                                                     low                                                                       */
  GPIO_CFGG_GPIO49INTD_nCEHIGH         = 1,     /*!< nCEHIGH : Applies when PAD49FNCSEL = NCE49 - nCE polarity active
                                                     high                                                                      */
} GPIO_CFGG_GPIO49INTD_Enum;

/* =============================================  GPIO CFGG GPIO49OUTCFG [5..6]  ============================================= */
typedef enum {                                  /*!< GPIO_CFGG_GPIO49OUTCFG                                                    */
  GPIO_CFGG_GPIO49OUTCFG_DIS           = 0,     /*!< DIS : Applies when PAD49FNCSEL = GPIO - Output disabled                   */
  GPIO_CFGG_GPIO49OUTCFG_PUSHPULL      = 1,     /*!< PUSHPULL : Applies when PAD49FNCSEL = GPIO - Output is push-pull          */
  GPIO_CFGG_GPIO49OUTCFG_OD            = 2,     /*!< OD : Applies when PAD49FNCSEL = GPIO - Output is open drain               */
  GPIO_CFGG_GPIO49OUTCFG_TS            = 3,     /*!< TS : Applies when PAD49FNCSEL = GPIO - Output is tri-state                */
} GPIO_CFGG_GPIO49OUTCFG_Enum;

/* =============================================  GPIO CFGG GPIO49INCFG [4..4]  ============================================== */
typedef enum {                                  /*!< GPIO_CFGG_GPIO49INCFG                                                     */
  GPIO_CFGG_GPIO49INCFG_READ           = 0,     /*!< READ : Read the GPIO pin data                                             */
  GPIO_CFGG_GPIO49INCFG_RDZERO         = 1,     /*!< RDZERO : INTD = 0 - Readback will always be zero                          */
} GPIO_CFGG_GPIO49INCFG_Enum;

/* ==============================================  GPIO CFGG GPIO48INTD [3..3]  ============================================== */
typedef enum {                                  /*!< GPIO_CFGG_GPIO48INTD                                                      */
  GPIO_CFGG_GPIO48INTD_nCELOW          = 0,     /*!< nCELOW : Applies when PAD48FNCSEL = NCE48 - nCE polarity active
                                                     low                                                                       */
  GPIO_CFGG_GPIO48INTD_nCEHIGH         = 1,     /*!< nCEHIGH : Applies when PAD48FNCSEL = NCE48 - nCE polarity active
                                                     high                                                                      */
} GPIO_CFGG_GPIO48INTD_Enum;

/* =============================================  GPIO CFGG GPIO48OUTCFG [1..2]  ============================================= */
typedef enum {                                  /*!< GPIO_CFGG_GPIO48OUTCFG                                                    */
  GPIO_CFGG_GPIO48OUTCFG_DIS           = 0,     /*!< DIS : Applies when PAD48FNCSEL = GPIO - Output disabled                   */
  GPIO_CFGG_GPIO48OUTCFG_PUSHPULL      = 1,     /*!< PUSHPULL : Applies when PAD48FNCSEL = GPIO - Output is push-pull          */
  GPIO_CFGG_GPIO48OUTCFG_OD            = 2,     /*!< OD : Applies when PAD48FNCSEL = GPIO - Output is open drain               */
  GPIO_CFGG_GPIO48OUTCFG_TS            = 3,     /*!< TS : Applies when PAD48FNCSEL = GPIO - Output is tri-state                */
} GPIO_CFGG_GPIO48OUTCFG_Enum;

/* =============================================  GPIO CFGG GPIO48INCFG [0..0]  ============================================== */
typedef enum {                                  /*!< GPIO_CFGG_GPIO48INCFG                                                     */
  GPIO_CFGG_GPIO48INCFG_READ           = 0,     /*!< READ : Read the GPIO pin data                                             */
  GPIO_CFGG_GPIO48INCFG_RDZERO         = 1,     /*!< RDZERO : INTD = 0 - Readback will always be zero                          */
} GPIO_CFGG_GPIO48INCFG_Enum;

/* =========================================================  CFGH  ========================================================== */
/* =============================================  GPIO CFGH GPIO63INTD [31..31]  ============================================= */
typedef enum {                                  /*!< GPIO_CFGH_GPIO63INTD                                                      */
  GPIO_CFGH_GPIO63INTD_nCELOW          = 0,     /*!< nCELOW : Applies when PAD63FNCSEL = NCE63 - nCE polarity active
                                                     low                                                                       */
  GPIO_CFGH_GPIO63INTD_nCEHIGH         = 1,     /*!< nCEHIGH : Applies when PAD63FNCSEL = NCE63 - nCE polarity active
                                                     high                                                                      */
} GPIO_CFGH_GPIO63INTD_Enum;

