sparkfun/Arduino_Apollo3/cores/arduino/am_sdk_ap3/CMSIS/AmbiqMicro/Include/apollo3c.h
/* ============================================  GPIO CFGH GPIO63OUTCFG [29..30]  ============================================ */
typedef enum {                                  /*!< GPIO_CFGH_GPIO63OUTCFG                                                    */
  GPIO_CFGH_GPIO63OUTCFG_DIS           = 0,     /*!< DIS : Applies when PAD63FNCSEL = GPIO - Output disabled                   */
  GPIO_CFGH_GPIO63OUTCFG_PUSHPULL      = 1,     /*!< PUSHPULL : Applies when PAD63FNCSEL = GPIO - Output is push-pull          */
  GPIO_CFGH_GPIO63OUTCFG_OD            = 2,     /*!< OD : Applies when PAD63FNCSEL = GPIO - Output is open drain               */
  GPIO_CFGH_GPIO63OUTCFG_TS            = 3,     /*!< TS : Applies when PAD63FNCSEL = GPIO - Output is tri-state                */
} GPIO_CFGH_GPIO63OUTCFG_Enum;

/* ============================================  GPIO CFGH GPIO63INCFG [28..28]  ============================================= */
typedef enum {                                  /*!< GPIO_CFGH_GPIO63INCFG                                                     */
  GPIO_CFGH_GPIO63INCFG_READ           = 0,     /*!< READ : Read the GPIO pin data                                             */
  GPIO_CFGH_GPIO63INCFG_RDZERO         = 1,     /*!< RDZERO : INTD = 0 - Readback will always be zero                          */
} GPIO_CFGH_GPIO63INCFG_Enum;

/* =============================================  GPIO CFGH GPIO62INTD [27..27]  ============================================= */
typedef enum {                                  /*!< GPIO_CFGH_GPIO62INTD                                                      */
  GPIO_CFGH_GPIO62INTD_nCELOW          = 0,     /*!< nCELOW : Applies when PAD62FNCSEL = NCE62 - nCE polarity active
                                                     low                                                                       */
  GPIO_CFGH_GPIO62INTD_nCEHIGH         = 1,     /*!< nCEHIGH : Applies when PAD62FNCSEL = NCE62 - nCE polarity active
                                                     high                                                                      */
} GPIO_CFGH_GPIO62INTD_Enum;

/* ============================================  GPIO CFGH GPIO62OUTCFG [25..26]  ============================================ */
typedef enum {                                  /*!< GPIO_CFGH_GPIO62OUTCFG                                                    */
  GPIO_CFGH_GPIO62OUTCFG_DIS           = 0,     /*!< DIS : Applies when PAD62FNCSEL = GPIO - Output disabled                   */
  GPIO_CFGH_GPIO62OUTCFG_PUSHPULL      = 1,     /*!< PUSHPULL : Applies when PAD62FNCSEL = GPIO - Output is push-pull          */
  GPIO_CFGH_GPIO62OUTCFG_OD            = 2,     /*!< OD : Applies when PAD62FNCSEL = GPIO - Output is open drain               */
  GPIO_CFGH_GPIO62OUTCFG_TS            = 3,     /*!< TS : Applies when PAD62FNCSEL = GPIO - Output is tri-state                */
} GPIO_CFGH_GPIO62OUTCFG_Enum;

/* ============================================  GPIO CFGH GPIO62INCFG [24..24]  ============================================= */
typedef enum {                                  /*!< GPIO_CFGH_GPIO62INCFG                                                     */
  GPIO_CFGH_GPIO62INCFG_READ           = 0,     /*!< READ : Read the GPIO pin data                                             */
  GPIO_CFGH_GPIO62INCFG_RDZERO         = 1,     /*!< RDZERO : INTD = 0 - Readback will always be zero                          */
} GPIO_CFGH_GPIO62INCFG_Enum;

/* =============================================  GPIO CFGH GPIO61INTD [23..23]  ============================================= */
typedef enum {                                  /*!< GPIO_CFGH_GPIO61INTD                                                      */
  GPIO_CFGH_GPIO61INTD_nCELOW          = 0,     /*!< nCELOW : Applies when PAD61FNCSEL = NCE61 - nCE polarity active
                                                     low                                                                       */
  GPIO_CFGH_GPIO61INTD_nCEHIGH         = 1,     /*!< nCEHIGH : Applies when PAD61FNCSEL = NCE61 - nCE polarity active
                                                     high                                                                      */
} GPIO_CFGH_GPIO61INTD_Enum;

/* ============================================  GPIO CFGH GPIO61OUTCFG [21..22]  ============================================ */
typedef enum {                                  /*!< GPIO_CFGH_GPIO61OUTCFG                                                    */
  GPIO_CFGH_GPIO61OUTCFG_DIS           = 0,     /*!< DIS : Applies when PAD61FNCSEL = GPIO - Output disabled                   */
  GPIO_CFGH_GPIO61OUTCFG_PUSHPULL      = 1,     /*!< PUSHPULL : Applies when PAD61FNCSEL = GPIO - Output is push-pull          */
  GPIO_CFGH_GPIO61OUTCFG_OD            = 2,     /*!< OD : Applies when PAD61FNCSEL = GPIO - Output is open drain               */
  GPIO_CFGH_GPIO61OUTCFG_TS            = 3,     /*!< TS : Applies when PAD61FNCSEL = GPIO - Output is tri-state                */
} GPIO_CFGH_GPIO61OUTCFG_Enum;

/* ============================================  GPIO CFGH GPIO61INCFG [20..20]  ============================================= */
typedef enum {                                  /*!< GPIO_CFGH_GPIO61INCFG                                                     */
  GPIO_CFGH_GPIO61INCFG_READ           = 0,     /*!< READ : Read the GPIO pin data                                             */
  GPIO_CFGH_GPIO61INCFG_RDZERO         = 1,     /*!< RDZERO : INTD = 0 - Readback will always be zero                          */
} GPIO_CFGH_GPIO61INCFG_Enum;

/* =============================================  GPIO CFGH GPIO60INTD [19..19]  ============================================= */
typedef enum {                                  /*!< GPIO_CFGH_GPIO60INTD                                                      */
  GPIO_CFGH_GPIO60INTD_nCELOW          = 0,     /*!< nCELOW : Applies when PAD60FNCSEL = NCE60 - nCE polarity active
                                                     low                                                                       */
  GPIO_CFGH_GPIO60INTD_nCEHIGH         = 1,     /*!< nCEHIGH : Applies when PAD60FNCSEL = NCE60 - nCE polarity active
                                                     high                                                                      */
} GPIO_CFGH_GPIO60INTD_Enum;

