sparkfun/Arduino_Apollo3/cores/arduino/am_sdk_ap3/CMSIS/AmbiqMicro/Include/apollo3c.h
/* ============================================  GPIO CFGI GPIO70INCFG [24..24]  ============================================= */
typedef enum {                                  /*!< GPIO_CFGI_GPIO70INCFG                                                     */
  GPIO_CFGI_GPIO70INCFG_READ           = 0,     /*!< READ : Read the GPIO pin data                                             */
  GPIO_CFGI_GPIO70INCFG_RDZERO         = 1,     /*!< RDZERO : INTD = 0 - Readback will always be zero                          */
} GPIO_CFGI_GPIO70INCFG_Enum;

/* =============================================  GPIO CFGI GPIO69INTD [23..23]  ============================================= */
typedef enum {                                  /*!< GPIO_CFGI_GPIO69INTD                                                      */
  GPIO_CFGI_GPIO69INTD_nCELOW          = 0,     /*!< nCELOW : Applies when PAD69FNCSEL = NCE69 - nCE polarity active
                                                     low                                                                       */
  GPIO_CFGI_GPIO69INTD_nCEHIGH         = 1,     /*!< nCEHIGH : Applies when PAD69FNCSEL = NCE69 - nCE polarity active
                                                     high                                                                      */
} GPIO_CFGI_GPIO69INTD_Enum;

/* ============================================  GPIO CFGI GPIO69OUTCFG [21..22]  ============================================ */
typedef enum {                                  /*!< GPIO_CFGI_GPIO69OUTCFG                                                    */
  GPIO_CFGI_GPIO69OUTCFG_DIS           = 0,     /*!< DIS : Applies when PAD69FNCSEL = GPIO - Output disabled                   */
  GPIO_CFGI_GPIO69OUTCFG_PUSHPULL      = 1,     /*!< PUSHPULL : Applies when PAD69FNCSEL = GPIO - Output is push-pull          */
  GPIO_CFGI_GPIO69OUTCFG_OD            = 2,     /*!< OD : Applies when PAD69FNCSEL = GPIO - Output is open drain               */
  GPIO_CFGI_GPIO69OUTCFG_TS            = 3,     /*!< TS : Applies when PAD69FNCSEL = GPIO - Output is tri-state                */
} GPIO_CFGI_GPIO69OUTCFG_Enum;

/* ============================================  GPIO CFGI GPIO69INCFG [20..20]  ============================================= */
typedef enum {                                  /*!< GPIO_CFGI_GPIO69INCFG                                                     */
  GPIO_CFGI_GPIO69INCFG_READ           = 0,     /*!< READ : Read the GPIO pin data                                             */
  GPIO_CFGI_GPIO69INCFG_RDZERO         = 1,     /*!< RDZERO : INTD = 0 - Readback will always be zero                          */
} GPIO_CFGI_GPIO69INCFG_Enum;

/* =============================================  GPIO CFGI GPIO68INTD [19..19]  ============================================= */
typedef enum {                                  /*!< GPIO_CFGI_GPIO68INTD                                                      */
  GPIO_CFGI_GPIO68INTD_nCELOW          = 0,     /*!< nCELOW : Applies when PAD68FNCSEL = NCE68 - nCE polarity active
                                                     low                                                                       */
  GPIO_CFGI_GPIO68INTD_nCEHIGH         = 1,     /*!< nCEHIGH : Applies when PAD68FNCSEL = NCE68 - nCE polarity active
                                                     high                                                                      */
} GPIO_CFGI_GPIO68INTD_Enum;

/* ============================================  GPIO CFGI GPIO68OUTCFG [17..18]  ============================================ */
typedef enum {                                  /*!< GPIO_CFGI_GPIO68OUTCFG                                                    */
  GPIO_CFGI_GPIO68OUTCFG_DIS           = 0,     /*!< DIS : Applies when PAD68FNCSEL = GPIO - Output disabled                   */
  GPIO_CFGI_GPIO68OUTCFG_PUSHPULL      = 1,     /*!< PUSHPULL : Applies when PAD68FNCSEL = GPIO - Output is push-pull          */
  GPIO_CFGI_GPIO68OUTCFG_OD            = 2,     /*!< OD : Applies when PAD68FNCSEL = GPIO - Output is open drain               */
  GPIO_CFGI_GPIO68OUTCFG_TS            = 3,     /*!< TS : Applies when PAD68FNCSEL = GPIO - Output is tri-state                */
} GPIO_CFGI_GPIO68OUTCFG_Enum;

/* ============================================  GPIO CFGI GPIO68INCFG [16..16]  ============================================= */
typedef enum {                                  /*!< GPIO_CFGI_GPIO68INCFG                                                     */
  GPIO_CFGI_GPIO68INCFG_READ           = 0,     /*!< READ : Read the GPIO pin data                                             */
  GPIO_CFGI_GPIO68INCFG_RDZERO         = 1,     /*!< RDZERO : INTD = 0 - Readback will always be zero                          */
} GPIO_CFGI_GPIO68INCFG_Enum;

/* =============================================  GPIO CFGI GPIO67INTD [15..15]  ============================================= */
typedef enum {                                  /*!< GPIO_CFGI_GPIO67INTD                                                      */
  GPIO_CFGI_GPIO67INTD_nCELOW          = 0,     /*!< nCELOW : Applies when PAD67FNCSEL = NCE67 - nCE polarity active
                                                     low                                                                       */
  GPIO_CFGI_GPIO67INTD_nCEHIGH         = 1,     /*!< nCEHIGH : Applies when PAD67FNCSEL = NCE67 - nCE polarity active
                                                     high                                                                      */
} GPIO_CFGI_GPIO67INTD_Enum;

/* ============================================  GPIO CFGI GPIO67OUTCFG [13..14]  ============================================ */
typedef enum {                                  /*!< GPIO_CFGI_GPIO67OUTCFG                                                    */
  GPIO_CFGI_GPIO67OUTCFG_DIS           = 0,     /*!< DIS : Applies when PAD67FNCSEL = GPIO - Output disabled                   */
  GPIO_CFGI_GPIO67OUTCFG_PUSHPULL      = 1,     /*!< PUSHPULL : Applies when PAD67FNCSEL = GPIO - Output is push-pull          */
  GPIO_CFGI_GPIO67OUTCFG_OD            = 2,     /*!< OD : Applies when PAD67FNCSEL = GPIO - Output is open drain               */
  GPIO_CFGI_GPIO67OUTCFG_TS            = 3,     /*!< TS : Applies when PAD67FNCSEL = GPIO - Output is tri-state                */
} GPIO_CFGI_GPIO67OUTCFG_Enum;

/* ============================================  GPIO CFGI GPIO67INCFG [12..12]  ============================================= */
typedef enum {                                  /*!< GPIO_CFGI_GPIO67INCFG                                                     */
  GPIO_CFGI_GPIO67INCFG_READ           = 0,     /*!< READ : Read the GPIO pin data                                             */
  GPIO_CFGI_GPIO67INCFG_RDZERO         = 1,     /*!< RDZERO : INTD = 0 - Readback will always be zero                          */
} GPIO_CFGI_GPIO67INCFG_Enum;

/* =============================================  GPIO CFGI GPIO66INTD [11..11]  ============================================= */
typedef enum {                                  /*!< GPIO_CFGI_GPIO66INTD                                                      */
  GPIO_CFGI_GPIO66INTD_nCELOW          = 0,     /*!< nCELOW : Applies when PAD66FNCSEL = NCE66 - nCE polarity active
                                                     low                                                                       */
  GPIO_CFGI_GPIO66INTD_nCEHIGH         = 1,     /*!< nCEHIGH : Applies when PAD66FNCSEL = NCE66 - nCE polarity active
                                                     high                                                                      */
} GPIO_CFGI_GPIO66INTD_Enum;

/* ============================================  GPIO CFGI GPIO66OUTCFG [9..10]  ============================================= */
typedef enum {                                  /*!< GPIO_CFGI_GPIO66OUTCFG                                                    */
  GPIO_CFGI_GPIO66OUTCFG_DIS           = 0,     /*!< DIS : Applies when PAD66FNCSEL = GPIO - Output disabled                   */
  GPIO_CFGI_GPIO66OUTCFG_PUSHPULL      = 1,     /*!< PUSHPULL : Applies when PAD66FNCSEL = GPIO - Output is push-pull          */
  GPIO_CFGI_GPIO66OUTCFG_OD            = 2,     /*!< OD : Applies when PAD66FNCSEL = GPIO - Output is open drain               */
  GPIO_CFGI_GPIO66OUTCFG_TS            = 3,     /*!< TS : Applies when PAD66FNCSEL = GPIO - Output is tri-state                */
} GPIO_CFGI_GPIO66OUTCFG_Enum;

/* =============================================  GPIO CFGI GPIO66INCFG [8..8]  ============================================== */
typedef enum {                                  /*!< GPIO_CFGI_GPIO66INCFG                                                     */
  GPIO_CFGI_GPIO66INCFG_READ           = 0,     /*!< READ : Read the GPIO pin data                                             */
  GPIO_CFGI_GPIO66INCFG_RDZERO         = 1,     /*!< RDZERO : INTD = 0 - Readback will always be zero                          */
} GPIO_CFGI_GPIO66INCFG_Enum;

/* ==============================================  GPIO CFGI GPIO65INTD [7..7]  ============================================== */
typedef enum {                                  /*!< GPIO_CFGI_GPIO65INTD                                                      */
  GPIO_CFGI_GPIO65INTD_nCELOW          = 0,     /*!< nCELOW : Applies when PAD65FNCSEL = NCE65 - nCE polarity active
                                                     low                                                                       */
  GPIO_CFGI_GPIO65INTD_nCEHIGH         = 1,     /*!< nCEHIGH : Applies when PAD65FNCSEL = NCE65 - nCE polarity active
                                                     high                                                                      */
} GPIO_CFGI_GPIO65INTD_Enum;

/* =============================================  GPIO CFGI GPIO65OUTCFG [5..6]  ============================================= */
typedef enum {                                  /*!< GPIO_CFGI_GPIO65OUTCFG                                                    */
  GPIO_CFGI_GPIO65OUTCFG_DIS           = 0,     /*!< DIS : Applies when PAD65FNCSEL = GPIO - Output disabled                   */
  GPIO_CFGI_GPIO65OUTCFG_PUSHPULL      = 1,     /*!< PUSHPULL : Applies when PAD65FNCSEL = GPIO - Output is push-pull          */
  GPIO_CFGI_GPIO65OUTCFG_OD            = 2,     /*!< OD : Applies when PAD65FNCSEL = GPIO - Output is open drain               */
  GPIO_CFGI_GPIO65OUTCFG_TS            = 3,     /*!< TS : Applies when PAD65FNCSEL = GPIO - Output is tri-state                */
} GPIO_CFGI_GPIO65OUTCFG_Enum;

