sparkfun/Arduino_Apollo3/cores/arduino/am_sdk_ap3/CMSIS/AmbiqMicro/Include/apollo3c.h
/* =============================================  GPIO CFGI GPIO65INCFG [4..4]  ============================================== */
typedef enum {                                  /*!< GPIO_CFGI_GPIO65INCFG                                                     */
  GPIO_CFGI_GPIO65INCFG_READ           = 0,     /*!< READ : Read the GPIO pin data                                             */
  GPIO_CFGI_GPIO65INCFG_RDZERO         = 1,     /*!< RDZERO : INTD = 0 - Readback will always be zero                          */
} GPIO_CFGI_GPIO65INCFG_Enum;

/* ==============================================  GPIO CFGI GPIO64INTD [3..3]  ============================================== */
typedef enum {                                  /*!< GPIO_CFGI_GPIO64INTD                                                      */
  GPIO_CFGI_GPIO64INTD_nCELOW          = 0,     /*!< nCELOW : Applies when PAD64FNCSEL = NCE64 - nCE polarity active
                                                     low                                                                       */
  GPIO_CFGI_GPIO64INTD_nCEHIGH         = 1,     /*!< nCEHIGH : Applies when PAD64FNCSEL = NCE64 - nCE polarity active
                                                     high                                                                      */
} GPIO_CFGI_GPIO64INTD_Enum;

/* =============================================  GPIO CFGI GPIO64OUTCFG [1..2]  ============================================= */
typedef enum {                                  /*!< GPIO_CFGI_GPIO64OUTCFG                                                    */
  GPIO_CFGI_GPIO64OUTCFG_DIS           = 0,     /*!< DIS : Applies when PAD64FNCSEL = GPIO - Output disabled                   */
  GPIO_CFGI_GPIO64OUTCFG_PUSHPULL      = 1,     /*!< PUSHPULL : Applies when PAD64FNCSEL = GPIO - Output is push-pull          */
  GPIO_CFGI_GPIO64OUTCFG_OD            = 2,     /*!< OD : Applies when PAD64FNCSEL = GPIO - Output is open drain               */
  GPIO_CFGI_GPIO64OUTCFG_TS            = 3,     /*!< TS : Applies when PAD64FNCSEL = GPIO - Output is tri-state                */
} GPIO_CFGI_GPIO64OUTCFG_Enum;

/* =============================================  GPIO CFGI GPIO64INCFG [0..0]  ============================================== */
typedef enum {                                  /*!< GPIO_CFGI_GPIO64INCFG                                                     */
  GPIO_CFGI_GPIO64INCFG_READ           = 0,     /*!< READ : Read the GPIO pin data                                             */
  GPIO_CFGI_GPIO64INCFG_RDZERO         = 1,     /*!< RDZERO : INTD = 0 - Readback will always be zero                          */
} GPIO_CFGI_GPIO64INCFG_Enum;

/* =========================================================  CFGJ  ========================================================== */
/* ==============================================  GPIO CFGJ GPIO73INTD [7..7]  ============================================== */
typedef enum {                                  /*!< GPIO_CFGJ_GPIO73INTD                                                      */
  GPIO_CFGJ_GPIO73INTD_nCELOW          = 0,     /*!< nCELOW : Applies when PAD73FNCSEL = NCE73 - nCE polarity active
                                                     low                                                                       */
  GPIO_CFGJ_GPIO73INTD_nCEHIGH         = 1,     /*!< nCEHIGH : Applies when PAD73FNCSEL = NCE73 - nCE polarity active
                                                     high                                                                      */
} GPIO_CFGJ_GPIO73INTD_Enum;

/* =============================================  GPIO CFGJ GPIO73OUTCFG [5..6]  ============================================= */
typedef enum {                                  /*!< GPIO_CFGJ_GPIO73OUTCFG                                                    */
  GPIO_CFGJ_GPIO73OUTCFG_DIS           = 0,     /*!< DIS : Applies when PAD73FNCSEL = GPIO - Output disabled                   */
  GPIO_CFGJ_GPIO73OUTCFG_PUSHPULL      = 1,     /*!< PUSHPULL : Applies when PAD73FNCSEL = GPIO - Output is push-pull          */
  GPIO_CFGJ_GPIO73OUTCFG_OD            = 2,     /*!< OD : Applies when PAD73FNCSEL = GPIO - Output is open drain               */
  GPIO_CFGJ_GPIO73OUTCFG_TS            = 3,     /*!< TS : Applies when PAD73FNCSEL = GPIO - Output is tri-state                */
} GPIO_CFGJ_GPIO73OUTCFG_Enum;

/* =============================================  GPIO CFGJ GPIO73INCFG [4..4]  ============================================== */
typedef enum {                                  /*!< GPIO_CFGJ_GPIO73INCFG                                                     */
  GPIO_CFGJ_GPIO73INCFG_READ           = 0,     /*!< READ : Read the GPIO pin data                                             */
  GPIO_CFGJ_GPIO73INCFG_RDZERO         = 1,     /*!< RDZERO : INTD = 0 - Readback will always be zero                          */
} GPIO_CFGJ_GPIO73INCFG_Enum;

/* ==============================================  GPIO CFGJ GPIO72INTD [3..3]  ============================================== */
typedef enum {                                  /*!< GPIO_CFGJ_GPIO72INTD                                                      */
  GPIO_CFGJ_GPIO72INTD_nCELOW          = 0,     /*!< nCELOW : Applies when PAD72FNCSEL = NCE72 - nCE polarity active
                                                     low                                                                       */
  GPIO_CFGJ_GPIO72INTD_nCEHIGH         = 1,     /*!< nCEHIGH : Applies when PAD72FNCSEL = NCE72 - nCE polarity active
                                                     high                                                                      */
} GPIO_CFGJ_GPIO72INTD_Enum;

/* =============================================  GPIO CFGJ GPIO72OUTCFG [1..2]  ============================================= */
typedef enum {                                  /*!< GPIO_CFGJ_GPIO72OUTCFG                                                    */
  GPIO_CFGJ_GPIO72OUTCFG_DIS           = 0,     /*!< DIS : Applies when PAD72FNCSEL = GPIO - Output disabled                   */
  GPIO_CFGJ_GPIO72OUTCFG_PUSHPULL      = 1,     /*!< PUSHPULL : Applies when PAD72FNCSEL = GPIO - Output is push-pull          */
  GPIO_CFGJ_GPIO72OUTCFG_OD            = 2,     /*!< OD : Applies when PAD72FNCSEL = GPIO - Output is open drain               */
  GPIO_CFGJ_GPIO72OUTCFG_TS            = 3,     /*!< TS : Applies when PAD72FNCSEL = GPIO - Output is tri-state                */
} GPIO_CFGJ_GPIO72OUTCFG_Enum;

/* =============================================  GPIO CFGJ GPIO72INCFG [0..0]  ============================================== */
typedef enum {                                  /*!< GPIO_CFGJ_GPIO72INCFG                                                     */
  GPIO_CFGJ_GPIO72INCFG_READ           = 0,     /*!< READ : Read the GPIO pin data                                             */
  GPIO_CFGJ_GPIO72INCFG_RDZERO         = 1,     /*!< RDZERO : INTD = 0 - Readback will always be zero                          */
} GPIO_CFGJ_GPIO72INCFG_Enum;

