sparkfun/Arduino_Apollo3/cores/arduino/am_sdk_ap3/CMSIS/AmbiqMicro/Include/apollo3c.h
/* ===========================================  GPIO ALTPADCFGM PAD50_SR [20..20]  =========================================== */
typedef enum {                                  /*!< GPIO_ALTPADCFGM_PAD50_SR                                                  */
  GPIO_ALTPADCFGM_PAD50_SR_SR_EN       = 1,     /*!< SR_EN : Enables Slew rate control on pad                                  */
} GPIO_ALTPADCFGM_PAD50_SR_Enum;

/* ===========================================  GPIO ALTPADCFGM PAD49_SR [12..12]  =========================================== */
typedef enum {                                  /*!< GPIO_ALTPADCFGM_PAD49_SR                                                  */
  GPIO_ALTPADCFGM_PAD49_SR_SR_EN       = 1,     /*!< SR_EN : Enables Slew rate control on pad                                  */
} GPIO_ALTPADCFGM_PAD49_SR_Enum;

/* ============================================  GPIO ALTPADCFGM PAD48_SR [4..4]  ============================================ */
typedef enum {                                  /*!< GPIO_ALTPADCFGM_PAD48_SR                                                  */
  GPIO_ALTPADCFGM_PAD48_SR_SR_EN       = 1,     /*!< SR_EN : Enables Slew rate control on pad                                  */
} GPIO_ALTPADCFGM_PAD48_SR_Enum;

/* ======================================================  ALTPADCFGN  ======================================================= */
/* ===========================================  GPIO ALTPADCFGN PAD55_SR [28..28]  =========================================== */
typedef enum {                                  /*!< GPIO_ALTPADCFGN_PAD55_SR                                                  */
  GPIO_ALTPADCFGN_PAD55_SR_SR_EN       = 1,     /*!< SR_EN : Enables Slew rate control on pad                                  */
} GPIO_ALTPADCFGN_PAD55_SR_Enum;

/* ===========================================  GPIO ALTPADCFGN PAD54_SR [20..20]  =========================================== */
typedef enum {                                  /*!< GPIO_ALTPADCFGN_PAD54_SR                                                  */
  GPIO_ALTPADCFGN_PAD54_SR_SR_EN       = 1,     /*!< SR_EN : Enables Slew rate control on pad                                  */
} GPIO_ALTPADCFGN_PAD54_SR_Enum;

/* ===========================================  GPIO ALTPADCFGN PAD53_SR [12..12]  =========================================== */
typedef enum {                                  /*!< GPIO_ALTPADCFGN_PAD53_SR                                                  */
  GPIO_ALTPADCFGN_PAD53_SR_SR_EN       = 1,     /*!< SR_EN : Enables Slew rate control on pad                                  */
} GPIO_ALTPADCFGN_PAD53_SR_Enum;

/* ============================================  GPIO ALTPADCFGN PAD52_SR [4..4]  ============================================ */
typedef enum {                                  /*!< GPIO_ALTPADCFGN_PAD52_SR                                                  */
  GPIO_ALTPADCFGN_PAD52_SR_SR_EN       = 1,     /*!< SR_EN : Enables Slew rate control on pad                                  */
} GPIO_ALTPADCFGN_PAD52_SR_Enum;

/* ======================================================  ALTPADCFGO  ======================================================= */
/* ===========================================  GPIO ALTPADCFGO PAD59_SR [28..28]  =========================================== */
typedef enum {                                  /*!< GPIO_ALTPADCFGO_PAD59_SR                                                  */
  GPIO_ALTPADCFGO_PAD59_SR_SR_EN       = 1,     /*!< SR_EN : Enables Slew rate control on pad                                  */
} GPIO_ALTPADCFGO_PAD59_SR_Enum;

/* ===========================================  GPIO ALTPADCFGO PAD58_SR [20..20]  =========================================== */
typedef enum {                                  /*!< GPIO_ALTPADCFGO_PAD58_SR                                                  */
  GPIO_ALTPADCFGO_PAD58_SR_SR_EN       = 1,     /*!< SR_EN : Enables Slew rate control on pad                                  */
} GPIO_ALTPADCFGO_PAD58_SR_Enum;

/* ===========================================  GPIO ALTPADCFGO PAD57_SR [12..12]  =========================================== */
typedef enum {                                  /*!< GPIO_ALTPADCFGO_PAD57_SR                                                  */
  GPIO_ALTPADCFGO_PAD57_SR_SR_EN       = 1,     /*!< SR_EN : Enables Slew rate control on pad                                  */
} GPIO_ALTPADCFGO_PAD57_SR_Enum;

/* ============================================  GPIO ALTPADCFGO PAD56_SR [4..4]  ============================================ */
typedef enum {                                  /*!< GPIO_ALTPADCFGO_PAD56_SR                                                  */
  GPIO_ALTPADCFGO_PAD56_SR_SR_EN       = 1,     /*!< SR_EN : Enables Slew rate control on pad                                  */
} GPIO_ALTPADCFGO_PAD56_SR_Enum;

/* ======================================================  ALTPADCFGP  ======================================================= */
/* ===========================================  GPIO ALTPADCFGP PAD63_SR [28..28]  =========================================== */
typedef enum {                                  /*!< GPIO_ALTPADCFGP_PAD63_SR                                                  */
  GPIO_ALTPADCFGP_PAD63_SR_SR_EN       = 1,     /*!< SR_EN : Enables Slew rate control on pad                                  */
} GPIO_ALTPADCFGP_PAD63_SR_Enum;

/* ===========================================  GPIO ALTPADCFGP PAD62_SR [20..20]  =========================================== */
typedef enum {                                  /*!< GPIO_ALTPADCFGP_PAD62_SR                                                  */
  GPIO_ALTPADCFGP_PAD62_SR_SR_EN       = 1,     /*!< SR_EN : Enables Slew rate control on pad                                  */
} GPIO_ALTPADCFGP_PAD62_SR_Enum;

/* ===========================================  GPIO ALTPADCFGP PAD61_SR [12..12]  =========================================== */
typedef enum {                                  /*!< GPIO_ALTPADCFGP_PAD61_SR                                                  */
  GPIO_ALTPADCFGP_PAD61_SR_SR_EN       = 1,     /*!< SR_EN : Enables Slew rate control on pad                                  */
} GPIO_ALTPADCFGP_PAD61_SR_Enum;

/* ============================================  GPIO ALTPADCFGP PAD60_SR [4..4]  ============================================ */
typedef enum {                                  /*!< GPIO_ALTPADCFGP_PAD60_SR                                                  */
  GPIO_ALTPADCFGP_PAD60_SR_SR_EN       = 1,     /*!< SR_EN : Enables Slew rate control on pad                                  */
} GPIO_ALTPADCFGP_PAD60_SR_Enum;

/* ======================================================  ALTPADCFGQ  ======================================================= */
/* ===========================================  GPIO ALTPADCFGQ PAD67_SR [28..28]  =========================================== */
typedef enum {                                  /*!< GPIO_ALTPADCFGQ_PAD67_SR                                                  */
  GPIO_ALTPADCFGQ_PAD67_SR_SR_EN       = 1,     /*!< SR_EN : Enables Slew rate control on pad                                  */
} GPIO_ALTPADCFGQ_PAD67_SR_Enum;

/* ===========================================  GPIO ALTPADCFGQ PAD66_SR [20..20]  =========================================== */
typedef enum {                                  /*!< GPIO_ALTPADCFGQ_PAD66_SR                                                  */
  GPIO_ALTPADCFGQ_PAD66_SR_SR_EN       = 1,     /*!< SR_EN : Enables Slew rate control on pad                                  */
} GPIO_ALTPADCFGQ_PAD66_SR_Enum;

