sparkfun/Arduino_Apollo3/cores/arduino/am_sdk_ap3/CMSIS/AmbiqMicro/Include/apollo3c.h
/* ===========================================  GPIO ALTPADCFGQ PAD65_SR [12..12]  =========================================== */
typedef enum {                                  /*!< GPIO_ALTPADCFGQ_PAD65_SR                                                  */
  GPIO_ALTPADCFGQ_PAD65_SR_SR_EN       = 1,     /*!< SR_EN : Enables Slew rate control on pad                                  */
} GPIO_ALTPADCFGQ_PAD65_SR_Enum;

/* ============================================  GPIO ALTPADCFGQ PAD64_SR [4..4]  ============================================ */
typedef enum {                                  /*!< GPIO_ALTPADCFGQ_PAD64_SR                                                  */
  GPIO_ALTPADCFGQ_PAD64_SR_SR_EN       = 1,     /*!< SR_EN : Enables Slew rate control on pad                                  */
} GPIO_ALTPADCFGQ_PAD64_SR_Enum;

/* ======================================================  ALTPADCFGR  ======================================================= */
/* ===========================================  GPIO ALTPADCFGR PAD71_SR [28..28]  =========================================== */
typedef enum {                                  /*!< GPIO_ALTPADCFGR_PAD71_SR                                                  */
  GPIO_ALTPADCFGR_PAD71_SR_SR_EN       = 1,     /*!< SR_EN : Enables Slew rate control on pad                                  */
} GPIO_ALTPADCFGR_PAD71_SR_Enum;

/* ===========================================  GPIO ALTPADCFGR PAD70_SR [20..20]  =========================================== */
typedef enum {                                  /*!< GPIO_ALTPADCFGR_PAD70_SR                                                  */
  GPIO_ALTPADCFGR_PAD70_SR_SR_EN       = 1,     /*!< SR_EN : Enables Slew rate control on pad                                  */
} GPIO_ALTPADCFGR_PAD70_SR_Enum;

/* ===========================================  GPIO ALTPADCFGR PAD69_SR [12..12]  =========================================== */
typedef enum {                                  /*!< GPIO_ALTPADCFGR_PAD69_SR                                                  */
  GPIO_ALTPADCFGR_PAD69_SR_SR_EN       = 1,     /*!< SR_EN : Enables Slew rate control on pad                                  */
} GPIO_ALTPADCFGR_PAD69_SR_Enum;

/* ============================================  GPIO ALTPADCFGR PAD68_SR [4..4]  ============================================ */
typedef enum {                                  /*!< GPIO_ALTPADCFGR_PAD68_SR                                                  */
  GPIO_ALTPADCFGR_PAD68_SR_SR_EN       = 1,     /*!< SR_EN : Enables Slew rate control on pad                                  */
} GPIO_ALTPADCFGR_PAD68_SR_Enum;

/* ======================================================  ALTPADCFGS  ======================================================= */
/* ===========================================  GPIO ALTPADCFGS PAD73_SR [12..12]  =========================================== */
typedef enum {                                  /*!< GPIO_ALTPADCFGS_PAD73_SR                                                  */
  GPIO_ALTPADCFGS_PAD73_SR_SR_EN       = 1,     /*!< SR_EN : Enables Slew rate control on pad                                  */
} GPIO_ALTPADCFGS_PAD73_SR_Enum;

/* ============================================  GPIO ALTPADCFGS PAD72_SR [4..4]  ============================================ */
typedef enum {                                  /*!< GPIO_ALTPADCFGS_PAD72_SR                                                  */
  GPIO_ALTPADCFGS_PAD72_SR_SR_EN       = 1,     /*!< SR_EN : Enables Slew rate control on pad                                  */
} GPIO_ALTPADCFGS_PAD72_SR_Enum;

/* =========================================================  SCDET  ========================================================= */
/* ========================================================  CTENCFG  ======================================================== */
/* ==============================================  GPIO CTENCFG EN31 [31..31]  =============================================== */
typedef enum {                                  /*!< GPIO_CTENCFG_EN31                                                         */
  GPIO_CTENCFG_EN31_DIS                = 1,     /*!< DIS : Disable CT31 for output                                             */
  GPIO_CTENCFG_EN31_EN                 = 0,     /*!< EN : Enable CT31 for output                                               */
} GPIO_CTENCFG_EN31_Enum;

/* ==============================================  GPIO CTENCFG EN30 [30..30]  =============================================== */
typedef enum {                                  /*!< GPIO_CTENCFG_EN30                                                         */
  GPIO_CTENCFG_EN30_DIS                = 1,     /*!< DIS : Disable CT30 for output                                             */
  GPIO_CTENCFG_EN30_EN                 = 0,     /*!< EN : Enable CT30 for output                                               */
} GPIO_CTENCFG_EN30_Enum;

/* ==============================================  GPIO CTENCFG EN29 [29..29]  =============================================== */
typedef enum {                                  /*!< GPIO_CTENCFG_EN29                                                         */
  GPIO_CTENCFG_EN29_DIS                = 1,     /*!< DIS : Disable CT29 for output                                             */
  GPIO_CTENCFG_EN29_EN                 = 0,     /*!< EN : Enable CT29 for output                                               */
} GPIO_CTENCFG_EN29_Enum;

/* ==============================================  GPIO CTENCFG EN28 [28..28]  =============================================== */
typedef enum {                                  /*!< GPIO_CTENCFG_EN28                                                         */
  GPIO_CTENCFG_EN28_DIS                = 1,     /*!< DIS : Disable CT28 for output                                             */
  GPIO_CTENCFG_EN28_EN                 = 0,     /*!< EN : Enable CT28 for output                                               */
} GPIO_CTENCFG_EN28_Enum;

/* ==============================================  GPIO CTENCFG EN27 [27..27]  =============================================== */
typedef enum {                                  /*!< GPIO_CTENCFG_EN27                                                         */
  GPIO_CTENCFG_EN27_DIS                = 1,     /*!< DIS : Disable CT27 for output                                             */
  GPIO_CTENCFG_EN27_EN                 = 0,     /*!< EN : Enable CT27 for output                                               */
} GPIO_CTENCFG_EN27_Enum;

