sparkfun/Arduino_Apollo3/cores/arduino/am_sdk_ap3/CMSIS/AmbiqMicro/Include/apollo3c.h
/* ================================================  RTC RTCCTL WRTC [0..0]  ================================================= */
typedef enum {                                  /*!< RTC_RTCCTL_WRTC                                                           */
  RTC_RTCCTL_WRTC_DIS                  = 0,     /*!< DIS : Counter writes are disabled                                         */
  RTC_RTCCTL_WRTC_EN                   = 1,     /*!< EN : Counter writes are enabled                                           */
} RTC_RTCCTL_WRTC_Enum;

/* =========================================================  INTEN  ========================================================= */
/* ========================================================  INTSTAT  ======================================================== */
/* ========================================================  INTCLR  ========================================================= */
/* ========================================================  INTSET  ========================================================= */


/* =========================================================================================================================== */
/* ================                                           SCARD                                           ================ */
/* =========================================================================================================================== */

/* ==========================================================  SR  =========================================================== */
/* ==================================================  SCARD SR FHF [6..6]  ================================================== */
typedef enum {                                  /*!< SCARD_SR_FHF                                                              */
  SCARD_SR_FHF_HALFFULL                = 1,     /*!< HALFFULL : FIFO is half full.                                             */
} SCARD_SR_FHF_Enum;

/* ================================================  SCARD SR FT2REND [5..5]  ================================================ */
typedef enum {                                  /*!< SCARD_SR_FT2REND                                                          */
  SCARD_SR_FT2REND_CMPL                = 1,     /*!< CMPL : TX to RX completed.                                                */
  SCARD_SR_FT2REND_NOTCMPL             = 0,     /*!< NOTCMPL : TX to RX not completed.                                         */
} SCARD_SR_FT2REND_Enum;

/* ==================================================  SCARD SR PE [4..4]  =================================================== */
typedef enum {                                  /*!< SCARD_SR_PE                                                               */
  SCARD_SR_PE_PEERR                    = 1,     /*!< PEERR : Parity error.                                                     */
  SCARD_SR_PE_PENONE                   = 0,     /*!< PENONE : No parity error.                                                 */
} SCARD_SR_PE_Enum;

/* ==================================================  SCARD SR OVR [3..3]  ================================================== */
typedef enum {                                  /*!< SCARD_SR_OVR                                                              */
  SCARD_SR_OVR_RXOVR                   = 1,     /*!< RXOVR : RX FIFO overflow.                                                 */
  SCARD_SR_OVR_RXOVRNONE               = 0,     /*!< RXOVRNONE : RX FIFO no overflow.                                          */
} SCARD_SR_OVR_Enum;

/* ==================================================  SCARD SR FER [2..2]  ================================================== */
typedef enum {                                  /*!< SCARD_SR_FER                                                              */
  SCARD_SR_FER_FRAMINGERR              = 1,     /*!< FRAMINGERR : Framing error.                                               */
  SCARD_SR_FER_NOFRAMINGERR            = 0,     /*!< NOFRAMINGERR : No framing error detected.                                 */
} SCARD_SR_FER_Enum;

/* ================================================  SCARD SR TBERBF [1..1]  ================================================= */
typedef enum {                                  /*!< SCARD_SR_TBERBF                                                           */
  SCARD_SR_TBERBF_TXFIFOEMPTY          = 1,     /*!< TXFIFOEMPTY : Transmit: FIFO empty.                                       */
  SCARD_SR_TBERBF_TXFIFONOTEMPTY       = 0,     /*!< TXFIFONOTEMPTY : Transmit: FIFO not empty.                                */
} SCARD_SR_TBERBF_Enum;

/* ==================================================  SCARD SR FNE [0..0]  ================================================== */
typedef enum {                                  /*!< SCARD_SR_FNE                                                              */
  SCARD_SR_FNE_NOTEMPTY                = 1,     /*!< NOTEMPTY : RX FIFO not empty.                                             */
  SCARD_SR_FNE_EMPTY                   = 0,     /*!< EMPTY : RX FIFO empty.                                                    */
} SCARD_SR_FNE_Enum;

/* ==========================================================  IER  ========================================================== */
/* ==========================================================  TCR  ========================================================== */
/* ==========================================================  UCR  ========================================================== */
/* ==========================================================  DR  =========================================================== */
/* =========================================================  BPRL  ========================================================== */
/* =========================================================  BPRH  ========================================================== */
/* =========================================================  UCR1  ========================================================== */
/* ==========================================================  SR1  ========================================================== */
/* =================================================  SCARD SR1 IDLE [3..3]  ================================================= */
typedef enum {                                  /*!< SCARD_SR1_IDLE                                                            */
  SCARD_SR1_IDLE_IDLE                  = 1,     /*!< IDLE : ISO7816 idle.                                                      */
  SCARD_SR1_IDLE_ACTIVE                = 0,     /*!< ACTIVE : ISO7816 active.                                                  */
} SCARD_SR1_IDLE_Enum;

/* ===============================================  SCARD SR1 SYNCEND [2..2]  ================================================ */
typedef enum {                                  /*!< SCARD_SR1_SYNCEND                                                         */
  SCARD_SR1_SYNCEND_CMPL               = 1,     /*!< CMPL : Synchronization complete.                                          */
  SCARD_SR1_SYNCEND_INCMPL             = 0,     /*!< INCMPL : Incomplete.                                                      */
} SCARD_SR1_SYNCEND_Enum;

